{
    "author": "TeriGlover",
    "message": "docs: Edits to remove jargon (#42861)\n\nPR Close #42861",
    "sha": "05d996d8039b82fd0361a921224fdbf07c4b2c91",
    "files": [
        {
            "sha": "3d3188b303268000bdb80d6ec26257e65ee39d3b",
            "filename": "aio/content/guide/setup-local.md",
            "status": "modified",
            "additions": 3,
            "deletions": 3,
            "changes": 6,
            "blob_url": "https://github.com/angular/angular/blob/05d996d8039b82fd0361a921224fdbf07c4b2c91/aio%2Fcontent%2Fguide%2Fsetup-local.md",
            "raw_url": "https://github.com/angular/angular/raw/05d996d8039b82fd0361a921224fdbf07c4b2c91/aio%2Fcontent%2Fguide%2Fsetup-local.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fsetup-local.md?ref=05d996d8039b82fd0361a921224fdbf07c4b2c91",
            "patch": "@@ -6,7 +6,7 @@ It includes information about prerequisites, installing the CLI, creating an ini\n <div class=\"callout is-helpful\">\n <header>Try Angular without local setup</header>\n \n-If you are new to Angular, you might want to start with [Try it now!](start), which introduces the essentials of Angular in the context of a ready-made basic online store app that you can examine and modify. This standalone tutorial takes advantage of the interactive [StackBlitz](https://stackblitz.com/) environment for online development. You don't need to set up your local environment until you're ready.\n+If you are new to Angular, you might want to start with [Try it now!](start), which introduces the essentials of Angular in the context of a ready-made basic online store app for you to examine and modify. This standalone tutorial takes advantage of the interactive [StackBlitz](https://stackblitz.com/) environment for online development. You don't need to set up your local environment until you're ready.\n \n </div>\n \n@@ -87,7 +87,7 @@ The CLI creates a new workspace and a simple Welcome app, ready to run.\n \n ## Run the application\n \n-The Angular CLI includes a server, so that you can build and serve your app locally.\n+The Angular CLI includes a server, for you to build and serve your app locally.\n \n 1. Navigate to the workspace folder, such as `my-app`.\n \n@@ -118,6 +118,6 @@ If your installation and setup was successful, you should see a page similar to\n \n * Work through the [Tour of Heroes Tutorial](tutorial), a complete hands-on exercise that introduces you to the app development process using the Angular CLI and walks through important subsystems.\n \n-* To learn more about using the Angular CLI, see the [CLI Overview](cli \"CLI Overview\"). In addition to creating the initial workspace and app scaffolding, you can use the CLI to generate Angular code such as components and services. The CLI supports the full development cycle, including building, testing, bundling, and deployment.\n+* To learn more about using the Angular CLI, see the [CLI Overview](cli \"CLI Overview\"). In addition to creating the initial workspace and app scaffolding, use the CLI to generate Angular code such as components and services. The CLI supports the full development cycle, including building, testing, bundling, and deployment.\n \n * For more information about the Angular files generated by `ng new`, see [Workspace and Project File Structure](guide/file-structure)."
        },
        {
            "sha": "7fd1a9d4e7d49460cc494b9db636aed9ef778983",
            "filename": "aio/content/guide/what-is-angular.md",
            "status": "modified",
            "additions": 13,
            "deletions": 13,
            "changes": 26,
            "blob_url": "https://github.com/angular/angular/blob/05d996d8039b82fd0361a921224fdbf07c4b2c91/aio%2Fcontent%2Fguide%2Fwhat-is-angular.md",
            "raw_url": "https://github.com/angular/angular/raw/05d996d8039b82fd0361a921224fdbf07c4b2c91/aio%2Fcontent%2Fguide%2Fwhat-is-angular.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fwhat-is-angular.md?ref=05d996d8039b82fd0361a921224fdbf07c4b2c91",
            "patch": "@@ -8,7 +8,7 @@ Angular is a development platform, built on [TypeScript](https://www.typescriptl\n * A collection of well-integrated libraries that cover a wide variety of features, including routing, forms management, client-server communication, and more\n * A suite of developer tools to help you develop, build, test, and update your code\n \n-With Angular, you're taking advantage of a platform that can scale from single-developer projects to enterprise-level applications. Angular is designed to make updating as easy as possible, so you can take advantage of the latest developments with a minimum of effort. Best of all, the Angular ecosystem consists of a diverse group of over 1.7 million developers, library authors, and content creators.\n+With Angular, you're taking advantage of a platform that can scale from single-developer projects to enterprise-level applications. Angular is designed to make updating as straightforward as possible, so take advantage of the latest developments with a minimum of effort. Best of all, the Angular ecosystem consists of a diverse group of over 1.7 million developers, library authors, and content creators.\n \n <div class=\"alert is-helpful\">\n \n@@ -43,9 +43,9 @@ When Angular renders this component, the resulting DOM looks like this:\n \n <code-example path=\"what-is-angular/src/app/hello-world-example.html\" language=\"html\"></code-example>\n \n-Angular's component model offers strong encapsulation and an intuitive application structure. Components also make your application easier to unit test and can improve the overall readability of your code.\n+Angular's component model offers strong encapsulation and an intuitive application structure. Components also make your application painless to unit test and can improve the overall readability of your code.\n \n-For more information on what you can do with components, see the [Components](guide/component-overview) section.\n+For more information on what to do with components, see the [Components](guide/component-overview) section.\n \n {@a templates}\n ### Templates\n@@ -74,7 +74,7 @@ Angular also supports property bindings, to help you set values for properties a\n \n Notice the use of the square brackets--that syntax indicates that you're binding the property or attribute to a value in the component class.\n \n-You can also declare event listeners to listen for and respond to user actions such as keystrokes, mouse movements, clicks, and touches. You declare an event listener by specifying the event name in parentheses:\n+Declare event listeners to listen for and respond to user actions such as keystrokes, mouse movements, clicks, and touches. You declare an event listener by specifying the event name in parentheses:\n \n <code-example path=\"what-is-angular/src/app/hello-world-bindings/hello-world-bindings.component.html\" region=\"event-binding\"></code-example>\n \n@@ -96,7 +96,7 @@ The following is an example of interpolation and bindings within an Angular temp\n   </code-pane>\n </code-tabs>\n \n-You can add additional functionality to your templates through the use of [directives](guide/built-in-directives). The most popular directives in Angular are `*ngIf` and `*ngFor`. You can use directives to perform a variety of tasks, such as dynamically modifying the DOM structure. And you can also create your own custom directives to create great user experiences.\n+Add additional functionality to your templates through the use of [directives](guide/built-in-directives). The most popular directives in Angular are `*ngIf` and `*ngFor`. Use directives to perform a variety of tasks, such as dynamically modifying the DOM structure. And create your own custom directives to create great user experiences.\n \n The following code is an example of the `*ngIf` directive.\n \n@@ -112,14 +112,14 @@ The following code is an example of the `*ngIf` directive.\n   </code-pane>\n </code-tabs>\n \n-Angular's declarative templates allow you to cleanly separate your application's logic from its presentation. Templates are based on standard HTML, so they're easy to build, maintain, and update.\n+Angular's declarative templates let you cleanly separate your application's logic from its presentation. Templates are based on standard HTML, for ease in building, maintaining, and updating.\n \n-For more information on what you can do with templates, see the [Templates](guide/template-syntax) section.\n+For more information on templates, see the [Templates](guide/template-syntax) section.\n \n {@a di}\n ### Dependency injection\n \n-Dependency injection allows you to declare the dependencies of your TypeScript classes without taking care of their instantiation. Instead, Angular handles the instantiation for you. This design pattern allows you to write more testable and flexible code. Even though understanding dependency injection is not critical to start using Angular, we strongly recommend it as a best practice and many aspects of Angular take advantage of it to some degree.\n+Dependency injection lets you declare the dependencies of your TypeScript classes without taking care of their instantiation. Instead, Angular handles the instantiation for you. This design pattern lets you write more testable and flexible code. Even though understanding dependency injection is not critical to start using Angular, we strongly recommend it as a best practice and many aspects of Angular take advantage of it to some degree.\n \n To illustrate how dependency injection works, consider the following example. The first file, `logger.service.ts`, defines a `Logger` class. This class contains a `writeCount` function that logs a number to the console.\n \n@@ -135,7 +135,7 @@ For more information about dependency injection and Angular, see the [Dependency\n \n ## Angular CLI\n \n-The Angular CLI is the fastest, easiest, and recommended way to develop Angular applications. The Angular CLI makes a number of tasks easy. Here are some examples:\n+The Angular CLI is the fastest, straightforward, and recommended way to develop Angular applications. The Angular CLI makes a number of tasks trouble-free. Here are some examples:\n \n <table>\n <tr>\n@@ -167,7 +167,7 @@ For more information about the Angular CLI, see the [CLI Reference](/cli) sectio\n {@a 1p-libraries}\n ## First-party libraries\n \n-The section, [Angular applications: The essentials](#essentials), provides a brief overview of a couple of the key architectural elements you'll use when building Angular applications. But the many benefits of Angular really become apparent when your application grows and you want to add additional functions such as site navigation or user input. That's when you can leverage the Angular platform to incorporate one of the many first-party libraries that Angular provides.\n+The section, [Angular applications: The essentials](#essentials), provides a brief overview of a couple of the key architectural elements you'll use when building Angular applications. But the many benefits of Angular really become apparent when your application grows and you want to add additional functions such as site navigation or user input. Use the Angular platform to incorporate one of the many first-party libraries that Angular provides.\n \n Some of the libraries available to you include:\n <table>\n@@ -196,15 +196,15 @@ Some of the libraries available to you include:\n </tr>\n </table>\n \n-These libraries expand your application's functionality while also allowing you to focus more on the features that make your application unique. And you can add these libraries knowing that they're designed to integrate seamlessly into and update simultaneously with the Angular framework.\n+These libraries expand your application's functionality while also letting you focus more on the features that make your application unique. Add these libraries knowing that they're designed to integrate seamlessly into and update simultaneously with the Angular framework.\n \n These libraries are only required if and when they can help you add functionality to your applications or solve a particular problem.\n \n ## Next steps\n \n-This topic is intended to give you a brief overview of what Angular is, the advantages it provides, and what you can expect as you start to build your applications.\n+This topic is intended to give you a brief overview of what Angular is, the advantages it provides, and what to expect as you start to build your applications.\n \n-To see Angular in action, see our [Getting Started](https://angular.io/start) tutorial. This tutorial uses [stackblitz.com](https://stackblitz.com/), so you can explore a working example of Angular without any installation requirements.\n+To see Angular in action, see our [Getting Started](https://angular.io/start) tutorial. This tutorial uses [stackblitz.com](https://stackblitz.com/), for you to explore a working example of Angular without any installation requirements.\n \n To explore Angular's capabilities further, we recommend reading through the sections, Understanding Angular and Developer Guides.\n "
        }
    ],
    "stats": {
        "total": 32,
        "additions": 16,
        "deletions": 16
    }
}