{
    "author": "TeriGlover",
    "message": "docs: Edited to remove jargon in Reference, Glossary, and Style sections (#42187)\n\nPR Close #42187",
    "sha": "0777faccfb4804578568bb2b794a13e209c158e1",
    "files": [
        {
            "sha": "d057555cb2631ab657fd624d2eb5f636c4970441",
            "filename": "aio/content/guide/cheatsheet.md",
            "status": "modified",
            "additions": 3,
            "deletions": 3,
            "changes": 6,
            "blob_url": "https://github.com/angular/angular/blob/0777faccfb4804578568bb2b794a13e209c158e1/aio%2Fcontent%2Fguide%2Fcheatsheet.md",
            "raw_url": "https://github.com/angular/angular/raw/0777faccfb4804578568bb2b794a13e209c158e1/aio%2Fcontent%2Fguide%2Fcheatsheet.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fcheatsheet.md?ref=0777faccfb4804578568bb2b794a13e209c158e1",
            "patch": "@@ -11,7 +11,7 @@\n </tr>\n <tr>\n <td><code><b>platformBrowserDynamic().bootstrapModule</b>(AppModule);</code></td>\n-<td><p>Bootstraps the app, using the root component from the specified <code>NgModule</code>. </p>\n+<td><p>Bootstraps the application, using the root component from the specified <code>NgModule</code>. </p>\n </td>\n </tr>\n </tbody></table>\n@@ -110,7 +110,7 @@ is available to <code>declarations</code> of this module.</p>\n </td>\n </tr><tr>\n <td><code>&lt;p&gt;Card No.: <b>{{cardNumber | myCardNumberFormatter}}</b>&lt;/p&gt;</code></td>\n-<td><p>Transforms the current value of expression <code>cardNumber</code> via the pipe called <code>myCardNumberFormatter</code>.</p>\n+<td><p>Transforms the current value of expression <code>cardNumber</code> using the pipe called <code>myCardNumberFormatter</code>.</p>\n </td>\n </tr><tr>\n <td><code>&lt;p&gt;Employer: <b>{{employer?.companyName}}</b>&lt;/p&gt;</code></td>\n@@ -276,7 +276,7 @@ so the <code>@Directive</code> configuration applies to components as well</p>\n </tr>\n <tr>\n <td><code><b>@Input()</b> myProperty;</code></td>\n-<td><p>Declares an input property that you can update via property binding (example:\n+<td><p>Declares an input property that you can update using property binding (example:\n <code>&lt;my-cmp [myProperty]=\"someExpression\"&gt;</code>).</p>\n </td>\n </tr><tr>"
        },
        {
            "sha": "ea683fc6a7a4147682976dcd3a3dc96bd65aa4c8",
            "filename": "aio/content/guide/docs-style-guide.md",
            "status": "modified",
            "additions": 8,
            "deletions": 8,
            "changes": 16,
            "blob_url": "https://github.com/angular/angular/blob/0777faccfb4804578568bb2b794a13e209c158e1/aio%2Fcontent%2Fguide%2Fdocs-style-guide.md",
            "raw_url": "https://github.com/angular/angular/raw/0777faccfb4804578568bb2b794a13e209c158e1/aio%2Fcontent%2Fguide%2Fdocs-style-guide.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fdocs-style-guide.md?ref=0777faccfb4804578568bb2b794a13e209c158e1",
            "patch": "@@ -207,11 +207,11 @@ Do not create a node that is both a header and an item node by specifying the `u\n \n ## Code snippets\n \n-[Angular.io](https://angular.io/docs) has a custom framework that enables authors to include code snippets directly from working example apps that are automatically tested as part of documentation builds.\n+[Angular.io](https://angular.io/docs) has a custom framework that enables authors to include code snippets directly from working example applications that are automatically tested as part of documentation builds.\n \n In addition to working code snippets, example code can include terminal commands, a fragment of TypeScript or HTML, or an entire code file.\n \n-Whatever the source, the doc viewer renders them as code snippets, either individually with the [code-example](#code-example \"code-example\") component or as a tabbed collection with the [code-tabs](#code-tabs \"code-tabs\") component.\n+Whatever the source, the document viewer renders them as code snippets, either individually with the [code-example](#code-example \"code-example\") component or as a tabbed collection with the [code-tabs](#code-tabs \"code-tabs\") component.\n \n {@a code-example}\n \n@@ -278,9 +278,9 @@ For hypothetical examples such as illustrations of configuration options in a JS\n \n One of the Angular documentation design goals is that guide page code snippets be examples of working code.\n \n-Authors meet this goal by displaying code snippets directly from working sample apps, written specifically for these guide pages.\n+Authors meet this goal by displaying code snippets directly from working sample applications, written specifically for these guide pages.\n \n-Find sample apps in sub-folders of the `content/examples` directory of the `angular/angular` repository.\n+Find sample applications in sub-folders of the `content/examples` directory of the `angular/angular` repository.\n An example folder name is often the same as the guide page it supports.\n \n <div class=\"alert is-helpful\">\n@@ -312,11 +312,11 @@ The following markup produces that snippet:\n </code-example>\n ```\n \n-The `path` attribute identifies the snippet's source file at the example app folder's location within `content/examples`.\n+The `path` attribute identifies the snippet's source file at the example application folder's location within `content/examples`.\n In this example, that path is  `docs-style-guide/src/app/app.module.ts`.\n \n The header tells the reader where to find the file.\n-Following convention, set the `header` attribute to the file's location within the example app's root folder.\n+Following convention, set the `header` attribute to the file's location within the example application's root folder.\n \n Unless otherwise noted, all code snippets in this page are from sample source code located in the `content/examples/docs-style-guide` directory.\n \n@@ -385,7 +385,7 @@ export class AppModule { }\n The opening and ending `#docregion` lines designate any lines of code between them as being included in the code snippet.\n This is why the import statements outside of the `class` `#docregion` are not in the code snippet.\n \n-For more information on how to prepare example app files for use in guides, see\n+For more information on how to prepare example application files for use in guides, see\n  [Source code markup](#source-code-markup).\n \n ### Code snippet options\n@@ -903,7 +903,7 @@ The browser renders the following:\n This is a [link to that custom anchor name](#section-anchors).\n \n When editing a file, don't remove any anchors.\n-If you change the document structure, you can move an existing anchor within that same doc without breaking a link.\n+If you change the document structure, you can move an existing anchor within that same document without breaking a link.\n You can also add more anchors with more appropriate text.\n \n <div class=\"alert is-helpful\">"
        },
        {
            "sha": "b767eb7057a3bf6fa8f616d5511b84d79dd16707",
            "filename": "aio/content/guide/glossary.md",
            "status": "modified",
            "additions": 25,
            "deletions": 25,
            "changes": 50,
            "blob_url": "https://github.com/angular/angular/blob/0777faccfb4804578568bb2b794a13e209c158e1/aio%2Fcontent%2Fguide%2Fglossary.md",
            "raw_url": "https://github.com/angular/angular/raw/0777faccfb4804578568bb2b794a13e209c158e1/aio%2Fcontent%2Fguide%2Fglossary.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fglossary.md?ref=0777faccfb4804578568bb2b794a13e209c158e1",
            "patch": "@@ -44,7 +44,7 @@ A structure that provides metadata for a class. See [decorator](#decorator).\n \n ## app-shell\n \n-App shell is a way to render a portion of your application via a route at build time.\n+App shell is a way to render a portion of your application using a route at build time.\n This gives users a meaningful first paint of your application that appears quickly because the browser can render static HTML and CSS without the need to initialize JavaScript.\n \n Learn more in [The App Shell Model](https://developers.google.com/web/fundamentals/architecture/app-shell).\n@@ -99,11 +99,11 @@ between a [token](#token) and a dependency [provider](#provider).\n \n ## bootstrap\n \n-A way to initialize and launch an app or system.\n+A way to initialize and launch an application or system.\n \n-In Angular, an app's root NgModule (`AppModule`) has a `bootstrap` property that identifies the app's top-level [components](#component).\n+In Angular, an application's root NgModule (`AppModule`) has a `bootstrap` property that identifies the application's top-level [components](#component).\n During the bootstrap process, Angular creates and inserts these components into the `index.html` host web page.\n-You can bootstrap multiple apps in the same `index.html`. Each app contains its own components.\n+You can bootstrap multiple applications in the same `index.html`. Each application contains its own components.\n \n Learn more in [Bootstrapping](guide/bootstrapping).\n \n@@ -231,7 +231,7 @@ A web platform feature, currently supported by most browsers and available in ot\n \n The custom element feature extends HTML by allowing you to define a tag whose content is created and controlled by JavaScript code. A custom element (also called a *web component*) is recognized by a browser when it's added to the [CustomElementRegistry](https://developer.mozilla.org/en-US/docs/Web/API/CustomElementRegistry).\n \n-You can use the API to transform an Angular component so that it can be registered with the browser and used in any HTML that you add directly to the DOM within an Angular app. The custom element tag inserts the component's view, with change-detection and data-binding functionality, into content that would otherwise be displayed without Angular processing.\n+You can use the API to transform an Angular component so that it can be registered with the browser and used in any HTML that you add directly to the DOM within an Angular application. The custom element tag inserts the component's view, with change-detection and data-binding functionality, into content that would otherwise be displayed without Angular processing.\n \n See [Angular element](#angular-element).\n \n@@ -244,7 +244,7 @@ See also [dynamic component loading](#dynamic-components).\n \n ## data binding\n \n-A process that allows apps to display data values to a user and respond to user\n+A process that allows applications to display data values to a user and respond to user\n actions (such as clicks, touches, and keystrokes).\n \n In data binding, you declare the relationship between an HTML widget and a data source\n@@ -301,7 +301,7 @@ See [class decorator](#class-decorator), [class field decorator](#class-field-de\n A design pattern and mechanism for creating and delivering some parts of an application (dependencies) to other parts of an application that require them.\n \n In Angular, dependencies are typically services, but they also can be values, such as strings or functions.\n-An [injector](#injector) for an app (created automatically during bootstrap) instantiates dependencies when needed, using a configured [provider](#provider) of the service or value.\n+An [injector](#injector) for an application (created automatically during bootstrap) instantiates dependencies when needed, using a configured [provider](#provider) of the service or value.\n \n Learn more in [Dependency Injection in Angular](guide/dependency-injection).\n \n@@ -338,7 +338,7 @@ There are three categories of directive:\n \n Angular supplies a number of built-in directives that begin with the `ng` prefix.\n You can also create new directives to implement your own functionality.\n-You associate a *selector* (an HTML tag such as `<my-directive>`) with a custom directive, thereby extending the [template syntax](guide/template-syntax) that you can use in your apps.\n+You associate a *selector* (an HTML tag such as `<my-directive>`) with a custom directive; this extends the [template syntax](guide/template-syntax) that you can use in your applications.\n \n **UpperCamelCase**, such as `NgIf`, refers to a directive class.\n You can use **UpperCamelCase** when describing properties and directive behavior.\n@@ -351,7 +351,7 @@ You can use **lowerCamelCase** when describing how to apply the directive to an\n ## domain-specific language (DSL)\n \n A special-purpose library or API; see [Domain-specific language](https://en.wikipedia.org/wiki/Domain-specific_language).\n-Angular extends TypeScript with domain-specific languages for a number of domains relevant to Angular apps, defined in NgModules such as [animations](guide/animations), [forms](guide/forms), and [routing and navigation](guide/router).\n+Angular extends TypeScript with domain-specific languages for a number of domains relevant to Angular applications, defined in NgModules such as [animations](guide/animations), [forms](guide/forms), and [routing and navigation](guide/router).\n \n {@a dynamic-components}\n \n@@ -547,15 +547,15 @@ A process that speeds up application load time by splitting the application into\n For example, dependencies can be lazy loaded as needed&mdash;as opposed to [eager-loaded](#eager-loading) modules that are required by the root module and are thus loaded on launch.\n \n The [router](#router) makes use of lazy loading to load child views only when the parent view is activated.\n-Similarly, you can build custom elements that can be loaded into an Angular app when needed.\n+Similarly, you can build custom elements that can be loaded into an Angular application when needed.\n \n {@a library}\n \n ## library\n \n-In Angular, a [project](#project) that provides functionality that can be included in other Angular apps.\n-A library isn't a complete Angular app and can't run independently.\n-(To add re-usable Angular functionality to non-Angular web apps, you can use Angular [custom elements](#angular-element).)\n+In Angular, a [project](#project) that provides functionality that can be included in other Angular applications.\n+A library isn't a complete Angular application and can't run independently.\n+(To add re-usable Angular functionality to non-Angular web applications, you can use Angular [custom elements](#angular-element).)\n \n * Library developers can use the [Angular CLI](#cli) to `generate` scaffolding for a new library in an existing [workspace](#workspace), and can publish a library as an `npm` package.\n \n@@ -607,7 +607,7 @@ Compare to [NgModule](#ngmodule).\n ## ngcc\n \n Angular compatibility compiler.\n-If you build your app using [Ivy](#ivy), but it depends on libraries that have not been compiled with Ivy, the CLI uses `ngcc` to automatically update the dependent libraries to use Ivy.\n+If you build your application using [Ivy](#ivy), but it depends on libraries that have not been compiled with Ivy, the CLI uses `ngcc` to automatically update the dependent libraries to use Ivy.\n \n \n {@a ngmodule}\n@@ -723,7 +723,7 @@ An [injector](#injector) uses the provider to create a new instance of a depende\n for a class that requires it.\n \n Angular registers its own providers with every injector, for services that Angular defines.\n-You can register your own providers for services that your app needs.\n+You can register your own providers for services that your application needs.\n \n See also [service](#service), [dependency injection](#di).\n \n@@ -776,11 +776,11 @@ Learn more in the [Routing and Navigation](guide/router#preventing-unauthorized-\n \n ## router\n \n-A tool that configures and implements navigation among states and [views](#view) within an Angular app.\n+A tool that configures and implements navigation among states and [views](#view) within an Angular application.\n \n The `Router` module is an [NgModule](#ngmodule) that provides the necessary service providers and directives for navigating through application views. A [routing component](#routing-component) is one that imports the `Router` module and whose template contains a `RouterOutlet` element where it can display views produced by the router.\n \n-The router defines navigation among views on a single page, as opposed to navigation among pages. It interprets URL-like links to determine which views to create or destroy, and which components to load or unload. It allows you to take advantage of [lazy loading](#lazy-load) in your Angular apps.\n+The router defines navigation among views on a single page, as opposed to navigation among pages. It interprets URL-like links to determine which views to create or destroy, and which components to load or unload. It allows you to take advantage of [lazy loading](#lazy-load) in your Angular applications.\n \n To learn more, see [Routing and Navigation](guide/router).\n \n@@ -815,7 +815,7 @@ A schematic defines [rules](#rule) that operate on a virtual file system called\n \n The [Angular CLI](#cli) uses schematics to generate and modify [Angular projects](#project) and parts of projects.\n \n-* Angular provides a set of schematics for use with the CLI. See the [Angular CLI command reference](cli). The [`ng add`](cli/add) command runs schematics as part of adding a library to your project. The [`ng generate`](cli/generate) command runs schematics to create apps, libraries, and Angular code constructs.\n+* Angular provides a set of schematics for use with the CLI. See the [Angular CLI command reference](cli). The [`ng add`](cli/add) command runs schematics as part of adding a library to your project. The [`ng generate`](cli/generate) command runs schematics to create applications, libraries, and Angular code constructs.\n \n * [Library](#library) developers can create schematics that enable the Angular CLI to add and update their published libraries, and to generate artifacts the library defines.\n Add these schematics to the npm package that you use to publish and share your library.\n@@ -855,10 +855,10 @@ Import a scoped package in the same way that you import a normal package.\n A technique that generates static application pages on the server, and can generate and serve those pages in response to requests from browsers.\n It can also pre-generate pages as HTML files that you serve later.\n \n-This technique can improve performance on mobile and low-powered devices and improve the user experience by showing a static first page quickly while the client-side app is loading.\n-The static version can also make your app more visible to web crawlers.\n+This technique can improve performance on mobile and low-powered devices and improve the user experience by showing a static first page quickly while the client-side application is loading.\n+The static version can also make your application more visible to web crawlers.\n \n-You can easily prepare an app for server-side rendering by using the [CLI](#cli) to run the [Angular Universal](#universal) tool, using the `@nguniversal/express-engine` [schematic](#schematic).\n+You can easily prepare an application for server-side rendering by using the [CLI](#cli) to run the [Angular Universal](#universal) tool, using the `@nguniversal/express-engine` [schematic](#schematic).\n \n \n {@a service}\n@@ -1032,7 +1032,7 @@ A data flow model where the component tree is always checked for changes in one\n In practice, this means that data in Angular flows downward during change detection.\n A parent component can easily change values in its child components because the parent is checked first.\n A failure could occur, however, if a child component tries to change a value in its parent during change detection (inverting the expected data flow), because the parent component has already been rendered.\n-In development mode, Angular throws the `ExpressionChangedAfterItHasBeenCheckedError` error if your app attempts to do this, rather than silently failing to render the new value.\n+In development mode, Angular throws the `ExpressionChangedAfterItHasBeenCheckedError` error if your application attempts to do this, rather than silently failing to render the new value.\n \n To avoid this error, a [lifecycle hook](guide/lifecycle-hooks) method that seeks to make such a change should trigger a new change detection run. The new run follows the same direction as before, but succeeds in picking up the new value.\n \n@@ -1097,7 +1097,7 @@ A collection of Angular [projects](#project) (that is, applications and librarie\n The [CLI](#cli) [`ng new` command](cli/new) creates a file system directory (the \"workspace root\").\n In the workspace root, it also creates the workspace [configuration file](#configuration) (`angular.json`) and, by default, an initial application project with the same name.\n \n-Commands that create or operate on apps and libraries (such as `add` and `generate`) must be executed from within a workspace folder.\n+Commands that create or operate on applications and libraries (such as `add` and `generate`) must be executed from within a workspace folder.\n \n For more information, see [Workspace Configuration](guide/workspace-config).\n \n@@ -1126,9 +1126,9 @@ For more information, see [Workspace and Project File Structure](guide/file-stru\n \n ## zone\n \n-An execution context for a set of asynchronous tasks. Useful for debugging, profiling, and testing apps that include asynchronous operations such as event processing, promises, and calls to remote servers.\n+An execution context for a set of asynchronous tasks. Useful for debugging, profiling, and testing applications that include asynchronous operations such as event processing, promises, and calls to remote servers.\n \n-An Angular app runs in a zone where it can respond to asynchronous events by checking for data changes and updating the information it displays by resolving [data bindings](#data-binding).\n+An Angular application runs in a zone where it can respond to asynchronous events by checking for data changes and updating the information it displays by resolving [data bindings](#data-binding).\n \n A zone client can take action before and after an async operation completes.\n "
        },
        {
            "sha": "36f08420f4883adbb7d64b602256d66c2c395358",
            "filename": "aio/content/guide/styleguide.md",
            "status": "modified",
            "additions": 23,
            "deletions": 23,
            "changes": 46,
            "blob_url": "https://github.com/angular/angular/blob/0777faccfb4804578568bb2b794a13e209c158e1/aio%2Fcontent%2Fguide%2Fstyleguide.md",
            "raw_url": "https://github.com/angular/angular/raw/0777faccfb4804578568bb2b794a13e209c158e1/aio%2Fcontent%2Fguide%2Fstyleguide.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fstyleguide.md?ref=0777faccfb4804578568bb2b794a13e209c158e1",
            "patch": "@@ -24,7 +24,7 @@ On the other hand, you need a really unusual case for breaking a *Do* guideline.\n <div class=\"s-rule consider\">\n \n **Consider** guidelines should generally be followed.\n-If you fully understand the meaning behind the guideline and have a good reason to deviate, then do so. Please strive to be consistent.\n+If you fully understand the meaning behind the guideline and have a good reason to deviate, then do so. Aim to be consistent.\n \n </div>\n \n@@ -55,7 +55,7 @@ The guideline uses the shortcut `hero.component.ts|html|css|spec` to represent t\n Apply the\n <a href=\"https://wikipedia.org/wiki/Single_responsibility_principle\"><i>single responsibility principle</i> (SRP)</a>\n to all components, services, and other symbols.\n-This helps make the app cleaner, easier to read and maintain, and more testable.\n+This helps make the application cleaner, easier to read and maintain, and more testable.\n \n {@a 01-01}\n \n@@ -167,7 +167,7 @@ supporting classes into their own, dedicated files.\n \n \n \n-As the app grows, this rule becomes even more important.\n+As the application grows, this rule becomes even more important.\n <a href=\"#toc\">Back to top</a>\n \n \n@@ -306,7 +306,7 @@ Naming conventions are hugely important to maintainability and readability. This\n \n \n \n-**Why?** The naming conventions should simply help find desired code faster and make it easier to understand.\n+**Why?** The naming conventions should help find desired code faster and make it easier to understand.\n \n \n </div>\n@@ -840,7 +840,7 @@ As always, strive for consistency.\n \n <div class=\"s-rule do\">\n \n-**Do** put bootstrapping and platform logic for the app in a file named `main.ts`.\n+**Do** put bootstrapping and platform logic for the application in a file named `main.ts`.\n \n </div>\n \n@@ -852,7 +852,7 @@ As always, strive for consistency.\n \n <div class=\"s-rule avoid\">\n \n-**Avoid** putting app logic in `main.ts`. Instead, consider placing it in a component or service.\n+**Avoid** putting application logic in `main.ts`. Instead, consider placing it in a component or service.\n \n </div>\n \n@@ -933,19 +933,19 @@ For example, the prefix `toh` represents **T**our **o**f **H**eroes and the pref\n \n <div class=\"s-rule do\">\n \n-**Do** use a prefix that identifies the feature area or the app itself.\n+**Do** use a prefix that identifies the feature area or the application itself.\n \n </div>\n \n <div class=\"s-why\">\n \n-**Why?** Prevents element name collisions with components in other apps and with native HTML elements.\n+**Why?** Prevents element name collisions with components in other applications and with native HTML elements.\n \n </div>\n \n <div class=\"s-why\">\n \n-**Why?** Makes it easier to promote and share the component in other apps.\n+**Why?** Makes it easier to promote and share the component in other applications.\n \n </div>\n \n@@ -1636,9 +1636,9 @@ A consistent class and file name convention make these modules easy to spot and\n \n ## Application structure and NgModules\n \n-Have a near-term view of implementation and a long-term vision. Start small but keep in mind where the app is heading down the road.\n+Have a near-term view of implementation and a long-term vision. Start small but keep in mind where the application is heading.\n \n-All of the app's code goes in a folder named `src`.\n+All of the application's code goes in a folder named `src`.\n All feature areas are in their own folder, with their own NgModule.\n \n All content is one asset per file. Each component, service, and pipe is in its own file.\n@@ -1658,7 +1658,7 @@ Use the naming conventions for files in this guide.\n \n \n \n-**Do** structure the app such that you can **L**ocate code quickly,\n+**Do** structure the application such that you can **L**ocate code quickly,\n **I**dentify the code at a glance,\n keep the **F**lattest structure you can, and\n **T**ry to be DRY.\n@@ -1703,7 +1703,7 @@ _can I quickly open and start work in all of the related files for this feature_\n \n \n \n-**Do** make locating code intuitive, simple, and fast.\n+**Do** make locating code intuitive and fast.\n \n \n </div>\n@@ -1904,7 +1904,7 @@ But if something is not obvious or departs from a convention, then spell it out.\n \n \n \n-**Do** start small but keep in mind where the app is heading down the road.\n+**Do** start small but keep in mind where the application is heading down the road.\n \n \n </div>\n@@ -1926,7 +1926,7 @@ But if something is not obvious or departs from a convention, then spell it out.\n \n \n \n-**Do** put all of the app's code in a folder named `src`.\n+**Do** put all of the application's code in a folder named `src`.\n \n \n </div>\n@@ -1948,7 +1948,7 @@ But if something is not obvious or departs from a convention, then spell it out.\n \n \n \n-**Why?** Helps keep the app structure small and easy to maintain in the early stages, while being easy to evolve as the app grows.\n+**Why?** Helps keep the application structure small and easy to maintain in the early stages, while being easy to evolve as the application grows.\n \n \n </div>\n@@ -1959,7 +1959,7 @@ But if something is not obvious or departs from a convention, then spell it out.\n \n \n \n-**Why?** Components often have four files (e.g. `*.html`, `*.css`, `*.ts`, and `*.spec.ts`) and can clutter a folder quickly.\n+**Why?** Components often have four files (for example, `*.html`, `*.css`, `*.ts`, and `*.spec.ts`) and can clutter a folder quickly.\n \n \n </div>\n@@ -2201,7 +2201,7 @@ Here is a compliant folder and file structure:\n \n \n While components in dedicated folders are widely preferred,\n-another option for small apps is to keep components flat (not in a dedicated folder).\n+another option for small applications is to keep components flat (not in a dedicated folder).\n This adds up to four files to the existing folder, but also reduces the folder nesting.\n Whatever you choose, be consistent.\n \n@@ -2238,7 +2238,7 @@ at a glance. The structure is as flat as it can be and there are no repetitive o\n \n <div class=\"s-why\">\n \n-**Why?** Helps reduce the app from becoming cluttered through organizing the\n+**Why?** Helps reduce the application from becoming cluttered through organizing the\n content and keeping them aligned with the LIFT guidelines.\n \n </div>\n@@ -2290,7 +2290,7 @@ and more difficult in a flat structure.\n \n \n \n-**Do** create an NgModule in the app's root folder,\n+**Do** create an NgModule in the application's root folder,\n for example, in `/src/app`.\n \n \n@@ -2302,7 +2302,7 @@ for example, in `/src/app`.\n \n \n \n-**Why?** Every app requires at least one root NgModule.\n+**Why?** Every application requires at least one root NgModule.\n \n \n </div>\n@@ -3195,7 +3195,7 @@ helps instantly identify which members of the component serve which purpose.\n \n \n \n-**Why?** Logic may be reused by multiple components when placed within a service and exposed via a function.\n+**Why?** Logic may be reused by multiple components when placed within a service and exposed as a function.\n \n \n </div>\n@@ -3651,7 +3651,7 @@ Compare with the less preferred `host` metadata alternative.\n \n \n \n-**Do** provide a service with the app root injector in the `@Injectable` decorator of the service.\n+**Do** provide a service with the application root injector in the `@Injectable` decorator of the service.\n \n \n </div>"
        }
    ],
    "stats": {
        "total": 118,
        "additions": 59,
        "deletions": 59
    }
}