{
    "author": "TeriGlover",
    "message": "docs: minor update to what is Angular topic (#41123)\n\nPR Close #41123",
    "sha": "0f0f34fb8a1ba178d55a97f3a01c8500ae16deb4",
    "files": [
        {
            "sha": "2bf52a0a03637d75da8df8b2d99af31a6bb1f8d4",
            "filename": "aio/content/guide/what-is-angular.md",
            "status": "modified",
            "additions": 2,
            "deletions": 2,
            "changes": 4,
            "blob_url": "https://github.com/angular/angular/blob/0f0f34fb8a1ba178d55a97f3a01c8500ae16deb4/aio%2Fcontent%2Fguide%2Fwhat-is-angular.md",
            "raw_url": "https://github.com/angular/angular/raw/0f0f34fb8a1ba178d55a97f3a01c8500ae16deb4/aio%2Fcontent%2Fguide%2Fwhat-is-angular.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fwhat-is-angular.md?ref=0f0f34fb8a1ba178d55a97f3a01c8500ae16deb4",
            "patch": "@@ -8,7 +8,7 @@ Angular is a development platform, built on [TypeScript](https://www.typescriptl\n * A collection of well-integrated libraries that cover a wide variety of features, including routing, forms management, client-server communication, and more\n * A suite of developer tools to help you develop, build, test, and update your code\n \n-When you build applications with Angular, you're taking advantage of a platform that can scale from single-developer projects to enterprise-level applications. Angular is designed to make updating as easy as possible, so you can take advantage of the latest developments with a minimum of effort. Best of all, the Angular ecosystem consists of a diverse group of over 1.7 million developers, library authors, and content creators.\n+With Angular, you're taking advantage of a platform that can scale from single-developer projects to enterprise-level applications. Angular is designed to make updating as easy as possible, so you can take advantage of the latest developments with a minimum of effort. Best of all, the Angular ecosystem consists of a diverse group of over 1.7 million developers, library authors, and content creators.\n \n <div class=\"alert is-helpful\">\n \n@@ -208,4 +208,4 @@ To see Angular in action, see our [Getting Started](https://angular.io/start) tu\n \n To explore Angular's capabilities further, we recommend reading through the sections, Understanding Angular and Developer Guides.\n \n-@reviewed 2021-03-02\n+@reviewed 2021-03-08"
        }
    ],
    "stats": {
        "total": 4,
        "additions": 2,
        "deletions": 2
    }
}