{
    "author": "TeriGlover",
    "message": "docs: Edits to remove jargon (#42026)\n\nPR Close #42026",
    "sha": "1710fa861c693f0370cd5fe72e0c2341a7f2b00f",
    "files": [
        {
            "sha": "3b3c157d65b70623caf35de12dc9abcab03c9c6a",
            "filename": "aio/content/guide/creating-libraries.md",
            "status": "modified",
            "additions": 15,
            "deletions": 16,
            "changes": 31,
            "blob_url": "https://github.com/angular/angular/blob/1710fa861c693f0370cd5fe72e0c2341a7f2b00f/aio%2Fcontent%2Fguide%2Fcreating-libraries.md",
            "raw_url": "https://github.com/angular/angular/raw/1710fa861c693f0370cd5fe72e0c2341a7f2b00f/aio%2Fcontent%2Fguide%2Fcreating-libraries.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fcreating-libraries.md?ref=1710fa861c693f0370cd5fe72e0c2341a7f2b00f",
            "patch": "@@ -2,8 +2,8 @@\n \n This page provides a conceptual overview of how you can create and publish new libraries to extend Angular functionality.\n \n-If you find that you need to solve the same problem in more than one app (or want to share your solution with other developers), you have a candidate for a library.\n-A simple example might be a button that sends users to your company website, that would be included in all apps that your company builds.\n+If you find that you need to solve the same problem in more than one application (or want to share your solution with other developers), you have a candidate for a library.\n+A simple example might be a button that sends users to your company website, that would be included in all applications that your company builds.\n \n ## Getting started\n \n@@ -50,7 +50,7 @@ You can build, test, and lint the project with CLI commands:\n  ng lint my-lib\n </code-example>\n \n-Notice that the configured builder for the project is different from the default builder for app projects.\n+Notice that the configured builder for the project is different from the default builder for application projects.\n This builder, among other things, ensures that the library is always built with the [AOT compiler](guide/aot-compiler).\n \n To make library code reusable you must define a public API for it. This \"user layer\" defines what is available to consumers of your library. A user of your library should be able to access public functionality (such as NgModules, service providers and general utility functions) through a single import path.\n@@ -89,7 +89,7 @@ Here are some things to consider in migrating application functionality to a lib\n \n ## Integrating with the CLI using code-generation schematics\n \n-A library typically includes *reusable code* that defines components, services, and other Angular artifacts (pipes, directives, and so on) that you simply import into a project.\n+A library typically includes *reusable code* that defines components, services, and other Angular artifacts (pipes, directives) that you import into a project.\n A library is packaged into an npm package for publishing and sharing.\n This package can also include [schematics](guide/glossary#schematic) that provide instructions for generating or transforming code directly in your project, in the same way that the CLI creates a generic new component with `ng generate component`.\n A schematic that is packaged with a library can, for example, provide the Angular CLI with the information it needs to generate a component that configures and uses a particular feature, or set of features, defined in that library.\n@@ -99,13 +99,13 @@ You can create and include the following kinds of schematics:\n \n * Include an installation schematic so that `ng add` can add your library to a project.\n \n-* Include generation schematics in your library so that `ng generate` can scaffold your defined artifacts (components, services, tests, and so on) in a project.\n+* Include generation schematics in your library so that `ng generate` can scaffold your defined artifacts (components, services, tests) in a project.\n \n * Include an update schematic so that `ng update` can update your library’s dependencies and provide migrations for breaking changes in new releases.\n \n What you include in your library depends on your task.\n-For example, you could define a schematic to create a dropdown that is pre-populated with canned data to show how to add it to an app.\n-If you want a dropdown that would contain different passed-in values each time, your library could define a schematic to create it with a given configuration. Developers could then use `ng generate` to configure an instance for their own app.\n+For example, you could define a schematic to create a dropdown that is pre-populated with canned data to show how to add it to an application.\n+If you want a dropdown that would contain different passed-in values each time, your library could define a schematic to create it with a given configuration. Developers could then use `ng generate` to configure an instance for their own application.\n \n Suppose you want to read a configuration file and then generate a form based on that configuration.\n If that form will need additional customization by the developer who is using your library, it might work best as a schematic.\n@@ -135,7 +135,6 @@ npm publish\n </code-example>\n \n \n-\n {@a lib-assets}\n \n ## Managing assets in a library\n@@ -166,7 +165,7 @@ A linked library will then have its own set of Angular libraries that it uses fo\n However, this can cause problems while building or running your application.\n \n To get around this problem you can use TypeScript path mapping to tell TypeScript that it should load some modules from a specific location.\n-List all the peer dependencies that your library uses in the workspace TypeScript configuration file `./tsconfig.json`, and point them at the local copy in the app's `node_modules` folder.\n+List all the peer dependencies that your library uses in the workspace TypeScript configuration file `./tsconfig.json`, and point them at the local copy in the application's `node_modules` folder.\n \n ```\n {\n@@ -187,7 +186,7 @@ This mapping ensures that your library always loads the local copies of the modu\n \n ## Using your own library in apps\n \n-You don't have to publish your library to the npm package manager in order to use it in your own apps, but you do have to build it first.\n+You don't have to publish your library to the npm package manager in order to use it in your own applications, but you do have to build it first.\n \n To use your own library in an app:\n \n@@ -196,14 +195,14 @@ To use your own library in an app:\n  ng build my-lib\n  </code-example>\n \n-* In your apps, import from the library by name:\n+* In your applications, import from the library by name:\n  ```\n  import { myExport } from 'my-lib';\n  ```\n \n ### Building and rebuilding your library\n \n-The build step is important if you haven't published your library as an npm package and then installed the package back into your app from npm.\n+The build step is important if you haven't published your library as an npm package and then installed the package back into your application from npm.\n For instance, if you clone your git repository and run `npm install`, your editor will show the `my-lib` imports as missing if you haven't yet built your library.\n \n <div class=\"alert is-helpful\">\n@@ -216,13 +215,13 @@ The Angular CLI uses the `tsconfig` paths to tell the build system where to find\n \n </div>\n \n-If you find that changes to your library are not reflected in your app, your app is probably using an old build of the library.\n+If you find that changes to your library are not reflected in your application, your app is probably using an old build of the library.\n \n You can rebuild your library whenever you make changes to it, but this extra step takes time.\n *Incremental builds* functionality improves the library-development experience.\n Every time a file is changed a partial build is performed that emits the amended files.\n \n-Incremental builds can be run as a background process in your dev environment. To take advantage of this feature add the `--watch` flag to the build command:\n+Incremental builds can be run as a background process in your development environment. To take advantage of this feature add the `--watch` flag to the build command:\n \n <code-example language=\"bash\">\n ng build my-lib --watch\n@@ -232,13 +231,13 @@ ng build my-lib --watch\n \n The CLI `build` command uses a different builder and invokes a different build tool for libraries than it does for applications.\n \n-* The build system for apps, `@angular-devkit/build-angular`, is based on `webpack`, and is included in all new Angular CLI projects.\n+* The build system for applications, `@angular-devkit/build-angular`, is based on `webpack`, and is included in all new Angular CLI projects.\n * The build system for libraries is based on `ng-packagr`. It is only added to your dependencies when you add a library using `ng generate library my-lib`.\n \n The two build systems support different things, and even where they support the same things, they do those things differently.\n This means that the TypeScript source can result in different JavaScript code in a built library than it would in a built application.\n \n-For this reason, an app that depends on a library should only use TypeScript path mappings that point to the *built library*.\n+For this reason, an application that depends on a library should only use TypeScript path mappings that point to the *built library*.\n TypeScript path mappings should *not* point to the library source `.ts` files.\n \n </div>"
        },
        {
            "sha": "4da2ceb83cd2779d63a3cf5cf98ba27a206ab3c3",
            "filename": "aio/content/guide/forms.md",
            "status": "modified",
            "additions": 5,
            "deletions": 5,
            "changes": 10,
            "blob_url": "https://github.com/angular/angular/blob/1710fa861c693f0370cd5fe72e0c2341a7f2b00f/aio%2Fcontent%2Fguide%2Fforms.md",
            "raw_url": "https://github.com/angular/angular/raw/1710fa861c693f0370cd5fe72e0c2341a7f2b00f/aio%2Fcontent%2Fguide%2Fforms.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fforms.md?ref=1710fa861c693f0370cd5fe72e0c2341a7f2b00f",
            "patch": "@@ -72,7 +72,7 @@ Every hero needs a job. This form helps the agency match the right hero with the\n The form highlights some design features that make it easier to use. For instance, the two required fields have a green bar on the left to make them easy to spot. These fields have initial values, so the form is valid and the **Submit** button is enabled.\n \n As you work with this form, you will learn how to include validation logic, how to customize the presentation with standard CSS, and how to handle error conditions to ensure valid input.\n-If the user deletes the hero name, for example, the form becomes invalid. The app detects the changed status, and displays a validation error in an attention-grabbing style.\n+If the user deletes the hero name, for example, the form becomes invalid. The application detects the changed status, and displays a validation error in an attention-grabbing style.\n In addition, the **Submit** button is disabled, and the \"required\" bar to the left of the input control changes from green to red.\n \n <div class=\"lightbox\">\n@@ -138,7 +138,7 @@ template using the `<app-hero-form>` tag.\n    At this point, the form  layout is all plain HTML5, with no bindings or directives.\n \n 6. The sample form uses some style classes from [Twitter Bootstrap](https://getbootstrap.com/css/): `container`, `form-group`, `form-control`, and `btn`.\n-   To use these styles, the app's style sheet imports the library.\n+   To use these styles, the application's style sheet imports the library.\n \n    <code-example path=\"forms/src/styles.1.css\" header=\"src/styles.css\"></code-example>\n \n@@ -148,7 +148,7 @@ template using the `<app-hero-form>` tag.\n \n    <code-example path=\"forms/src/app/hero-form/hero-form.component.html\" header=\"src/app/hero-form/hero-form.component.html (powers)\" region=\"powers\"></code-example>\n \n-If you run the app right now, you see the list of powers in the selection control. The input elements are not yet bound to data values or events, so they are still blank and have no behavior.\n+If you run the application right now, you see the list of powers in the selection control. The input elements are not yet bound to data values or events, so they are still blank and have no behavior.\n \n <div class=\"lightbox\">\n   <img src=\"generated/images/guide/forms/hero-form-3.png\" alt=\"Early form with no binding\">\n@@ -230,7 +230,7 @@ After these revisions, the form template should look like the following:\n \n * Each `<input>` element also has the required `name` property that Angular uses to register the control with the form.\n \n-If you run the app now and change every hero model property, the form might display like this:\n+If you run the application now and change every hero model property, the form might display like this:\n \n <div class=\"lightbox\">\n   <img src=\"generated/images/guide/forms/ng-model-in-action-2.png\" alt=\"ngModel in action\">\n@@ -433,7 +433,7 @@ To let form users add a new hero, you will add a **New Hero** button that respon\n \n 5. Enter a name and click **New Hero** again.\n \n-   Now the app displays a _Name is required_ error message, because the input box is no longer pristine.\n+   Now the application displays a _Name is required_ error message, because the input box is no longer pristine.\n    The form remembers that you entered a name before clicking **New Hero**.\n \n 6. To restore the pristine state of the form controls, clear all of the flags imperatively by calling the form's `reset()` method after calling the `newHero()` method."
        },
        {
            "sha": "3bdd857f0b02183158ffc20f82fc2b6d1132482c",
            "filename": "aio/content/guide/libraries.md",
            "status": "modified",
            "additions": 8,
            "deletions": 8,
            "changes": 16,
            "blob_url": "https://github.com/angular/angular/blob/1710fa861c693f0370cd5fe72e0c2341a7f2b00f/aio%2Fcontent%2Fguide%2Flibraries.md",
            "raw_url": "https://github.com/angular/angular/raw/1710fa861c693f0370cd5fe72e0c2341a7f2b00f/aio%2Fcontent%2Fguide%2Flibraries.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Flibraries.md?ref=1710fa861c693f0370cd5fe72e0c2341a7f2b00f",
            "patch": "@@ -1,17 +1,17 @@\n # Overview of Angular libraries\n \n Many applications need to solve the same general problems, such as presenting a unified user interface, presenting data, and allowing data entry.\n-Developers can create general solutions for particular domains that can be adapted for re-use in different apps.\n+Developers can create general solutions for particular domains that can be adapted for re-use in different applications.\n Such a solution can be built as Angular *libraries* and these libraries can be published and shared as *npm packages*.\n \n-An Angular library is an Angular [project](guide/glossary#project) that differs from an app in that it cannot run on its own.\n-A library must be imported and used in an app.\n+An Angular library is an Angular [project](guide/glossary#project) that differs from an application in that it cannot run on its own.\n+A library must be imported and used in an application.\n \n Libraries extend Angular's base functionality. For example, to add [reactive forms](guide/reactive-forms) to an app, add the library package using `ng add @angular/forms`, then import the `ReactiveFormsModule` from the `@angular/forms` library in your application code.\n Similarly, adding the [service worker](guide/service-worker-intro) library to an Angular application is one of the steps for turning an application into a [Progressive Web App](https://developers.google.com/web/progressive-web-apps/) (PWA).\n [Angular Material](https://material.angular.io/) is an example of a large, general-purpose library that provides sophisticated, reusable, and adaptable UI components.\n \n-Any app developer can use these and other libraries that have been published as npm packages by the Angular team or by third parties. See [Using Published Libraries](guide/using-libraries).\n+Any application developer can use these and other libraries that have been published as npm packages by the Angular team or by third parties. See [Using Published Libraries](guide/using-libraries).\n \n ## Creating libraries\n \n@@ -25,13 +25,13 @@ Whether you decide to package functionality as a library is an architectural dec\n Packaging functionality as a library forces the artifacts in the library to be decoupled from the application's business logic.\n This can help to avoid various bad practices or architecture mistakes that can make it difficult to decouple and reuse code in the future.\n \n-Putting code into a separate library is more complex than simply putting everything in one app.\n+Putting code into a separate library is more complex than simply putting everything in one application.\n It requires more of an investment in time and thought for managing, maintaining, and updating the library.\n-This complexity can pay off, however, when the library is being used in multiple apps.\n+This complexity can pay off, however, when the library is being used in multiple applications.\n \n <div class=\"alert is-helpful\">\n \n-Note that libraries are intended to be used by Angular apps.\n-To add Angular functionality to non-Angular web apps, you can use [Angular custom elements](guide/elements).\n+Note that libraries are intended to be used by Angular applications.\n+To add Angular functionality to non-Angular web applications, you can use [Angular custom elements](guide/elements).\n \n </div>"
        },
        {
            "sha": "a540951d29701036fb73438d6d1e743622192718",
            "filename": "aio/content/guide/router-tutorial-toh.md",
            "status": "modified",
            "additions": 40,
            "deletions": 41,
            "changes": 81,
            "blob_url": "https://github.com/angular/angular/blob/1710fa861c693f0370cd5fe72e0c2341a7f2b00f/aio%2Fcontent%2Fguide%2Frouter-tutorial-toh.md",
            "raw_url": "https://github.com/angular/angular/raw/1710fa861c693f0370cd5fe72e0c2341a7f2b00f/aio%2Fcontent%2Fguide%2Frouter-tutorial-toh.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Frouter-tutorial-toh.md?ref=1710fa861c693f0370cd5fe72e0c2341a7f2b00f",
            "patch": "@@ -25,7 +25,7 @@ Along the way, it highlights key features of the router such as:\n * Lazy loading an `NgModule`.\n * The `CanLoad` guard (check before loading feature module assets).\n \n-This guide proceeds as a sequence of milestones as if you were building the app step-by-step, but assumes you are familiar with basic [Angular concepts](guide/architecture).\n+This guide proceeds as a sequence of milestones as if you were building the application step-by-step, but assumes you are familiar with basic [Angular concepts](guide/architecture).\n For a general introduction to angular, see the [Getting Started](start). For a more in-depth overview, see the [Tour of Heroes](tutorial) tutorial.\n \n ## Prerequisites\n@@ -52,7 +52,7 @@ The application has three main feature areas:\n \n Try it by clicking on this <live-example name=\"router\" title=\"Hero Employment Agency Live Example\">live example link</live-example>.\n \n-The app renders with a row of navigation buttons and the *Heroes* view with its list of heroes.\n+The application renders with a row of navigation buttons and the *Heroes* view with its list of heroes.\n \n \n <div class=\"lightbox\">\n@@ -61,7 +61,7 @@ The app renders with a row of navigation buttons and the *Heroes* view with its\n \n \n \n-Select one hero and the app takes you to a hero editing screen.\n+Select one hero and the application takes you to a hero editing screen.\n \n <div class=\"lightbox\">\n   <img src='generated/images/guide/router/hero-detail.png' alt=\"Crisis Center Detail\">\n@@ -70,11 +70,11 @@ Select one hero and the app takes you to a hero editing screen.\n \n \n Alter the name.\n-Click the \"Back\" button and the app returns to the heroes list which displays the changed hero name.\n+Click the \"Back\" button and the application returns to the heroes list which displays the changed hero name.\n Notice that the name change took effect immediately.\n \n-Had you clicked the browser's back button instead of the app's \"Back\" button, the app would have returned you to the heroes list as well.\n-Angular app navigation updates the browser history as normal web navigation does.\n+Had you clicked the browser's back button instead of the application's \"Back\" button, the app would have returned you to the heroes list as well.\n+Angular application navigation updates the browser history as normal web navigation does.\n \n Now click the *Crisis Center* link for a list of ongoing crises.\n \n@@ -119,7 +119,7 @@ The `Admin` and `Login` buttons illustrate other router capabilities covered lat\n \n ## Milestone 1: Getting started\n \n-Begin with a basic version of the app that navigates between two empty views.\n+Begin with a basic version of the application that navigates between two empty views.\n \n \n <div class=\"lightbox\">\n@@ -221,7 +221,7 @@ The corresponding component template looks like this:\n \n ### Define a Wildcard route\n \n-You've created two routes in the app so far, one to `/crisis-center` and the other to `/heroes`.\n+You've created two routes in the application so far, one to `/crisis-center` and the other to `/heroes`.\n Any other URL causes the router to throw an error and crash the app.\n \n Add a wildcard route to intercept invalid URLs and handle them gracefully.\n@@ -272,8 +272,8 @@ When the application launches, the initial URL in the browser bar is by default:\n That doesn't match any of the hard-coded routes which means the router falls through to the wildcard route and displays the `PageNotFoundComponent`.\n \n The application needs a default route to a valid page.\n-The default page for this app is the list of heroes.\n-The app should navigate there as if the user clicked the \"Heroes\" link or pasted `localhost:4200/heroes` into the address bar.\n+The default page for this application is the list of heroes.\n+The application should navigate there as if the user clicked the \"Heroes\" link or pasted `localhost:4200/heroes` into the address bar.\n \n Add a `redirect` route that translates the initial relative URL (`''`) to the desired default path (`/heroes`).\n \n@@ -298,7 +298,7 @@ In this app, the router should select the route to the `HeroListComponent` only\n   In this example, the redirect is in a top level route so the *remaining* URL and the  *entire* URL are the same thing.\n \n   The other possible `pathMatch` value is `'prefix'` which tells the router to match the  redirect route when the remaining URL begins with the redirect route's prefix  path.\n-  This doesn't apply to this sample app because if the `pathMatch` value were `'prefix'`,   every URL would match `''`.\n+  This doesn't apply to this sample application because if the `pathMatch` value were `'prefix'`,   every URL would match `''`.\n \n   Try setting it to `'prefix'` and clicking the `Go to sidekicks` button.\n   Since that's a bad URL, you should see the \"Page not found\" page.\n@@ -317,7 +317,7 @@ In this app, the router should select the route to the `HeroListComponent` only\n \n ### Milestone 1 wrap up\n \n-Your sample app can switch between two views when the user clicks a link.\n+Your sample application can switch between two views when the user clicks a link.\n \n Milestone 1 has covered how to do the following:\n \n@@ -327,9 +327,9 @@ Milestone 1 has covered how to do the following:\n * Configure the router module with `RouterModule.forRoot()`.\n * Set the router to compose HTML5 browser URLs.\n * Handle invalid routes with a `wildcard` route.\n-* Navigate to the default route when the app launches with an empty path.\n+* Navigate to the default route when the application launches with an empty path.\n \n-The starter app's structure looks like this:\n+The starter application's structure looks like this:\n \n <div class='filetree'>\n \n@@ -515,7 +515,7 @@ Here are the files in this milestone.\n \n ## Milestone 2: *Routing module*\n \n-This milestone shows you how to configure a special-purpose module called a *Routing Module*, which holds your app's routing configuration.\n+This milestone shows you how to configure a special-purpose module called a *Routing Module*, which holds your application's routing configuration.\n \n The Routing Module has several characteristics:\n \n@@ -530,7 +530,7 @@ The Routing Module has several characteristics:\n \n The sample routing application does not include routing by default.\n When you use the [Angular CLI](cli) to create a project that does use routing, set the `--routing` option for the project or app, and for each NgModule.\n-When you create or initialize a new project (using the CLI [`ng new`](cli/new) command) or a new app (using the [`ng generate app`](cli/generate) command), specify the `--routing` option.\n+When you create or initialize a new project (using the CLI [`ng new`](cli/new) command) or a new application (using the [`ng generate app`](cli/generate) command), specify the `--routing` option.\n This tells the CLI to include the `@angular/router` npm package and create a file named `app-routing.module.ts`.\n You can then use routing in any NgModule that you add to the project or app.\n \n@@ -554,8 +554,7 @@ Create an `AppRouting` module in the `/app` folder to contain the routing config\n   ng generate module app-routing --module app --flat\n </code-example>\n \n-Import the `CrisisListComponent`, `HeroListComponent`, and `PageNotFoundComponent` symbols\n-just like you did in the `app.module.ts`.\n+Import the `CrisisListComponent`, `HeroListComponent`, and `PageNotFoundComponent` symbols like you did in the `app.module.ts`.\n Then move the `Router` imports and routing configuration, including `RouterModule.forRoot()`, into this routing module.\n \n Re-export the Angular `RouterModule` by adding it to the module `exports` array.\n@@ -583,11 +582,11 @@ The application continues to work just the same, and you can use `AppRoutingModu\n \n The routing module, often called the `AppRoutingModule`, replaces the routing configuration in the root or feature module.\n \n-The routing module is helpful as your app grows and when the configuration includes specialized guard and resolver services.\n+The routing module is helpful as your application grows and when the configuration includes specialized guard and resolver services.\n \n Some developers skip the routing module when the configuration is minimal and merge the routing configuration directly into the companion module (for example, `AppModule`).\n \n-Most apps should implement a routing module for consistency.\n+Most applications should implement a routing module for consistency.\n It keeps the code clean when configuration becomes complex.\n It makes testing the feature module easier.\n Its existence calls attention to the fact that a module is routed.\n@@ -599,11 +598,11 @@ It is where developers expect to find and expand routing configuration.\n \n This milestone covers the following:\n \n-* Organizing the app and routes into feature areas using modules.\n+* Organizing the application and routes into feature areas using modules.\n * Navigating imperatively from one component to another.\n * Passing required and optional information in route parameters.\n \n-This sample app recreates the heroes feature in the \"Services\" section of the [Tour of Heroes tutorial](tutorial/toh-pt4 \"Tour of Heroes: Services\"), and reuses much of the code from the <live-example name=\"toh-pt4\" title=\"Tour of Heroes: Services example code\"></live-example>.\n+This sample application recreates the heroes feature in the \"Services\" section of the [Tour of Heroes tutorial](tutorial/toh-pt4 \"Tour of Heroes: Services\"), and reuses much of the code from the <live-example name=\"toh-pt4\" title=\"Tour of Heroes: Services example code\"></live-example>.\n \n <!-- KW - this gif isn't ideal for accessibility. Would like to remove it.-->\n <!-- Here's how the user will experience this version of the app:\n@@ -615,7 +614,7 @@ This sample app recreates the heroes feature in the \"Services\" section of the [T\n \n A typical application has multiple feature areas, each dedicated to a particular business purpose with its own folder.\n \n-This section shows you how refactor the app into different feature modules, import them into the main module and navigate among them.\n+This section shows you how refactor the application into different feature modules, import them into the main module and navigate among them.\n \n \n {@a heroes-functionality}\n@@ -747,7 +746,7 @@ You tell the detail view which hero to display by including the selected hero's\n \n Import the hero components from their new locations in the `src/app/heroes/` folder and define the two hero routes.\n \n-Now that you have routes for the `Heroes` module, register them with the `Router` via the `RouterModule` as you did in the `AppRoutingModule`, with an important difference.\n+Now that you have routes for the `Heroes` module, register them with the `Router` using the `RouterModule` as you did in the `AppRoutingModule`, with an important difference.\n \n In the `AppRoutingModule`, you used the static `RouterModule.forRoot()` method to register the routes and application level service providers.\n In a feature module you use the static `forChild()` method.\n@@ -770,7 +769,7 @@ The updated `HeroesRoutingModule` looks like this:\n <div class=\"alert is-helpful\">\n \n Consider giving each feature module its own route configuration file.\n-Though the feature routes are currently minimal, routes have a tendency to grow more complex even in small apps.\n+Though the feature routes are currently minimal, routes have a tendency to grow more complex even in small applications.\n \n </div>\n \n@@ -881,7 +880,7 @@ Accordingly, the _link parameters array_ has two items: the routing _path_ and a\n The router composes the destination URL from the array like this: `localhost:4200/hero/15`.\n \n The router extracts the route parameter (`id:15`) from the URL and supplies it to\n-the `HeroDetailComponent` via the `ActivatedRoute` service.\n+the `HeroDetailComponent` using the `ActivatedRoute` service.\n \n \n {@a activated-route-in-action}\n@@ -1031,7 +1030,7 @@ You can access the parameters directly without subscribing or adding observable\n \n `snapshot` only gets the initial value of the parameter map with this technique.\n Use the observable `paramMap` approach if there's a possibility that the router could re-use the component.\n-This tutorial sample app uses with the observable `paramMap`.\n+This tutorial sample application uses with the observable `paramMap`.\n \n </div>\n \n@@ -1247,7 +1246,7 @@ When switching between the two routes, the `HeroDetailComponent` and `HeroListCo\n \n This section has covered the following:\n \n-* Organizing the app into feature areas.\n+* Organizing the application into feature areas.\n * Navigating imperatively from one component to another.\n * Passing information along in route parameters and subscribe to them in the component.\n * Importing the feature area NgModule into the `AppModule`.\n@@ -1521,7 +1520,7 @@ Here are the relevant files for this version of the sample application.\n \n This section shows you how to add child routes and use relative routing in your app.\n \n-To add more features to the app's current crisis center, take similar steps as for the heroes feature:\n+To add more features to the application's current crisis center, take similar steps as for the heroes feature:\n \n * Create a `crisis-center` subfolder in the `src/app` folder.\n * Copy the files and folders from `app/heroes` into the new `crisis-center` folder.\n@@ -1553,7 +1552,7 @@ This section shows you how to organize the crisis center to conform to the follo\n * Each area root component has its own router outlet and child routes.\n * Feature area routes rarely (if ever) cross with routes of other features.\n \n-If your app had many feature areas, the app component trees might look like this:\n+If your application had many feature areas, the app component trees might look like this:\n \n \n <div class=\"lightbox\">\n@@ -1902,7 +1901,7 @@ Setting the popup `RouterOutlet` to `null` clears the outlet and removes the sec\n \n ## Milestone 5: Route guards\n \n-At the moment, any user can navigate anywhere in the application anytime, but sometimes you need to control access to different parts of your app for various reasons. Some of which may include the following:\n+At the moment, any user can navigate anywhere in the application any time, but sometimes you need to control access to different parts of your app for various reasons. Some of which may include the following:\n \n * Perhaps the user is not authorized to navigate to the target component.\n * Maybe the user must login (authenticate) first.\n@@ -2232,7 +2231,7 @@ Returning a `UrlTree` tells the `Router` to cancel the current navigation and sc\n \n #### Add the `LoginComponent`\n \n-You need a `LoginComponent` for the user to log in to the app. After logging in, you'll redirect to the stored URL if available, or use the default URL.\n+You need a `LoginComponent` for the user to log in to the application. After logging in, you'll redirect to the stored URL if available, or use the default URL.\n There is nothing new about this component or the way you use it in the router configuration.\n \n <code-example language=\"sh\">\n@@ -2294,13 +2293,13 @@ instead of adding the `AuthGuard` to each route individually.\n \n ### `CanDeactivate`: handling unsaved changes\n \n-Back in the \"Heroes\" workflow, the app accepts every change to a hero immediately without validation.\n+Back in the \"Heroes\" workflow, the application accepts every change to a hero immediately without validation.\n \n In the real world, you might have to accumulate the users changes, validate across fields, validate on the server, or hold changes in a pending state until the user confirms them as a group or cancels and reverts all changes.\n \n When the user navigates away, you can let the user decide what to do with unsaved changes.\n If the user cancels, you'll stay put and allow more changes.\n-If the user approves, the app can save.\n+If the user approves, the application can save.\n \n You still might delay navigation until the save succeeds.\n If you let the user move to the next screen immediately and saving were to fail (perhaps the data is ruled invalid), you would lose the context of the error.\n@@ -2315,20 +2314,20 @@ The `CanDeactivate` guard helps you decide what to do with unsaved changes and h\n \n Users update crisis information in the `CrisisDetailComponent`.\n Unlike the `HeroDetailComponent`, the user changes do not update the crisis entity immediately.\n-Instead, the app updates the entity when the user presses the Save button and discards the changes when the user presses the Cancel button.\n+Instead, the application updates the entity when the user presses the Save button and discards the changes when the user presses the Cancel button.\n \n Both buttons navigate back to the crisis list after save or cancel.\n \n <code-example path=\"router/src/app/crisis-center/crisis-detail/crisis-detail.component.ts\" header=\"src/app/crisis-center/crisis-detail/crisis-detail.component.ts (cancel and save methods)\" region=\"cancel-save\"></code-example>\n \n In this scenario, the user could click the heroes link, cancel, push the browser back button, or navigate away without saving.\n \n-This example app asks the user to be explicit with a confirmation dialog box that waits asynchronously for the user's\n+This example application asks the user to be explicit with a confirmation dialog box that waits asynchronously for the user's\n response.\n \n <div class=\"alert is-helpful\">\n \n-You could wait for the user's answer with synchronous, blocking code, however, the app is more responsive&mdash;and can do other work&mdash;by waiting for the user's answer asynchronously.\n+You could wait for the user's answer with synchronous, blocking code, however, the application is more responsive&mdash;and can do other work&mdash;by waiting for the user's answer asynchronously.\n \n </div>\n \n@@ -2385,7 +2384,7 @@ Now you have given the user a safeguard against unsaved changes.\n \n ### _Resolve_: pre-fetching component data\n \n-In the `Hero Detail` and `Crisis Detail`, the app waited until the route was activated to fetch the respective hero or crisis.\n+In the `Hero Detail` and `Crisis Detail`, the application waited until the route was activated to fetch the respective hero or crisis.\n \n If you were using a real world API, there might be some delay before the data to display is returned from the server.\n You don't want to display a blank component while waiting for the data.\n@@ -2556,7 +2555,7 @@ query parameters and fragment.\n <code-example path=\"router/src/app/admin/admin-dashboard/admin-dashboard.component.1.ts\" header=\"src/app/admin/admin-dashboard/admin-dashboard.component.ts (v2)\"></code-example>\n \n Query parameters and fragments are also available through the `ActivatedRoute` service.\n-Just like route parameters, the query parameters and fragments are provided as an `Observable`.\n+Like route parameters, the query parameters and fragments are provided as an `Observable`.\n The updated Crisis Admin component feeds the `Observable` directly into the template using the `AsyncPipe`.\n \n Now, you can click on the Admin button, which takes you to the Login page with the provided `queryParamMap` and `fragment`.\n@@ -2609,7 +2608,7 @@ Open the `AppRoutingModule` and add a new `admin` route to its `appRoutes` array\n \n Give it a `loadChildren` property instead of a `children` property.\n The `loadChildren` property takes a function that returns a promise using the browser's built-in syntax for lazy loading code using dynamic imports `import('...')`.\n-The path is the location of the `AdminModule` (relative to the app root).\n+The path is the location of the `AdminModule` (relative to the application root).\n After the code is requested and loaded, the `Promise` resolves an object that contains the `NgModule`, in this case the `AdminModule`.\n \n <code-example path=\"router/src/app/app-routing.module.5.ts\" region=\"admin-1\" header=\"app-routing.module.ts (load children)\"></code-example>\n@@ -2687,7 +2686,7 @@ For the smallest initial payload and fastest launch time, you should eagerly loa\n \n You could lazy load the Crisis Center.\n But you're almost certain that the user will visit the Crisis Center within minutes of launching the app.\n-Ideally, the app would launch with just the `AppModule` and the `HeroesModule` loaded and then, almost immediately, load the `CrisisCenterModule` in the background.\n+Ideally, the application would launch with just the `AppModule` and the `HeroesModule` loaded and then, almost immediately, load the `CrisisCenterModule` in the background.\n By the time the user navigates to the Crisis Center, its module will have been loaded and ready.\n \n {@a how-preloading}"
        },
        {
            "sha": "bc0793859d557eeb3ad815aaaacf5b8d4eaa450a",
            "filename": "aio/content/guide/router-tutorial.md",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/angular/angular/blob/1710fa861c693f0370cd5fe72e0c2341a7f2b00f/aio%2Fcontent%2Fguide%2Frouter-tutorial.md",
            "raw_url": "https://github.com/angular/angular/raw/1710fa861c693f0370cd5fe72e0c2341a7f2b00f/aio%2Fcontent%2Fguide%2Frouter-tutorial.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Frouter-tutorial.md?ref=1710fa861c693f0370cd5fe72e0c2341a7f2b00f",
            "patch": "@@ -9,7 +9,7 @@ As users access your application's features, the browser needs to render only th\n To define how users navigate through your application, you use routes. You can add routes to define how users navigate from one part of your application to another.\n You can also configure routes to guard against unexpected or unauthorized behavior.\n \n-To explore a sample app featuring the contents of this tutorial, see the <live-example></live-example>.\n+To explore a sample application featuring the contents of this tutorial, see the <live-example></live-example>.\n \n ## Objectives\n "
        },
        {
            "sha": "1e8b71bc5dd267b30a0051909b87ce4618b59292",
            "filename": "aio/content/guide/using-libraries.md",
            "status": "modified",
            "additions": 5,
            "deletions": 5,
            "changes": 10,
            "blob_url": "https://github.com/angular/angular/blob/1710fa861c693f0370cd5fe72e0c2341a7f2b00f/aio%2Fcontent%2Fguide%2Fusing-libraries.md",
            "raw_url": "https://github.com/angular/angular/raw/1710fa861c693f0370cd5fe72e0c2341a7f2b00f/aio%2Fcontent%2Fguide%2Fusing-libraries.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fusing-libraries.md?ref=1710fa861c693f0370cd5fe72e0c2341a7f2b00f",
            "patch": "@@ -8,10 +8,10 @@ See the [Angular Resources](resources) page for links to the most popular ones.\n Libraries are published as [npm packages](guide/npm-packages), usually together with schematics that integrate them with the Angular CLI.\n To integrate reusable library code into an application, you need to install the package and import the provided functionality where you will use it. For most published Angular libraries, you can use the Angular CLI `ng add <lib_name>` command.\n \n-The `ng add` command uses a package manager such as [npm](https://www.npmjs.com/) or [yarn](https://yarnpkg.com/) to install the library package, and invokes schematics that are included in the package to other scaffolding within the project code, such as adding import statements, fonts, themes, and so on.\n+The `ng add` command uses a package manager such as [npm](https://www.npmjs.com/) or [yarn](https://yarnpkg.com/) to install the library package, and invokes schematics that are included in the package to other scaffolding within the project code, such as adding import statements, fonts, and themes.\n \n-A published library typically provides a README or other documentation on how to add that lib to your app.\n-For an example, see [Angular Material](https://material.angular.io/) docs.\n+A published library typically provides a README or other documentation on how to add that lib to your application.\n+For an example, see the [Angular Material](https://material.angular.io/) documents.\n \n ### Library typings\n \n@@ -67,7 +67,7 @@ See the [Angular Update Guide](https://update.angular.io/) for help.\n \n ## Adding a library to the runtime global scope\n \n-Legacy JavaScript libraries that are not imported into an app can be added to the runtime global scope and loaded as if they were in a script tag.\n+Legacy JavaScript libraries that are not imported into an application can be added to the runtime global scope and loaded as if they were in a script tag.\n Configure the CLI to do this at build time using the \"scripts\" and \"styles\" options of the build target in the [CLI configuration file](guide/workspace-config), `angular.json`.\n \n For example, to use the [Bootstrap 4](https://getbootstrap.com/docs/4.0/getting-started/introduction/) library, first install the library and its dependencies using the npm package manager:\n@@ -97,7 +97,7 @@ Add the Bootstrap CSS file to the \"styles\" array:\n ],\n ```\n \n-Run or restart `ng serve` to see Bootstrap 4 working in your app.\n+Run or restart `ng serve` to see Bootstrap 4 working in your application.\n \n ### Using runtime-global libraries inside your app\n "
        }
    ],
    "stats": {
        "total": 150,
        "additions": 74,
        "deletions": 76
    }
}