{
    "author": "TeriGlover",
    "message": "docs: Edits to remove jargon (#43067)\n\nPR Close #43067",
    "sha": "18dc2a9be021909f58ee21754a6ee09cec1ac1f0",
    "files": [
        {
            "sha": "a8156a085757e8682221cfc6993274bca361a6e5",
            "filename": "aio/content/guide/browser-support.md",
            "status": "modified",
            "additions": 4,
            "deletions": 4,
            "changes": 8,
            "blob_url": "https://github.com/angular/angular/blob/18dc2a9be021909f58ee21754a6ee09cec1ac1f0/aio%2Fcontent%2Fguide%2Fbrowser-support.md",
            "raw_url": "https://github.com/angular/angular/raw/18dc2a9be021909f58ee21754a6ee09cec1ac1f0/aio%2Fcontent%2Fguide%2Fbrowser-support.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fbrowser-support.md?ref=18dc2a9be021909f58ee21754a6ee09cec1ac1f0",
            "patch": "@@ -47,12 +47,12 @@ using [Sauce Labs](https://saucelabs.com/) and\n Angular is built on the latest standards of the web platform.\n Targeting such a wide range of browsers is challenging because they do not support all features of modern browsers.\n You compensate by loading polyfill scripts (\"polyfills\") for the browsers that you must support.\n-The [table below](#polyfill-libs) identifies most of the polyfills you might need.\n+The [following table](#polyfill-libs) identifies most of the polyfills you might need.\n \n <div class=\"alert is-important\">\n \n The suggested polyfills are the ones that run full Angular applications.\n-You may need additional polyfills to support features not covered by this list.\n+You might need additional polyfills to support features not covered by this list.\n Note that polyfills cannot magically transform an old, slow browser into a modern, fast one.\n \n </div>\n@@ -76,7 +76,7 @@ For example, if you need the optional [web animations polyfill](https://caniuse.\n   npm install --save web-animations-js\n </code-example>\n \n-You can then add the import statement in the `src/polyfills.ts` file.\n+Then add the import statement in the `src/polyfills.ts` file.\n For many polyfills, you can un-comment the corresponding `import` statement in the file, as in the following example.\n \n <code-example header=\"src/polyfills.ts\">\n@@ -94,7 +94,7 @@ If the polyfill you want is not already in `polyfills.ts` file, add the `import`\n \n ### Optional browser features to polyfill\n \n-Some features of Angular may require additional polyfills.\n+Some features of Angular might require additional polyfills.\n \n <table>\n   <tr style=\"vertical-align: top\">"
        },
        {
            "sha": "83ead00095836d542aa25e25cec56b4de3d2f029",
            "filename": "aio/content/guide/releases.md",
            "status": "modified",
            "additions": 7,
            "deletions": 7,
            "changes": 14,
            "blob_url": "https://github.com/angular/angular/blob/18dc2a9be021909f58ee21754a6ee09cec1ac1f0/aio%2Fcontent%2Fguide%2Freleases.md",
            "raw_url": "https://github.com/angular/angular/raw/18dc2a9be021909f58ee21754a6ee09cec1ac1f0/aio%2Fcontent%2Fguide%2Freleases.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Freleases.md?ref=18dc2a9be021909f58ee21754a6ee09cec1ac1f0",
            "patch": "@@ -2,7 +2,7 @@\n \n We recognize that you need stability from the Angular framework. Stability ensures that reusable components and libraries, tutorials, tools, and learned practices don't become obsolete unexpectedly. Stability is essential for the ecosystem around Angular to thrive.\n \n-We also share with you the desire for Angular to keep evolving. We strive to ensure that the foundation on top of which you are building is continuously improving and enabling you to stay up-to-date with the rest of the web ecosystem and your user needs.\n+We also share with you the need for Angular to keep evolving. We strive to ensure that the foundation on top of which you are building is continuously improving and enabling you to stay up-to-date with the rest of the web ecosystem and your user needs.\n \n This document contains the practices that we follow to provide you with a leading-edge application development platform, balanced with stability. We strive to ensure that future changes are always introduced in a predictable way. We want everyone who depends on Angular to know when and how new features are added, and to be well-prepared when obsolete ones are removed.\n \n@@ -23,7 +23,7 @@ Angular version numbers have three parts: `major.minor.patch`. For example, vers\n \n The version number is incremented based on the level of change included in the release.\n \n-* **Major releases** contain significant new features, some but minimal developer assistance is expected during the update. When updating to a new major release, you may need to run update scripts, refactor code, run additional tests, and learn new APIs.\n+* **Major releases** contain significant new features, some but minimal developer assistance is expected during the update. When updating to a new major release, you might need to run update scripts, refactor code, run additional tests, and learn new APIs.\n \n \n * **Minor releases** contain new smaller features. Minor releases are fully backward-compatible; no developer assistance is expected during update, but you can optionally modify your applications and libraries to begin using new APIs, features, and capabilities that were added in the release. We update peer dependencies in minor versions by expanding the supported versions, but we do not require projects to update these dependencies.\n@@ -40,7 +40,7 @@ The version number is incremented based on the level of change included in the r\n {@a updating}\n ### Supported update paths\n \n-In alignment with the versioning scheme described above, we commit to support the following update paths:\n+In alignment with the preceding versioning scheme as described, we commit to support the following update paths:\n \n * If you are updating within the **same major version,** then you can skip any intermediate versions and update directly to the targeted version. For example, you can update directly from 7.0.0 to 7.2.11.\n \n@@ -74,7 +74,7 @@ Dates are offered as general guidance and are subject to change.\n \n </div>\n \n-In general, you can expect the following release cycle:\n+In general, expect the following release cycle:\n \n * A major release every 6 months\n \n@@ -126,7 +126,7 @@ As a general rule, a fix is considered for an LTS version if it resolves one of:\n \n Sometimes &quot;breaking changes&quot;, such as the removal of support for select APIs and features, are necessary to innovate and stay current with new best practices, changing dependencies, or changes in the (web) platform itself.\n \n-To make these transitions as easy as possible, we make these commitments to you:\n+To make these transitions as straightforward as possible, we make these commitments to you:\n \n * We work hard to minimize the number of breaking changes and to provide migration tools when possible.\n \n@@ -137,7 +137,7 @@ To help ensure that you have sufficient time and a clear path to update, this is\n * **Announcement:** We announce deprecated APIs and features in the [change log](https://github.com/angular/angular/blob/master/CHANGELOG.md \"Angular change log\"). Deprecated APIs appear in the [documentation](api?status=deprecated) with ~~strikethrough.~~ When we announce a deprecation, we also announce a recommended update path. For convenience,  [Deprecations](guide/deprecations) contains a summary of deprecated APIs and features.\n \n \n-* **Deprecation period:** When an API or a feature is deprecated, it will still be present in the next two major releases. After that, deprecated APIs and features will be candidates for removal. A deprecation can be announced in any release, but the removal of a deprecated API or feature will happen only in major release. Until a deprecated API or feature is removed, it will be maintained according to the LTS support policy, meaning that only critical and security issues will be fixed.\n+* **Deprecation period:** When an API or a feature is deprecated, it is still present in the next two major releases. After that, deprecated APIs and features are candidates for removal. A deprecation can be announced in any release, but the removal of a deprecated API or feature happens only in major release. Until a deprecated API or feature is removed, it is maintained according to the LTS support policy, meaning that only critical and security issues are fixed.\n \n \n * **npm dependencies:** We only make npm dependency updates that require changes to your applications in a major release.\n@@ -151,7 +151,7 @@ In minor releases, we update peer dependencies by expanding the supported versio\n \n Angular is a collection of many packages, sub-projects, and tools. To prevent accidental use of private APIs&mdash;and so that you can clearly understand what is covered by the practices described here&mdash;we document what is and is not considered our public API surface. For details, see [Supported Public API Surface of Angular](https://github.com/angular/angular/blob/master/docs/PUBLIC_API.md \"Supported Public API Surface of Angular\").\n \n-Any changes to the public API surface will be done using the versioning, support, and depreciation policies describe above.\n+Any changes to the public API surface are done using the versioning, support, and depreciation policies previously described.\n \n {@a labs}\n ## Angular Labs"
        },
        {
            "sha": "d9253f8e7329dd0cbf6b475f706830eadb8aa46d",
            "filename": "aio/content/guide/roadmap.md",
            "status": "modified",
            "additions": 14,
            "deletions": 14,
            "changes": 28,
            "blob_url": "https://github.com/angular/angular/blob/18dc2a9be021909f58ee21754a6ee09cec1ac1f0/aio%2Fcontent%2Fguide%2Froadmap.md",
            "raw_url": "https://github.com/angular/angular/raw/18dc2a9be021909f58ee21754a6ee09cec1ac1f0/aio%2Fcontent%2Fguide%2Froadmap.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Froadmap.md?ref=18dc2a9be021909f58ee21754a6ee09cec1ac1f0",
            "patch": "@@ -2,9 +2,9 @@\n \n <p class=\"roadmap-last-updated\">Last updated: 2021-05-19</p>\n \n-Angular receives a large number of feature requests, both from inside Google and from the broader open-source community. At the same time, our list of projects contains plenty of maintenance tasks, code refactorings, and potential performance improvements. We bring together representatives from developer relations, product management, and engineering to prioritize this list. As new projects come into the queue, we regularly position them based on relative priority to other projects. As work gets done, projects will move up in the queue.\n+Angular receives a large number of feature requests, both from inside Google and from the broader open-source community. At the same time, our list of projects contains plenty of maintenance tasks, code refactorings, and potential performance improvements. We bring together representatives from developer relations, product management, and engineering to prioritize this list. As new projects come into the queue, we regularly position them based on relative priority to other projects. As work gets done, projects move up in the queue.\n \n-The projects below are not associated with a particular Angular version. We'll release them on completion, and they will be part of a specific version based on our release schedule, following semantic versioning. For example, features are released in the next minor after they are complete, or the next major if they include breaking changes.\n+The following projects are not associated with a particular Angular version. We'll release them on completion, and they will be part of a specific version based on our release schedule, following semantic versioning. For example, features are released in the next minor after they are complete, or the next major if they include breaking changes.\n \n ## In progress\n \n@@ -18,15 +18,15 @@ IE11 has been preventing Angular from taking advantage of some of the modern fea\n \n ### Leverage ES2017+ as the default output language\n \n-Supporting modern browsers will allow us to leverage the more compact, expressive, and performant new syntax of JavaScript. As part of this project we’ll investigate what are the blockers to move forward with this effort and take the steps forward to enable it.\n+Supporting modern browsers lets us take advantage of the more compact, expressive, and performant new syntax of JavaScript. As part of this project we’ll investigate what are the blockers to move forward with this effort and take the steps forward to enable it.\n \n ### Revamp performance dashboards to detect regressions\n \n We have a set of benchmarks that we run against every code change to ensure Angular aligns with our performance standards. To ensure the framework’s runtime does not regress after a code change, we need to refine some of the existing infrastructure the dashboards step on.\n \n ### Enhanced Angular Material components by integrating [MDC Web](https://material.io/develop/web/)\n \n-MDC Web is a library created by Google's Material Design team that provides reusable primitives for building Material Design components. The Angular team is incorporating these primitives into Angular Material. Using MDC Web will align Angular Material more closely with the Material Design specification, expand accessibility, improve component quality, and improve our team's velocity.\n+MDC Web is a library created by Google's Material Design team that provides reusable primitives for building Material Design components. The Angular team is incorporating these primitives into Angular Material. Using MDC Web aligns Angular Material more closely with the Material Design specification, expand accessibility, improve component quality, and improve our team's velocity.\n \n ### Angular component accessibility\n \n@@ -54,7 +54,7 @@ We want to ensure Angular developers are taking advantage of the latest capabili\n \n ### Simplified Angular mental model with optional NgModules\n \n-To simplify the Angular mental model and learning journey, we’ll be working on making NgModules optional. This work will allow developers to develop standalone components and implement an alternative API for declaring the component’s compilation scope.\n+To simplify the Angular mental model and learning journey, we’ll be working on making NgModules optional. This work lets developers develop standalone components and implement an alternative API for declaring the component’s compilation scope.\n \n ## Future\n \n@@ -64,19 +64,19 @@ Look into independent deployability and development of large-scale applications\n \n ### Better developer ergonomics with strict typing for `@angular/forms`\n \n-We will work on implementing stricter type checking for reactive forms. This way, we will allow developers to catch more issues during development time, enable better text editor and IDE support, and improve the type checking for reactive forms.\n+We will work on implementing stricter type checking for reactive forms. This way, we let developers catch more issues during development time, enable better text editor and IDE support, and improve the type checking for reactive forms.\n \n ### Leverage full framework capabilities with Zone.js opt-out\n \n-We are going to design and implement a plan to make Zone.js optional from Angular applications. This way, we will simplify the framework, improve debugging, and reduce application bundle size. Additionally, this will allow us to take advantage of native async/await syntax, which currently Zone.js does not support.\n+We are going to design and implement a plan to make Zone.js optional from Angular applications. This way, we simplify the framework, improve debugging, and reduce application bundle size. Additionally, this lets us take advantage of built-in async/await syntax, which currently Zone.js does not support.\n \n ### Improved build performance with ngc as a tsc plugin distribution\n \n Distributing the Angular compiler as a plugin of the TypeScript compiler will substantially improve developers' build performance and reduce maintenance costs.\n \n ### Support adding directives to host elements\n \n-A long-standing feature request is to add the ability to add directives to host elements. The feature will allow developers to augment their own components with additional behaviors without using inheritance. The project will require substantial effort in terms of the definition of APIs, semantics, and implementation.\n+A long-standing feature request is to add the ability to add directives to host elements. The feature lets developers augment their own components with additional behaviors without using inheritance. The project requires substantial effort in terms of the definition of APIs, semantics, and implementation.\n \n ### Ergonomic component level code-splitting APIs\n \n@@ -97,13 +97,13 @@ A common problem with web applications is their slow initial load time. A way to\n \n _Completed Q2 2021_\n \n-We are working on development tooling for Angular that will provide utilities for debugging and performance profiling. This project aims to help developers understand the component structure and the change detection in an Angular application.\n+We are working on development tooling for Angular that provides utilities for debugging and performance profiling. This project aims to help developers understand the component structure and the change detection in an Angular application.\n \n ### Streamline releases with consolidated Angular versioning & branching\n \n _Completed Q2 2021_\n \n-We want to consolidate release management tooling between Angular's multiple GitHub repositories ([angular/angular](https://github.com/angular/angular), [angular/angular-cli](https://github.com/angular/angular-cli), and [angular/components](https://github.com/angular/components)). This effort will allow us to reuse infrastructure, unify and simplify processes, and improve our release process's reliability.\n+We want to consolidate release management tooling between Angular's multiple GitHub repositories ([angular/angular](https://github.com/angular/angular), [angular/angular-cli](https://github.com/angular/angular-cli), and [angular/components](https://github.com/angular/components)). This effort lets us reuse infrastructure, unify and simplify processes, and improve our release process's reliability.\n \n ### Higher developer consistency with commit message standardization\n \n@@ -115,13 +115,13 @@ We want to unify commit message requirements and conformance across Angular repo\n \n _Completed Q2 2021_\n \n-The goal of this project is to improve the experience and remove legacy dependency by transitioning the language service to Ivy. Today the language service still uses the View Engine compiler and type checking, even for Ivy applications. We want to use the Ivy template parser and improved type checking for the Angular Language service to match application behavior. This migration will also be a step towards unblocking the removal of View Engine, which will simplify Angular, reduce the npm package size, and improve the framework's maintainability.\n+The goal of this project is to improve the experience and remove legacy dependency by transitioning the language service to Ivy. Today the language service still uses the View Engine compiler and type checking, even for Ivy applications. We want to use the Ivy template parser and improved type checking for the Angular Language service to match application behavior. This migration is also a step towards unblocking the removal of View Engine, which will simplify Angular, reduce the npm package size, and improve the framework's maintainability.\n \n ### Increased security with native [Trusted Types](https://web.dev/trusted-types/) in Angular\n \n _Completed Q2 2021_\n \n-In collaboration with Google's security team, we're adding support for the new Trusted Types API. This web platform API will help developers build more secure web applications.\n+In collaboration with Google's security team, we're adding support for the new Trusted Types API. This web platform API helps developers build more secure web applications.\n \n ### Optimized build speed and bundle sizes with Angular CLI webpack 5\n \n@@ -151,7 +151,7 @@ We will redefine the user learning journeys and refresh the introductory documen\n \n _Completed Q1 2021_\n \n-Angular CDK introduced the concept of [component test harnesses](https://material.angular.io/cdk/test-harnesses) to Angular in version 9. Test harnesses allow component authors to create supported APIs for testing component interactions. We're continuing to improve this harness infrastructure and clarifying the best practices around using harnesses. We're also working to drive more harness adoption inside of Google.\n+Angular CDK introduced the concept of [component test harnesses](https://material.angular.io/cdk/test-harnesses) to Angular in version 9. Test harnesses let component authors create supported APIs for testing component interactions. We're continuing to improve this harness infrastructure and clarifying the best practices around using harnesses. We're also working to drive more harness adoption inside of Google.\n \n ### Author a guide for content projection\n \n@@ -165,7 +165,7 @@ _Completed Q4 2020_\n \n With the deprecation of TSLint we will be moving to ESLint. As part of the process, we will work on ensuring backward compatibility with our current recommended TSLint configuration, implement a migration strategy for existing Angular applications and introduce new tooling to the Angular CLI toolchain.\n \n-### Operation Bye Bye Backlog (aka Operation Byelog)\n+### Operation Bye Bye Backlog (also known as Operation Byelog)\n \n _Completed Q4 2020_\n "
        }
    ],
    "stats": {
        "total": 50,
        "additions": 25,
        "deletions": 25
    }
}