{
    "author": "TeriGlover",
    "message": "docs: Edits to remove jargon (#43017)\n\nPR Close #43017",
    "sha": "33708f256dbee79f47dc4dc63a60e0298088cd71",
    "files": [
        {
            "sha": "3b11b9aac48dccdfe8071b69ad8bd19857a039f6",
            "filename": "aio/content/guide/prerendering.md",
            "status": "modified",
            "additions": 2,
            "deletions": 2,
            "changes": 4,
            "blob_url": "https://github.com/angular/angular/blob/33708f256dbee79f47dc4dc63a60e0298088cd71/aio%2Fcontent%2Fguide%2Fprerendering.md",
            "raw_url": "https://github.com/angular/angular/raw/33708f256dbee79f47dc4dc63a60e0298088cd71/aio%2Fcontent%2Fguide%2Fprerendering.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fprerendering.md?ref=33708f256dbee79f47dc4dc63a60e0298088cd71",
            "patch": "@@ -1,6 +1,6 @@\n # Prerendering static pages\n \n-Angular Universal allows you to prerender the pages of your application. Prerendering is the process where a dynamic page is processed at build time generating static HTML.\n+Angular Universal lets you prerender the pages of your application. Prerendering is the process where a dynamic page is processed at build time generating static HTML.\n \n ## How to prerender a page\n \n@@ -43,7 +43,7 @@ ng run &lt;app-name&gt;:prerender --routes /product/1 /product/2\n \n #### Providing additonal routes using a file\n \n-You can provide routes using a file to generate static pages. This method is useful if you have a large number of routes to generate, such as product details for an e-commerce application, which may come from an external source (Database or CMS).\n+You can provide routes using a file to generate static pages. This method is useful if you have a large number of routes to generate, such as product details for an e-commerce application, which might come from an external source (Database or CMS).\n \n To provide routes using a file, use the `--routes-file` option with the name of a `.txt` file containing the routes.\n "
        },
        {
            "sha": "bc42d77578bc4f84aa4a404f2f2ca45c014fe64d",
            "filename": "aio/content/guide/universal.md",
            "status": "modified",
            "additions": 24,
            "deletions": 23,
            "changes": 47,
            "blob_url": "https://github.com/angular/angular/blob/33708f256dbee79f47dc4dc63a60e0298088cd71/aio%2Fcontent%2Fguide%2Funiversal.md",
            "raw_url": "https://github.com/angular/angular/raw/33708f256dbee79f47dc4dc63a60e0298088cd71/aio%2Fcontent%2Fguide%2Funiversal.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Funiversal.md?ref=33708f256dbee79f47dc4dc63a60e0298088cd71",
            "patch": "@@ -10,8 +10,8 @@ layout before it becomes fully interactive.\n For a more detailed look at different techniques and concepts surrounding SSR, check out this\n [article](https://developers.google.com/web/updates/2019/02/rendering-on-the-web).\n \n-You can easily prepare an application for server-side rendering using the [Angular CLI](guide/glossary#cli).\n-The CLI schematic `@nguniversal/express-engine` performs the required steps, as described below.\n+Easily prepare an application for server-side rendering using the [Angular CLI](guide/glossary#cli).\n+The CLI schematic `@nguniversal/express-engine` performs the required steps, as described.\n \n <div class=\"alert is-helpful\">\n \n@@ -74,19 +74,19 @@ npm run dev:ssr\n Open a browser and navigate to http://localhost:4200/.\n You should see the familiar Tour of Heroes dashboard page.\n \n-Navigation using `routerLinks` works correctly because they use the native anchor (`<a>`) tags.\n+Navigation using `routerLinks` works correctly because they use the built-in anchor (`<a>`) tags.\n You can go from the Dashboard to the Heroes page and back.\n-You can click a hero on the Dashboard page to display its Details page.\n+Click a hero on the Dashboard page to display its Details page.\n \n-If you throttle your network speed so that the client-side scripts take longer to download (instructions below),\n+If you throttle your network speed so that the client-side scripts take longer to download (instructions following),\n you'll notice:\n * You can't add or delete a hero.\n * The search box on the Dashboard page is ignored.\n * The *Back* and *Save* buttons on the Details page don't work.\n \n User events other than `routerLink` clicks aren't supported.\n You must wait for the full client application to bootstrap and run, or buffer the events using libraries like\n-[preboot](https://github.com/angular/preboot), which allow you to replay these events once the client-side scripts load.\n+[preboot](https://github.com/angular/preboot), which lets you replay these events once the client-side scripts load.\n \n The transition from the server-rendered application to the client application happens quickly on a development machine, but you should\n always test your applications in real-world scenarios.\n@@ -98,7 +98,7 @@ You can simulate a slower network to see the transition more clearly as follows:\n dropdown on the far right of the menu bar.\n 1. Try one of the \"3G\" speeds.\n \n-The server-rendered application still launches quickly but the full client application may take seconds to load.\n+The server-rendered application still launches quickly but the full client application might take seconds to load.\n \n {@a why-do-it}\n ## Why use server-side rendering?\n@@ -115,25 +115,25 @@ There are three main reasons to create a Universal version of your application.\n \n Google, Bing, Facebook, Twitter, and other social media sites rely on web crawlers to index your application content and\n make that content searchable on the web.\n-These web crawlers may be unable to navigate and index your highly interactive Angular application as a human user could do.\n+These web crawlers might be unable to navigate and index your highly interactive Angular application as a human user could do.\n \n Angular Universal can generate a static version of your application that is easily searchable, linkable, and navigable without JavaScript.\n-Universal also makes a site preview available since each URL returns a fully rendered page.\n+Universal also makes a site preview available because each URL returns a fully rendered page.\n \n {@a no-javascript}\n ### Improve performance on mobile and low-powered devices\n \n Some devices don't support JavaScript or execute JavaScript so poorly that the user experience is unacceptable.\n-For these cases, you may require a server-rendered, no-JavaScript version of the application.\n-This version, however limited, may be the only practical alternative for\n+For these cases, you might require a server-rendered, no-JavaScript version of the application.\n+This version, however limited, might be the only practical alternative for\n people who otherwise couldn't use the application at all.\n \n {@a startup-performance}\n ### Show the first page quickly\n \n Displaying the first page quickly can be critical for user engagement.\n Pages that load faster perform better, [even with changes as small as 100ms](https://web.dev/shopping-for-speed-on-ebay/).\n-Your application may have to launch faster to engage these users before they decide to do something else.\n+Your application might have to launch faster to engage these users before they decide to do something else.\n \n With Angular Universal, you can generate landing pages for the application that look like the complete application.\n The pages are pure HTML, and can display even if JavaScript is disabled.\n@@ -149,7 +149,7 @@ and gets the full interactive experience after the full application loads.\n \n A Universal web server responds to application page requests with static HTML rendered by the [Universal template engine](#universal-engine).\n The server receives and responds to HTTP requests from clients (usually browsers), and serves static assets such as scripts, CSS, and images.\n-It may respond to data requests, either directly or as a proxy to a separate data server.\n+It might respond to data requests, either directly or as a proxy to a separate data server.\n \n The sample web server for this guide is based on the popular [Express](https://expressjs.com/) framework.\n \n@@ -179,14 +179,14 @@ Finally, the server returns the rendered page to the client.\n \n ### Working around the browser APIs\n \n-Because a Universal application doesn't execute in the browser, some of the browser APIs and capabilities may be missing on the server.\n+Because a Universal application doesn't execute in the browser, some of the browser APIs and capabilities might be missing on the server.\n \n For example, server-side applications can't reference browser-only global objects such as `window`, `document`, `navigator`, or `location`.\n \n Angular provides some injectable abstractions over these objects, such as [`Location`](api/common/Location)\n-or [`DOCUMENT`](api/common/DOCUMENT); it may substitute adequately for these APIs.\n+or [`DOCUMENT`](api/common/DOCUMENT); it might substitute adequately for these APIs.\n If Angular doesn't provide it, it's possible to write new abstractions that delegate to the browser APIs while in the browser\n-and to an alternative implementation while on the server (aka shimming).\n+and to an alternative implementation while on the server (also known as shimming).\n \n Similarly, without mouse or keyboard events, a server-side application can't rely on a user clicking a button to show a component.\n The application must determine what to render based solely on the incoming client request.\n@@ -203,8 +203,9 @@ The important bit in the `server.ts` file is the `ngExpressEngine()` function.\n The `ngExpressEngine()` function is a wrapper around Universal's `renderModule()` function which turns a client's\n requests into server-rendered HTML pages. It accepts an object with the following properties:\n \n-* `bootstrap`: The root `NgModule` or `NgModule` factory to use for bootstrapping the application when rendering on the server. For the example app, it is `AppServerModule`. It's the bridge between the Universal server-side renderer and the Angular application.\n-* `extraProviders`: This is optional and lets you specify dependency providers that apply only when rendering the application on the server. You can do this when your application needs information that can only be determined by the currently running server instance.\n+* `bootstrap`: The root `NgModule` or `NgModule` factory to use for bootstraping the application when rendering on the server. For the example\n+application, it is `AppServerModule`. It's the bridge between the Universal server-side renderer and the Angular application.\n+* `extraProviders`: This property is optional and lets you specify dependency providers that apply only when rendering the application on the server. Do this when your application needs information that can only be determined by the currently running server instance.\n \n The `ngExpressEngine()` function returns a `Promise` callback that resolves to the rendered page.\n It's up to the engine to decide what to do with that page.\n@@ -231,10 +232,10 @@ In fact, if the application were only rendered by the server, _every_ applicatio\n as a navigation URL intended for the router.\n \n Fortunately, application routes have something in common: their URLs lack file extensions.\n-(Data requests also lack extensions but they're easy to recognize because they always begin with `/api`.)\n+(Data requests also lack extensions but they can be recognized because they always begin with `/api`.)\n All static asset requests have a file extension (such as `main.js` or `/node_modules/zone.js/bundles/zone.umd.js`).\n \n-Because we use routing, we can easily recognize the three types of requests and handle them differently.\n+Because you use routing, you can recognize the three types of requests and handle them differently.\n \n 1. **Data request**: request URL that begins `/api`.\n 1. **App navigation**: request URL with no file extension.\n@@ -282,7 +283,7 @@ This means that the URLs must be somehow converted to absolute when running on t\n If you are using one of the `@nguniversal/*-engine` packages (such as `@nguniversal/express-engine`), this is taken care for you automatically.\n You don't need to do anything to make relative URLs work on the server.\n \n-If, for some reason, you are not using an `@nguniversal/*-engine` package, you may need to handle it yourself.\n+If, for some reason, you are not using an `@nguniversal/*-engine` package, you might need to handle it yourself.\n \n The recommended solution is to pass the full request URL to the `options` argument of [renderModule()](api/platform-server/renderModule) or [renderModuleFactory()](api/platform-server/renderModuleFactory) (depending on what you use to render `AppServerModule` on the server).\n This option is the least intrusive as it does not require any changes to the application.\n@@ -295,7 +296,7 @@ Now, on every HTTP request made as part of rendering the application on the serv\n \n - `npm run dev:ssr`\n \n-  This command is similar to [`ng serve`](cli/serve), which offers live reload during development, but uses server-side rendering. The application will run in watch mode and refresh the browser after every change.\n+  This command is similar to [`ng serve`](cli/serve), which offers live reload during development, but uses server-side rendering. The application runs in watch mode and refreshes the browser after every change.\n   This command is slower than the actual `ng serve` command.\n \n - `ng build && ng run app-name:server`\n@@ -313,4 +314,4 @@ Now, on every HTTP request made as part of rendering the application on the serv\n - `npm run prerender`\n \n   This script can be used to prerender an application's pages.\n-  You can read more about prerendering [here](guide/prerendering).\n+  Read more about prerendering [here](guide/prerendering)."
        },
        {
            "sha": "2f3cfe45ede720488d25f11311668848b3b2bd6b",
            "filename": "aio/content/guide/web-worker.md",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/angular/angular/blob/33708f256dbee79f47dc4dc63a60e0298088cd71/aio%2Fcontent%2Fguide%2Fweb-worker.md",
            "raw_url": "https://github.com/angular/angular/raw/33708f256dbee79f47dc4dc63a60e0298088cd71/aio%2Fcontent%2Fguide%2Fweb-worker.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fweb-worker.md?ref=33708f256dbee79f47dc4dc63a60e0298088cd71",
            "patch": "@@ -1,6 +1,6 @@\n # Background processing using web workers\n \n-[Web workers](https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API) allow you to run CPU-intensive computations in a background thread,\n+[Web workers](https://developer.mozilla.org/en-US/docs/Web/API/Web_Workers_API) lets you run CPU-intensive computations in a background thread,\n freeing the main thread to update the user interface.\n If you find your application performs a lot of computations, such as generating CAD drawings or doing heavy geometrical calculations, using web workers can help increase your application's performance.\n "
        }
    ],
    "stats": {
        "total": 53,
        "additions": 27,
        "deletions": 26
    }
}