{
    "author": "josephperrott",
    "message": "docs: add note about only one label target being allowed to be applied to a PR (#38764)\n\nTo clarify the use of GitHub labels for targetting PRs, a not about only being\nallowed to apply one label is added.\n\nPR Close #38764",
    "sha": "3406ec15a4629b8428403f4b450804dd66153c1e",
    "files": [
        {
            "sha": "16710cbb81ca351af89f2413bd988ecfbde60716",
            "filename": "docs/TRIAGE_AND_LABELS.md",
            "status": "modified",
            "additions": 5,
            "deletions": 5,
            "changes": 10,
            "blob_url": "https://github.com/angular/angular/blob/3406ec15a4629b8428403f4b450804dd66153c1e/docs%2FTRIAGE_AND_LABELS.md",
            "raw_url": "https://github.com/angular/angular/raw/3406ec15a4629b8428403f4b450804dd66153c1e/docs%2FTRIAGE_AND_LABELS.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/docs%2FTRIAGE_AND_LABELS.md?ref=3406ec15a4629b8428403f4b450804dd66153c1e",
            "patch": "@@ -1,6 +1,6 @@\n # Triage Process and GitHub Labels for Angular\n \n-This document describes how the Angular team uses labels and milestones to triage issues on github.\n+This document describes how the Angular team uses labels and milestones to triage issues on GitHub.\n The basic idea of the process is that caretaker only assigns a component (`comp: *`) label.\n The owner of the component is then responsible for the secondary / component-level triage.\n \n@@ -150,7 +150,7 @@ In addition, PRs can have the following states:\n   * _**Who adds it:** Any team member._\n   * _**Who removes it:** Any team member._\n \n-When a PR is ready for review, a review should be requested using the Reviewers interface in Github.\n+When a PR is ready for review, a review should be requested using the Reviewers interface in GitHub.\n \n \n ## PR Target\n@@ -160,7 +160,7 @@ In our git workflow, we merge changes either to the `master` branch, the active\n The decision about the target must be done by the PR author and/or reviewer.\n This decision is then honored when the PR is being merged by the caretaker.\n \n-To communicate the target we use the following labels:\n+To communicate the target we use GitHub labels and only one target label may be applied to a PR.\n \n Targeting an active release train:\n \n@@ -176,9 +176,9 @@ Special Cases:\n \n Notes:\n   - To land a change only in a patch/RC branch, without landing it in any other active release-train branch (such\n-  as `master`), the patch/RC branch can be targeted in the Github UI with the appropriate\n+  as `master`), the patch/RC branch can be targeted in the GitHub UI with the appropriate\n   `target: patch`/`target: rc` label.\n-  - `target: lts` PRs must target the specific LTS branch they would need to merge into in the Github UI, in\n+  - `target: lts` PRs must target the specific LTS branch they would need to merge into in the GitHub UI, in\n   cases which a change is desired in multiple LTS branches, individual PRs for each LTS branch must be created\n \n "
        }
    ],
    "stats": {
        "total": 10,
        "additions": 5,
        "deletions": 5
    }
}