{
    "author": "josephperrott",
    "message": "build: determine pullapprove fallback with better active group counting (#37636)\n\nPreviously, the fallback group simply determined its active state based on the\nof active groups during processing.  Instead, we should consider if there are\nany active groups after excluding the ones we don't want to be considered, i.e.\nthe minimum required review group and the global approval groups.  This allows\nfor an explicit test of the active groups that exist rather than a prone to get\nout of date number of expected active groups.\n\nWith this change, we additionally need to check to ensure that global approvals\nhave not caused other groups to no longer be active, causing a false case of\nno active groups, when they have simply been superceded by a global approval.\n\nPR Close #37636",
    "sha": "34259e90cb840e4f00d82e3053ecc7b1baa45aed",
    "files": [
        {
            "sha": "7cfc56b6049db150f0a73bf1b45700c8155a508d",
            "filename": ".pullapprove.yml",
            "status": "modified",
            "additions": 11,
            "deletions": 7,
            "changes": 18,
            "blob_url": "https://github.com/angular/angular/blob/34259e90cb840e4f00d82e3053ecc7b1baa45aed/.pullapprove.yml",
            "raw_url": "https://github.com/angular/angular/raw/34259e90cb840e4f00d82e3053ecc7b1baa45aed/.pullapprove.yml",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/.pullapprove.yml?ref=34259e90cb840e4f00d82e3053ecc7b1baa45aed",
            "patch": "@@ -1222,13 +1222,17 @@ groups:\n     # `global-approvers` can still approve PRs that match this `fallback` rule,\n     # but that should be an exception and not an expectation.\n     conditions:\n-      - *can-be-global-approved\n-      # The following groups have no conditions and will be `active` on all PRs\n+      # The following groups have no file based conditions and will be initially `active` on all PRs\n       # - `global-approvers`\n       # - `global-docs-approvers`\n+      # - `required-minimum-review`\n       #\n-      # Since this means the minimum number of active groups a PR can have is 2, this\n-      # `fallback` group should be matched anytime the number of active groups is at or\n-      # below this minimum.  This work as a protection to ensure that pullapprove does\n-      # not incidently mark a PR as passing without meeting the review criteria.\n-      - len(groups.active) <= 2\n+      # By checking the number of active groups when these are excluded, we can determine\n+      # if any other groups are matched.\n+      - len(groups.active.exclude(\"required-minimum-review\").exclude(\"global-approvers\").exclude(\"global-docs-approvers\")) == 0\n+      # When any of the `global-*` groups is approved, they cause other groups to deactivate.\n+      # In those cases, the condition above would evaluate to `true` while in reality, only a global\n+      # approval has been provided. To ensure we don't activate the fallback group in such cases,\n+      # ensure that no explicit global approval has been provided.\n+      - *can-be-global-approved\n+      - *can-be-global-docs-approved"
        }
    ],
    "stats": {
        "total": 18,
        "additions": 11,
        "deletions": 7
    }
}