{
    "author": "TeriGlover",
    "message": "docs: Edits to remove jargon (#43000)\n\nPR Close #43000",
    "sha": "353cad283dac3736073ef5fab649ed2981bf6c8d",
    "files": [
        {
            "sha": "58ad12c87680f1e1edb90e9e67487497cc821bec",
            "filename": "aio/content/guide/app-shell.md",
            "status": "modified",
            "additions": 2,
            "deletions": 2,
            "changes": 4,
            "blob_url": "https://github.com/angular/angular/blob/353cad283dac3736073ef5fab649ed2981bf6c8d/aio%2Fcontent%2Fguide%2Fapp-shell.md",
            "raw_url": "https://github.com/angular/angular/raw/353cad283dac3736073ef5fab649ed2981bf6c8d/aio%2Fcontent%2Fguide%2Fapp-shell.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fapp-shell.md?ref=353cad283dac3736073ef5fab649ed2981bf6c8d",
            "patch": "@@ -9,7 +9,7 @@ Learn more in [The App Shell Model](https://developers.google.com/web/fundamenta\n \n ## Step 1: Prepare the application\n \n-You can do this with the following CLI command:\n+Do this with the following CLI command:\n <code-example language=\"bash\">\n ng new my-app --routing\n </code-example>\n@@ -26,7 +26,7 @@ ng generate app-shell\n \n For more information about this command see [App shell command](cli/generate#app-shell-command). \n \n-After running this command you will notice that the `angular.json` configuration file has been updated to add two new targets, with a few other changes.\n+After running this command you can see that the `angular.json` configuration file has been updated to add two new targets, with a few other changes.\n \n <code-example language=\"json\">\n \"server\": {"
        },
        {
            "sha": "4b94f1a49e1ab6f4f8cbd6bbaa07959d7475c0e4",
            "filename": "aio/content/guide/service-worker-communications.md",
            "status": "modified",
            "additions": 13,
            "deletions": 13,
            "changes": 26,
            "blob_url": "https://github.com/angular/angular/blob/353cad283dac3736073ef5fab649ed2981bf6c8d/aio%2Fcontent%2Fguide%2Fservice-worker-communications.md",
            "raw_url": "https://github.com/angular/angular/raw/353cad283dac3736073ef5fab649ed2981bf6c8d/aio%2Fcontent%2Fguide%2Fservice-worker-communications.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fservice-worker-communications.md?ref=353cad283dac3736073ef5fab649ed2981bf6c8d",
            "patch": "@@ -10,7 +10,7 @@ A basic understanding of the following:\n \n ## `SwUpdate` service\n \n-The `SwUpdate` service gives you access to events that indicate when the service worker has discovered an available update for your application or when it has activated such an update&mdash;meaning it is now serving content from that update to your application.\n+The `SwUpdate` service gives you access to events that indicate when the service worker discovers an available update for your application or when it activates such an update&mdash;meaning it is now serving content from that update to your application.\n \n The `SwUpdate` service supports four separate operations:\n * Getting notified of *available* updates. These are new versions of the application to be loaded if the page is refreshed.\n@@ -25,7 +25,7 @@ The two update events, `available` and `activated`, are `Observable` properties\n <code-example path=\"service-worker-getting-started/src/app/log-update.service.ts\" header=\"log-update.service.ts\" region=\"sw-update\"></code-example>\n \n \n-You can use these events to notify the user of a pending update or to refresh their pages when the code they are running is out of date.\n+Use these events to notify the user of a pending update or to refresh their pages when the code they are running is out of date.\n \n ### Checking for updates\n \n@@ -37,17 +37,17 @@ Do this with the `checkForUpdate()` method:\n \n <code-example path=\"service-worker-getting-started/src/app/check-for-update.service.ts\" header=\"check-for-update.service.ts\"></code-example>\n \n-This method returns a `Promise` which indicates that the update check has completed successfully, though it does not indicate whether an update was discovered as a result of the check. Even if one is found, the service worker must still successfully download the changed files, which can fail. If successful, the `available` event will indicate availability of a new version of the application.\n+This method returns a `Promise` which indicates that the update check completed successfully, though it does not indicate whether an update was discovered as a result of the check. Even if one is found, the service worker must still successfully download the changed files, which can fail. If successful, the `available` event indicates availability of a new version of the application.\n \n <div class=\"alert is-important\">\n \n In order to avoid negatively affecting the initial rendering of the page, `ServiceWorkerModule` waits for up to 30 seconds by default for the application to stabilize, before registering the ServiceWorker script.\n-Constantly polling for updates, for example, with [setInterval()](https://developer.mozilla.org/en-US/docs/Web/API/WindowOrWorkerGlobalScope/setInterval) or RxJS' [interval()](https://rxjs.dev/api/index/function/interval), will prevent the application from stabilizing and the ServiceWorker script will not be registered with the browser until the 30 seconds upper limit is reached.\n+Constantly polling for updates, for example, with [setInterval()](https://developer.mozilla.org/en-US/docs/Web/API/WindowOrWorkerGlobalScope/setInterval) or RxJS' [interval()](https://rxjs.dev/api/index/function/interval), prevents the application from stabilizing and the ServiceWorker script is not registered with the browser until the 30 seconds upper limit is reached.\n \n Note that this is true for any kind of polling done by your application.\n Check the {@link ApplicationRef#isStable isStable} documentation for more information.\n \n-You can avoid that delay by waiting for the application to stabilize first, before starting to poll for updates, as shown in the example above.\n+Avoid that delay by waiting for the application to stabilize first, before starting to poll for updates, as shown in the preceding example.\n Alternatively, you might want to define a different {@link SwRegistrationOptions#registrationStrategy registration strategy} for the ServiceWorker.\n \n </div>\n@@ -71,28 +71,28 @@ In some cases, the version of the application used by the service worker to serv\n \n For example, imagine the following scenario:\n - A user opens the application for the first time and the service worker caches the latest version of the application.\n-  Let's assume the application's cached assets include `index.html`, `main.<main-hash-1>.js` and `lazy-chunk.<lazy-hash-1>.js`.\n+  Assume the application's cached assets include `index.html`, `main.<main-hash-1>.js` and `lazy-chunk.<lazy-hash-1>.js`.\n - The user closes the application and does not open it for a while.\n - After some time, a new version of the application is deployed to the server.\n-  This newer version includes the files `index.html`, `main.<main-hash-2>.js` and `lazy-chunk.<lazy-hash-2>.js` (note that the hashes are different now, because the content of the files has changed).\n+  This newer version includes the files `index.html`, `main.<main-hash-2>.js` and `lazy-chunk.<lazy-hash-2>.js` (note that the hashes are different now, because the content of the files changed).\n   The old version is no longer available on the server.\n - In the meantime, the user's browser decides to evict `lazy-chunk.<lazy-hash-1>.js` from its cache.\n-  This is possible since browsers may decide to evict specific (or all) resources from a cache in order to reclaim disk space.\n+  Browsers might decide to evict specific (or all) resources from a cache in order to reclaim disk space.\n - The user opens the application again.\n   The service worker serves the latest version known to it at this point, namely the old version (`index.html` and `main.<main-hash-1>.js`).\n - At some later point, the application requests the lazy bundle, `lazy-chunk.<lazy-hash-1>.js`.\n - The service worker is unable to find the asset in the cache (remember that the browser evicted it).\n-  Nor is it able to retrieve it from the server (since the server now only has `lazy-chunk.<lazy-hash-2>.js` from the newer version).\n+  Nor is it able to retrieve it from the server (because the server now only has `lazy-chunk.<lazy-hash-2>.js` from the newer version).\n \n-In the above scenario, the service worker is not able to serve an asset that would normally be cached.\n+In the preceding scenario, the service worker is not able to serve an asset that would normally be cached.\n That particular application version is broken and there is no way to fix the state of the client without reloading the page.\n In such cases, the service worker notifies the client by sending an `UnrecoverableStateEvent` event.\n-You can subscribe to `SwUpdate.unrecoverable` to be notified and handle these errors.\n+Subscribe to `SwUpdate#unrecoverable` to be notified and handle these errors.\n \n <code-example path=\"service-worker-getting-started/src/app/handle-unrecoverable-state.service.ts\" header=\"handle-unrecoverable-state.service.ts\" region=\"sw-unrecoverable-state\"></code-example>\n \n \n ## More on Angular service workers\n \n-You may also be interested in the following:\n-* [Service Worker Notifications](guide/service-worker-notifications).\n\\ No newline at end of file\n+You might also be interested in the following:\n+* [Service Worker Notifications](guide/service-worker-notifications)."
        },
        {
            "sha": "3ce11774db06602376f9014ada011276dd8211a9",
            "filename": "aio/content/guide/service-worker-config.md",
            "status": "modified",
            "additions": 18,
            "deletions": 17,
            "changes": 35,
            "blob_url": "https://github.com/angular/angular/blob/353cad283dac3736073ef5fab649ed2981bf6c8d/aio%2Fcontent%2Fguide%2Fservice-worker-config.md",
            "raw_url": "https://github.com/angular/angular/raw/353cad283dac3736073ef5fab649ed2981bf6c8d/aio%2Fcontent%2Fguide%2Fservice-worker-config.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fservice-worker-config.md?ref=353cad283dac3736073ef5fab649ed2981bf6c8d",
            "patch": "@@ -9,7 +9,7 @@ A basic understanding of the following:\n \n The `ngsw-config.json` configuration file specifies which files and data URLs the Angular service\n worker should cache and how it should update the cached files and data. The [Angular CLI](cli)\n-processes the configuration file during `ng build`. Manually, you can process it with the\n+processes the configuration file during `ng build`. Manually, process it with the\n `ngsw-config` tool (where `<project-name>` is the name of the project being built):\n \n <code-example language=\"sh\">\n@@ -25,15 +25,16 @@ Unless otherwise noted, patterns use a limited glob format:\n * `**` matches 0 or more path segments.\n * `*` matches 0 or more characters excluding `/`.\n * `?` matches exactly one character excluding `/`.\n-* The `!` prefix marks the pattern as being negative, meaning that only files that don't match the pattern will be included.\n+* The `!` prefix marks the pattern as being negative, meaning that only files that don't match the pattern are included.\n \n Example patterns:\n \n * `/**/*.html` specifies all HTML files.\n * `/*.html` specifies only HTML files in the root.\n * `!/**/*.map` exclude all sourcemaps.\n \n-Each section of the configuration file is described below.\n+\n+The following sections describe each property of the configuration file.\n \n ## `appData`\n \n@@ -47,7 +48,7 @@ Specifies the file that serves as the index page to satisfy navigation requests.\n \n ## `assetGroups`\n \n-*Assets* are resources that are part of the application version that update along with the application. They can include resources loaded from the page's origin as well as third-party resources loaded from CDNs and other external URLs. As not all such external URLs may be known at build time, URL patterns can be matched.\n+*Assets* are resources that are part of the application version that update along with the application. They can include resources loaded from the page's origin as well as third-party resources loaded from CDNs and other external URLs. As not all such external URLs might be known at build time, URL patterns can be matched.\n \n This field contains an array of asset groups, each of which defines a set of asset resources and the policy by which they are cached.\n \n@@ -103,7 +104,7 @@ The `installMode` determines how these resources are initially cached. The `inst\n \n * `prefetch` tells the Angular service worker to fetch every single listed resource while it's caching the current version of the application. This is bandwidth-intensive but ensures resources are available whenever they're requested, even if the browser is currently offline.\n \n-* `lazy` does not cache any of the resources up front. Instead, the Angular service worker only caches resources for which it receives requests. This is an on-demand caching mode. Resources that are never requested will not be cached. This is useful for things like images at different resolutions, so the service worker only caches the correct assets for the particular screen and orientation.\n+* `lazy` does not cache any of the resources up front. Instead, the Angular service worker only caches resources for which it receives requests. This is an on-demand caching mode. Resources that are never requested are not cached. This is useful for things like images at different resolutions, so the service worker only caches the correct assets for the particular screen and orientation.\n \n Defaults to `prefetch`.\n \n@@ -123,7 +124,7 @@ This section describes the resources to cache, broken up into the following grou\n \n * `files` lists patterns that match files in the distribution directory. These can be single files or glob-like patterns that match a number of files.\n \n-* `urls` includes both URLs and URL patterns that will be matched at runtime. These resources are not fetched directly and do not have content hashes, but they will be cached according to their HTTP headers. This is most useful for CDNs such as the Google Fonts service.<br>\n+* `urls` includes both URLs and URL patterns that are matched at runtime. These resources are not fetched directly and do not have content hashes, but they are cached according to their HTTP headers. This is most useful for CDNs such as the Google Fonts service.<br>\n   _(Negative glob patterns are not supported and `?` will be matched literally; that is, it will not match any character other than `?`.)_\n \n ### `cacheQueryOptions`\n@@ -189,14 +190,14 @@ A list of URL patterns. URLs that match these patterns are cached according to t\n  * `?` is matched literally; that is, it matches *only* the character `?`.\n \n ### `version`\n-Occasionally APIs change formats in a way that is not backward-compatible. A new version of the application may not be compatible with the old API format and thus may not be compatible with existing cached resources from that API.\n+Occasionally APIs change formats in a way that is not backward-compatible. A new version of the application might not be compatible with the old API format and thus might not be compatible with existing cached resources from that API.\n \n `version` provides a mechanism to indicate that the resources being cached have been updated in a backwards-incompatible way, and that the old cache entries&mdash;those from previous versions&mdash;should be discarded.\n \n `version` is an integer field and defaults to `1`.\n \n ### `cacheConfig`\n-This section defines the policy by which matching requests will be cached.\n+This section defines the policy by which matching requests are cached.\n \n #### `maxSize`\n (required) The maximum number of entries, or responses, in the cache. Open-ended caches can grow in unbounded ways and eventually exceed storage quotas, calling for eviction.\n@@ -210,18 +211,18 @@ This section defines the policy by which matching requests will be cached.\n * `s`: seconds\n * `u`: milliseconds\n \n-For example, the string `3d12h` will cache content for up to three and a half days.\n+For example, the string `3d12h` caches content for up to three and a half days.\n \n #### `timeout`\n-This duration string specifies the network timeout. The network timeout is how long the Angular service worker will wait for the network to respond before using a cached response, if configured to do so. `timeout` is a duration string, using the following unit suffixes:\n+This duration string specifies the network timeout. The network timeout is how long the Angular service worker waits for the network to respond before using a cached response, if configured to do so. `timeout` is a duration string, using the following unit suffixes:\n \n * `d`: days\n * `h`: hours\n * `m`: minutes\n * `s`: seconds\n * `u`: milliseconds\n \n-For example, the string `5s30u` will translate to five seconds and 30 milliseconds of network timeout.\n+For example, the string `5s30u` translates to five seconds and 30 milliseconds of network timeout.\n \n #### `strategy`\n \n@@ -237,7 +238,7 @@ The Angular service worker can use either of two caching strategies for data res\n You can also emulate a third strategy, [staleWhileRevalidate](https://developers.google.com/web/fundamentals/instant-and-offline/offline-cookbook/#stale-while-revalidate), which returns cached data (if available), but also fetches fresh data from the network in the background for next time.\n To use this strategy set `strategy` to `freshness` and `timeout` to `0u` in `cacheConfig`.\n \n-This will essentially do the following:\n+This essentially does the following:\n \n 1. Try to fetch from the network first.\n 1. If the network request does not complete after 0ms (that is, immediately), fall back to the cache (ignoring cache age).\n@@ -256,11 +257,11 @@ This optional section enables you to specify a custom list of URLs that will be\n \n ### Handling navigation requests\n \n-The ServiceWorker will redirect navigation requests that don't match any `asset` or `data` group to the specified [index file](#index-file). A request is considered to be a navigation request if:\n+The ServiceWorker redirects navigation requests that don't match any `asset` or `data` group to the specified [index file](#index-file). A request is considered to be a navigation request if:\n \n 1. Its [mode](https://developer.mozilla.org/en-US/docs/Web/API/Request/mode) is `navigation`.\n 2. It accepts a `text/html` response (as determined by the value of the `Accept` header).\n-3. Its URL matches certain criteria (see below).\n+3. Its URL matches certain criteria (see the following).\n \n By default, these criteria are:\n \n@@ -275,11 +276,11 @@ To configure whether navigation requests are sent through to the network or not,\n \n ### Matching navigation request URLs\n \n-While these default criteria are fine in most cases, it is sometimes desirable to configure different rules. For example, you may want to ignore specific routes (that are not part of the Angular app) and pass them through to the server.\n+While these default criteria are fine in most cases, it is sometimes desirable to configure different rules. For example, you might want to ignore specific routes (that are not part of the Angular app) and pass them through to the server.\n \n-This field contains an array of URLs and [glob-like](#glob-patterns) URL patterns that will be matched at runtime. It can contain both negative patterns (that is, patterns starting with `!`) and non-negative patterns and URLs.\n+This field contains an array of URLs and [glob-like](#glob-patterns) URL patterns that are matched at runtime. It can contain both negative patterns (that is, patterns starting with `!`) and non-negative patterns and URLs.\n \n-Only requests whose URLs match _any_ of the non-negative URLs/patterns and _none_ of the negative ones will be considered navigation requests. The URL query will be ignored when matching.\n+Only requests whose URLs match _any_ of the non-negative URLs/patterns and _none_ of the negative ones are considered navigation requests. The URL query is ignored when matching.\n \n If the field is omitted, it defaults to:\n "
        },
        {
            "sha": "115eaf203d37cfc3b6bf0535f8d1ce9542be8816",
            "filename": "aio/content/guide/service-worker-devops.md",
            "status": "modified",
            "additions": 10,
            "deletions": 10,
            "changes": 20,
            "blob_url": "https://github.com/angular/angular/blob/353cad283dac3736073ef5fab649ed2981bf6c8d/aio%2Fcontent%2Fguide%2Fservice-worker-devops.md",
            "raw_url": "https://github.com/angular/angular/raw/353cad283dac3736073ef5fab649ed2981bf6c8d/aio%2Fcontent%2Fguide%2Fservice-worker-devops.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fservice-worker-devops.md?ref=353cad283dac3736073ef5fab649ed2981bf6c8d",
            "patch": "@@ -9,18 +9,18 @@ A basic understanding of the following:\n \n ## Service worker and caching of app resources\n \n-Conceptually, you can imagine the Angular service worker as a forward cache or a CDN edge that is installed in the end user's web browser. The service worker's job is to satisfy requests made by the Angular application for resources or data from a local cache, without needing to wait for the network. Like any cache, it has rules for how content is expired and updated.\n+Conceptually, imagine the Angular service worker as a forward cache or a CDN edge that is installed in the end user's web browser. The service worker's job is to satisfy requests made by the Angular application for resources or data from a local cache, without needing to wait for the network. Like any cache, it has rules for how content is expired and updated.\n \n {@a versions}\n \n ### App versions\n \n-In the context of an Angular service worker, a \"version\" is a collection of resources that represent a specific build of the Angular application. Whenever a new build of the application is deployed, the service worker treats that build as a new version of the application. This is true even if only a single file is updated. At any given time, the service worker may have multiple versions of the application in its cache and it may be serving them simultaneously. For more information, see the [App tabs](guide/service-worker-devops#tabs) section below.\n+In the context of an Angular service worker, a \"version\" is a collection of resources that represent a specific build of the Angular application. Whenever a new build of the application is deployed, the service worker treats that build as a new version of the application. This is true even if only a single file is updated. At any given time, the service worker might have multiple versions of the application in its cache and it might be serving them simultaneously. For more information, see the [App tabs](guide/service-worker-devops#tabs) section below.\n \n To preserve application integrity, the Angular service worker groups all files into a version together. The files grouped into a version usually include HTML, JS, and CSS files. Grouping of these files is essential for integrity because HTML, JS, and CSS files frequently refer to each other and depend on specific content. For example, an `index.html` file might have a `<script>` tag that references `bundle.js` and it might attempt to call a function `startApp()` from within that script. Any time this version of `index.html` is served, the corresponding `bundle.js` must be served with it. For example, assume that the `startApp()` function is renamed to `runApp()` in both files. In this scenario, it is not valid to serve the old `index.html`, which calls `startApp()`, along with the new bundle, which defines `runApp()`.\n \n This file integrity is especially important when lazy loading modules.\n-A JS bundle may reference many lazy chunks, and the filenames of the\n+A JS bundle might reference many lazy chunks, and the filenames of the\n lazy chunks are unique to the particular build of the application. If a running\n application at version `X` attempts to load a lazy chunk, but the server has\n already updated to version `X + 1`, the lazy loading operation will fail.\n@@ -147,16 +147,16 @@ the application will be refreshed transparently from the network.\n \n ### Bypassing the service worker\n \n-In some cases, you may want to bypass the service worker entirely and let the browser handle the\n+In some cases, you might want to bypass the service worker entirely and let the browser handle the\n request instead. An example is when you rely on a feature that is currently not supported in service\n workers (for example, [reporting progress on uploaded files](https://github.com/w3c/ServiceWorker/issues/1141)).\n \n-To bypass the service worker you can set `ngsw-bypass` as a request header, or as a query parameter.\n+To bypass the service worker, set `ngsw-bypass` as a request header, or as a query parameter.\n (The value of the header or query parameter is ignored and can be empty or omitted.)\n \n ## Debugging the Angular service worker\n \n-Occasionally, it may be necessary to examine the Angular service\n+Occasionally, it might be necessary to examine the Angular service\n worker in a running state to investigate issues or to ensure that\n it is operating as designed. Browsers provide built-in tools for\n debugging service workers and the Angular service worker itself\n@@ -331,7 +331,7 @@ be used as a last resort to get rid of unwanted service workers already\n installed on client pages.\n \n It's important to note that you cannot register this worker directly,\n-as old clients with cached state may not see a new `index.html` which\n+as old clients with cached state might not see a new `index.html` which\n installs the different worker script. Instead, you must serve the\n contents of `safety-worker.js` at the URL of the Service Worker script\n you are trying to unregister, and must continue to do so until you are\n@@ -346,7 +346,7 @@ Workers which might have been served in the past on your site.\n ### Changing your app's location\n \n It is important to note that service workers don't work behind redirect. You\n-may have already encountered the error `The script resource is behind a redirect, which is disallowed`.\n+might have already encountered the error `The script resource is behind a redirect, which is disallowed`.\n \n This can be a problem if you have to change your application's location. If you setup\n a redirect from the old location (for example `example.com`) to the new\n@@ -357,12 +357,12 @@ entirely from Service Worker. The old worker (registered at `example.com`)\n  get redirected to the new location `www.example.com` and create the error\n `The script resource is behind a redirect, which is disallowed`.\n \n-To remedy this, you may need to kill the old worker using one of the above\n+To remedy this, you might need to deactivate the old worker using one of the above\n techniques ([Fail-safe](#fail-safe) or [Safety Worker](#safety-worker)).\n \n \n ## More on Angular service workers\n \n-You may also be interested in the following:\n+You might also be interested in the following:\n * [Service Worker Configuration](guide/service-worker-config).\n "
        },
        {
            "sha": "0dee8c076eeafcbb312bea9884bdec71ab294df3",
            "filename": "aio/content/guide/service-worker-getting-started.md",
            "status": "modified",
            "additions": 8,
            "deletions": 8,
            "changes": 16,
            "blob_url": "https://github.com/angular/angular/blob/353cad283dac3736073ef5fab649ed2981bf6c8d/aio%2Fcontent%2Fguide%2Fservice-worker-getting-started.md",
            "raw_url": "https://github.com/angular/angular/raw/353cad283dac3736073ef5fab649ed2981bf6c8d/aio%2Fcontent%2Fguide%2Fservice-worker-getting-started.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fservice-worker-getting-started.md?ref=353cad283dac3736073ef5fab649ed2981bf6c8d",
            "patch": "@@ -17,7 +17,7 @@ with setting up the necessary support files.\n ng add @angular/pwa --project *project-name*\n ```\n \n-The above command completes the following actions:\n+The preceding command completes the following actions:\n \n 1. Adds the `@angular/service-worker` package to your project.\n 2. Enables service worker build support in the CLI.\n@@ -45,7 +45,7 @@ using an example application.\n \n ### Serving with `http-server`\n \n-Because `ng serve` does not work with service workers, you must use a separate HTTP server to test your project locally. You can use any HTTP server. The example below uses the [http-server](https://www.npmjs.com/package/http-server) package from npm. To reduce the possibility of conflicts and avoid serving stale content, test on a dedicated port and disable caching.\n+Because `ng serve` does not work with service workers, you must use a separate HTTP server to test your project locally. Use any HTTP server. The following example uses the [http-server](https://www.npmjs.com/package/http-server) package from npm. To reduce the possibility of conflicts and avoid serving stale content, test on a dedicated port and disable caching.\n \n To serve the directory containing your web files with `http-server`, run the following command:\n \n@@ -55,7 +55,7 @@ http-server -p 8080 -c-1 dist/<project-name>\n \n ### Initial load\n \n-With the server running, you can point your browser at [http://localhost:8080](http://localhost:8080). Your application should load normally.\n+With the server running, point your browser at http://localhost:8080/. Your application should load normally.\n \n <div class=\"alert is-helpful\">\n \n@@ -90,7 +90,7 @@ For applications that do not use the Angular service worker, refreshing now woul\n \n With the addition of an Angular service worker, the application behavior changes. On a refresh, the page loads normally.\n \n-If you look at the Network tab, you can verify that the service worker is active.\n+Look at the Network tab to verify that the service worker is active.\n \n <div class=\"lightbox\">\n   <img src=\"generated/images/guide/service-worker/sw-active.png\" alt=\"Requests are marked as from ServiceWorker\">\n@@ -121,9 +121,9 @@ Pay attention to two key points:\n ### Making changes to your application\n \n Now that you've seen how service workers cache your application, the\n-next step is understanding how updates work. Let's make a change to the application, and watch the service worker install the update:\n+next step is understanding how updates work. Make a change to the application, and watch the service worker install the update:\n \n-1. If you're testing in an incognito window, open a second blank tab. This will keep the incognito and the cache state alive during your test.\n+1. If you're testing in an incognito window, open a second blank tab. This keeps the incognito and the cache state alive during your test.\n \n 1. Close the application tab, but not the window. This should also close the Developer Tools.\n \n@@ -152,7 +152,7 @@ Now look at how the browser and service worker handle the updated application.\n \n   What went wrong? Nothing, actually. The Angular service worker is doing its job and serving the version of the application that it has **installed**, even though there is an update available. In the interest of speed, the service worker doesn't wait to check for updates before it serves the application that it has cached.\n \n-  If you look at the `http-server` logs, you can see the service worker requesting `/ngsw.json`. This is how the service worker checks for updates.\n+  Look at the `http-server` logs to see the service worker requesting `/ngsw.json`. This is how the service worker checks for updates.\n \n 1. Refresh the page.\n \n@@ -164,6 +164,6 @@ Now look at how the browser and service worker handle the updated application.\n \n ## More on Angular service workers\n \n-You may also be interested in the following:\n+You might also be interested in the following:\n * [App Shell](guide/app-shell).\n * [Communicating with service workers](guide/service-worker-communications)."
        },
        {
            "sha": "fa73b54595c68ca9d8269cf1680c181f47be5440",
            "filename": "aio/content/guide/service-worker-intro.md",
            "status": "modified",
            "additions": 7,
            "deletions": 7,
            "changes": 14,
            "blob_url": "https://github.com/angular/angular/blob/353cad283dac3736073ef5fab649ed2981bf6c8d/aio%2Fcontent%2Fguide%2Fservice-worker-intro.md",
            "raw_url": "https://github.com/angular/angular/raw/353cad283dac3736073ef5fab649ed2981bf6c8d/aio%2Fcontent%2Fguide%2Fservice-worker-intro.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fservice-worker-intro.md?ref=353cad283dac3736073ef5fab649ed2981bf6c8d",
            "patch": "@@ -1,6 +1,6 @@\n # Angular service worker introduction\n \n-Service workers augment the traditional web deployment model and empower applications to deliver a user experience with the reliability and performance on par with natively-installed code. Adding a service worker to an Angular application is one of the steps for turning an application into a [Progressive Web App](https://developers.google.com/web/progressive-web-apps/) (also known as a PWA).\n+Service workers augment the traditional web deployment model and empower applications to deliver a user experience with the reliability and performance on par with code that is written to run on your operating system and hardware. Adding a service worker to an Angular application is one of the steps for turning an application into a [Progressive Web App](https://developers.google.com/web/progressive-web-apps/) (also known as a PWA).\n \n At its simplest, a service worker is a script that runs in the web browser and manages caching for an application.\n \n@@ -27,17 +27,17 @@ To achieve this, the Angular service worker follows these guidelines:\n \n To support these behaviors, the Angular service worker loads a *manifest* file from the server. The file, called `ngsw.json` (not to be confused with the [web app manifest](https://developer.mozilla.org/en-US/docs/Web/Manifest)), describes the resources to cache and includes hashes of every file's contents. When an update to the application is deployed, the contents of the manifest change, informing the service worker that a new version of the application should be downloaded and cached. This manifest is generated from a CLI-generated configuration file called `ngsw-config.json`.\n \n-Installing the Angular service worker is as easy as including an `NgModule`. In addition to registering the Angular service worker with the browser, this also makes a few services available for injection which interact with the service worker and can be used to control it. For example, an application can ask to be notified when a new update becomes available, or an application can ask the service worker to check the server for available updates.\n+Installing the Angular service worker is as straightforward as including an `NgModule`. In addition to registering the Angular service worker with the browser, this also makes a few services available for injection which interact with the service worker and can be used to control it. For example, an application can ask to be notified when a new update becomes available, or an application can ask the service worker to check the server for available updates.\n \n ## Prerequisites\n \n To make use of all the features of Angular service workers, use the latest versions of Angular and the Angular CLI.\n \n-In order for service workers to be registered, the application must be accessed over HTTPS, not HTTP.\n+For service workers to be registered, the application must be accessed over HTTPS, not HTTP.\n Browsers ignore service workers on pages that are served over an insecure connection.\n The reason is that service workers are quite powerful, so extra care is needed to ensure the service worker script has not been tampered with.\n \n-There is one exception to this rule: to make local development easier, browsers do _not_ require a secure connection when accessing an application on `localhost`.\n+There is one exception to this rule: to make local development more straightforward, browsers do _not_ require a secure connection when accessing an application on `localhost`.\n \n ### Browser support\n \n@@ -53,9 +53,9 @@ More specifically:\n * The observable events of related services, such as `SwUpdate.available`, are not triggered.\n \n It is highly recommended that you ensure that your application works even without service worker support in the browser.\n-Although an unsupported browser ignores service worker caching, it will still report errors if the application attempts to interact with the service worker.\n-For example, calling `SwUpdate.checkForUpdate()` will return rejected promises.\n-To avoid such an error, you can check whether the Angular service worker is enabled using `SwUpdate.isEnabled`.\n+Although an unsupported browser ignores service worker caching, it still reports errors if the application attempts to interact with the service worker.\n+For example, calling `SwUpdate.checkForUpdate()` returns rejected promises.\n+To avoid such an error, check whether the Angular service worker is enabled using `SwUpdate.isEnabled`.\n \n To learn more about other browsers that are service worker ready, see the [Can I Use](https://caniuse.com/#feat=serviceworkers) page and [MDN docs](https://developer.mozilla.org/en-US/docs/Web/API/Service_Worker_API).\n "
        },
        {
            "sha": "4ef0a79f1c2113499da1935eb6b92476119cb111",
            "filename": "aio/content/guide/service-worker-notifications.md",
            "status": "modified",
            "additions": 2,
            "deletions": 2,
            "changes": 4,
            "blob_url": "https://github.com/angular/angular/blob/353cad283dac3736073ef5fab649ed2981bf6c8d/aio%2Fcontent%2Fguide%2Fservice-worker-notifications.md",
            "raw_url": "https://github.com/angular/angular/raw/353cad283dac3736073ef5fab649ed2981bf6c8d/aio%2Fcontent%2Fguide%2Fservice-worker-notifications.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fservice-worker-notifications.md?ref=353cad283dac3736073ef5fab649ed2981bf6c8d",
            "patch": "@@ -7,7 +7,7 @@ The Angular service worker enables the display of push notifications and the han\n <div class=\"alert is-helpful\">\n \n   When using the Angular service worker, push notification interactions are handled using the `SwPush` service.\n-  To learn more about the native APIs involved see [Push API](https://developer.mozilla.org/en-US/docs/Web/API/Push_API) and [Using the Notifications API](https://developer.mozilla.org/en-US/docs/Web/API/Notifications_API/Using_the_Notifications_API).\n+  To learn more about the browser APIs involved see [Push API](https://developer.mozilla.org/en-US/docs/Web/API/Push_API) and [Using the Notifications API](https://developer.mozilla.org/en-US/docs/Web/API/Notifications_API/Using_the_Notifications_API).\n \n </div>\n \n@@ -101,6 +101,6 @@ In addition, using the `onActionClick` property on the `data` object, you can ti\n \n ## More on Angular service workers\n \n-You may also be interested in the following:\n+You might also be interested in the following:\n \n - [Service Worker in Production](guide/service-worker-devops)."
        }
    ],
    "stats": {
        "total": 119,
        "additions": 60,
        "deletions": 59
    }
}