{
    "author": "ahasall",
    "message": "docs: remove the section \"Using components vs services from other modules\" (#41835)\n\nThis section states that \"Importing a module with services means that you will have a new instance of that service\". This is only true for lazy-loaded `NgModules`. For non-lazy-loaded modules, my understanding is that the providers arrays are flattened into the root injector meaning that importing a module with a service doesn't create a new instance of that service.\n\nPR Close #41835",
    "sha": "378397654390097c597cd5a2b11b9d2de750464c",
    "files": [
        {
            "sha": "85c5934b6cc334c762fc55a37275f83d470d76cd",
            "filename": "aio/content/guide/sharing-ngmodules.md",
            "status": "modified",
            "additions": 0,
            "deletions": 12,
            "changes": 12,
            "blob_url": "https://github.com/angular/angular/blob/378397654390097c597cd5a2b11b9d2de750464c/aio%2Fcontent%2Fguide%2Fsharing-ngmodules.md",
            "raw_url": "https://github.com/angular/angular/raw/378397654390097c597cd5a2b11b9d2de750464c/aio%2Fcontent%2Fguide%2Fsharing-ngmodules.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fsharing-ngmodules.md?ref=378397654390097c597cd5a2b11b9d2de750464c",
            "patch": "@@ -41,18 +41,6 @@ to import `FormsModule`, `SharedModule` can still export\n way, you can give other modules access to `FormsModule` without\n having to import it directly into the `@NgModule` decorator.\n \n-### Using components vs services from other modules\n-\n-There is an important distinction between using another module's component and\n-using a service from another module. Import modules when you want to use\n-directives, pipes, and components. Importing a module with services means that you will have a new instance of that service, which typically is not what you need (typically one wants to reuse an existing service). Use module imports to control service instantiation.\n-\n-The most common way to get a hold of shared services is through Angular\n-[dependency injection](guide/dependency-injection), rather than through the module system (importing a module will result in a new service instance, which is not a typical usage).\n-\n-To read about sharing services, see [Providers](guide/providers).\n-\n-\n ## More on NgModules\n \n You may also be interested in the following:"
        }
    ],
    "stats": {
        "total": 12,
        "additions": 0,
        "deletions": 12
    }
}