{
    "author": "sumitarora",
    "message": "docs(devtools): adding component inspector documentation",
    "sha": "38e6f4f45e7b5ab775a57d288e70eb358179e4c7",
    "files": [
        {
            "sha": "32bfa48580372add03f83af1ec2d0cd2d2d9cb52",
            "filename": "docs/component-inspector.md",
            "status": "added",
            "additions": 41,
            "deletions": 0,
            "changes": 41,
            "blob_url": "https://github.com/angular/angular/blob/38e6f4f45e7b5ab775a57d288e70eb358179e4c7/docs%2Fcomponent-inspector.md",
            "raw_url": "https://github.com/angular/angular/raw/38e6f4f45e7b5ab775a57d288e70eb358179e4c7/docs%2Fcomponent-inspector.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/docs%2Fcomponent-inspector.md?ref=38e6f4f45e7b5ab775a57d288e70eb358179e4c7",
            "patch": "@@ -0,0 +1,41 @@\n+### Component Explorer\n+\n+The component tree displays a hierarchical relationship of the _components_. When a _component_ is selected, Devtools presents additional information about the selected _component_.\n+\n+At the screenshot below, you can see the UI of the component explorer:\n+\n+<img src=\"assets/component-explorer.png\" />\n+\n+On the left-hand side is the component tree. You can click on the individual elements to select them and preview their properties. To navigate in the component tree, you can use the arrows:\n+\n+- Up & down to select the previous and next nodes.\n+- Left & right to collapse and expand a node.\n+\n+If you have a lot of components and directives, you can look up for a particular element using the search box at the top. It'll perform a case insensitive exact substring match and highlight the found nodes. To navigate to the next search match, just press \"Enter.\" To navigate to the previous search match, press \"Shift + Enter.\"\n+\n+<img src=\"assets/search.gif\" />\n+\n+### Navigate to DOM node\n+\n+To go to the host element of a particular component or directive, just double click on it. Chrome DevTools will open the Elements tab and select the associated DOM element if available.\n+\n+<img src=\"assets/navigate-dom.gif\" />\n+\n+### Navigate to source\n+\n+For components, Angular DevTools would also allow you to navigate to the component definition in the source tab. Once you select a particular component, click on the icon at the top-right of the property view (if available):\n+\n+<img src=\"assets/navigate-source.gif\"/>\n+\n+### Update property value\n+\n+The property view, similarly to Chrome DevTools, allows you to edit the value of an input, output, or state property. Just right click on the property value. If edit functionality is available for this value type, you'll see a text input.\n+Type the new value and press enter.\n+\n+<img src=\"assets/update-property.gif\"/>\n+\n+### Access selected component in console\n+\n+As a shortcut in the console, Angular DevTools provides you access to the currently selected component. Just type `$ng0` to get a reference to the instance of the selected component. DevTools keeps references to the last 5 selections in the variables `$ng0`, `$ng1`, `$ng2`, `$ng3`, and `$ng4`.\n+\n+<img src=\"assets/access-console.gif\" />"
        }
    ],
    "stats": {
        "total": 41,
        "additions": 41,
        "deletions": 0
    }
}