{
    "author": "Tchanu",
    "message": "docs(router): fix typos (#38132)\n\nPR Close #38132",
    "sha": "4a6dcd006ba0f41fa067d3eb302f0ad78592e7c6",
    "files": [
        {
            "sha": "af3440b330cf5995c96f097d07bab31247c198b6",
            "filename": "aio/content/guide/router-tutorial.md",
            "status": "modified",
            "additions": 3,
            "deletions": 3,
            "changes": 6,
            "blob_url": "https://github.com/angular/angular/blob/4a6dcd006ba0f41fa067d3eb302f0ad78592e7c6/aio%2Fcontent%2Fguide%2Frouter-tutorial.md",
            "raw_url": "https://github.com/angular/angular/raw/4a6dcd006ba0f41fa067d3eb302f0ad78592e7c6/aio%2Fcontent%2Fguide%2Frouter-tutorial.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Frouter-tutorial.md?ref=4a6dcd006ba0f41fa067d3eb302f0ad78592e7c6",
            "patch": "@@ -4,7 +4,7 @@ This tutorial describes how you can build a single-page application, SPA that us\n \n \n In an SPA, all of your application's functions exist in a single HTML page.\n-As users access your application's features, the browser needs to render only the parts that matter to the user, instead of loading a new page. This pattern can significantly improve your application's user exprience.\n+As users access your application's features, the browser needs to render only the parts that matter to the user, instead of loading a new page. This pattern can significantly improve your application's user experience.\n \n To define how users navigate through your application, you use routes. You can add routes to define how users navigate from one part of your application to another.\n You can also configure routes to guard against unexpected or unauthorized behavior.\n@@ -105,7 +105,7 @@ In this section, you'll define two routes:\n * The route `/crisis-center` opens the `crisis-center` component.\n * The route `/heroes-list` opens the `heroes-list` component.\n \n-A route definition is a JavaScript object. Each route typically has two propteries. The first property, `path`, is a string\n+A route definition is a JavaScript object. Each route typically has two properties. The first property, `path`, is a string\n that specifies the URL path for the route. The second property, `component`, is a string that specifies\n what component your application should display for that path.\n \n@@ -220,7 +220,7 @@ Now when you open your application, it displays the `heroes-list` component by d\n ## Adding a 404 page\n \n It is possible for a user to try to access a route that you have not defined. To account for\n-this behavior, a best practice is to display a 404 page. In this section, you'll create a 404 page and\n+this behavior, the best practice is to display a 404 page. In this section, you'll create a 404 page and\n update your route configuration to show that page for any unspecified routes.\n \n 1. From the terminal, create a new component, `PageNotFound`."
        }
    ],
    "stats": {
        "total": 6,
        "additions": 3,
        "deletions": 3
    }
}