{
    "author": "TeriGlover",
    "message": "docs: Edits to remove jargon in Reference section (#42033)\n\nPR Close #42033",
    "sha": "4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f",
    "files": [
        {
            "sha": "c754c42e4d933bb4780cf41f82869d75901d2538",
            "filename": "aio/content/guide/architecture-components.md",
            "status": "modified",
            "additions": 4,
            "deletions": 4,
            "changes": 8,
            "blob_url": "https://github.com/angular/angular/blob/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Farchitecture-components.md",
            "raw_url": "https://github.com/angular/angular/raw/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Farchitecture-components.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Farchitecture-components.md?ref=4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f",
            "patch": "@@ -3,7 +3,7 @@\n A *component* controls a patch of screen called a [*view*](guide/glossary#view \"Definition of view\").\n For example, individual components define and control each of the following views from the [Tour of Heroes tutorial](tutorial):\n \n-* The app root with the navigation links.\n+* The application root with the navigation links.\n * The list of heroes.\n * The hero editor.\n \n@@ -17,7 +17,7 @@ The service is provided to the component through the dependency injection system\n \n <code-example path=\"architecture/src/app/hero-list.component.ts\" header=\"src/app/hero-list.component.ts (class)\" region=\"class\"></code-example>\n \n-Angular creates, updates, and destroys components as the user moves through the application. Your app can take action at each moment in this lifecycle through optional [lifecycle hooks](guide/lifecycle-hooks), like `ngOnInit()`.\n+Angular creates, updates, and destroys components as the user moves through the application. Your application can take action at each moment in this lifecycle through optional [lifecycle hooks](guide/lifecycle-hooks), like `ngOnInit()`.\n \n ## Component metadata\n \n@@ -35,7 +35,7 @@ Here's an example of basic metadata for `HeroListComponent`.\n \n This example shows some of the most useful `@Component` configuration options:\n \n-* `selector`: A CSS selector that tells Angular to create and insert an instance of this component wherever it finds the corresponding tag in template HTML. For example, if an app's HTML contains `<app-hero-list></app-hero-list>`, then\n+* `selector`: A CSS selector that tells Angular to create and insert an instance of this component wherever it finds the corresponding tag in template HTML. For example, if an application's HTML contains `<app-hero-list></app-hero-list>`, then\n Angular inserts an instance of the `HeroListComponent` view between those tags.\n \n * `templateUrl`: The module-relative address of this component's HTML template. Alternatively, you can provide the HTML template inline, as the value of the `template` property. This template defines the component's *host view*.\n@@ -59,7 +59,7 @@ A view hierarchy can include views from components in the same NgModule, but it\n \n ## Template syntax\n \n-A template looks like regular HTML, except that it also contains Angular [template syntax](guide/template-syntax), which alters the HTML based on your app's logic and the state of app and DOM data. Your template can use *data binding* to coordinate the app and DOM data, *pipes* to transform data before it is displayed, and *directives* to apply app logic to what gets displayed.\n+A template looks like regular HTML, except that it also contains Angular [template syntax](guide/template-syntax), which alters the HTML based on your application's logic and the state of application and DOM data. Your template can use *data binding* to coordinate the application and DOM data, *pipes* to transform data before it is displayed, and *directives* to apply application logic to what gets displayed.\n \n For example, here is a template for the Tutorial's `HeroListComponent`.\n "
        },
        {
            "sha": "1e2fba792de89162ef7dd46209818af3b1936d15",
            "filename": "aio/content/guide/architecture-modules.md",
            "status": "modified",
            "additions": 7,
            "deletions": 7,
            "changes": 14,
            "blob_url": "https://github.com/angular/angular/blob/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Farchitecture-modules.md",
            "raw_url": "https://github.com/angular/angular/raw/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Farchitecture-modules.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Farchitecture-modules.md?ref=4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f",
            "patch": "@@ -1,11 +1,11 @@\n # Introduction to modules\n \n-Angular apps are modular and Angular has its own modularity system called *NgModules*.\n+Angular applications are modular and Angular has its own modularity system called *NgModules*.\n NgModules are containers for a cohesive block of code dedicated to an application domain, a workflow, or a closely related set of capabilities. They can contain components, service providers, and other code files whose scope is defined by the containing NgModule. They can import functionality that is exported from other NgModules, and export selected functionality for use by other NgModules.\n \n-Every Angular app has at least one NgModule class, [the *root module*](guide/bootstrapping), which is conventionally named `AppModule` and resides in a file named `app.module.ts`. You launch your app by *bootstrapping* the root NgModule.\n+Every Angular application has at least one NgModule class, [the *root module*](guide/bootstrapping), which is conventionally named `AppModule` and resides in a file named `app.module.ts`. You launch your application by *bootstrapping* the root NgModule.\n \n-While a small application might have only one NgModule, most apps have many more *feature modules*. The *root* NgModule for an app is so named because it can include child NgModules in a hierarchy of any depth.\n+While a small application might have only one NgModule, most applications have many more *feature modules*. The *root* NgModule for an application is so named because it can include child NgModules in a hierarchy of any depth.\n \n ## NgModule metadata\n \n@@ -17,9 +17,9 @@ An NgModule is defined by a class decorated with `@NgModule()`. The `@NgModule()\n \n * `imports`: Other modules whose exported classes are needed by component templates declared in *this* NgModule.\n \n-* `providers`: Creators of [services](guide/architecture-services) that this NgModule contributes to the global collection of services; they become accessible in all parts of the app. (You can also specify providers at the component level.)\n+* `providers`: Creators of [services](guide/architecture-services) that this NgModule contributes to the global collection of services; they become accessible in all parts of the application. (You can also specify providers at the component level.)\n \n-* `bootstrap`: The main application view, called the *root component*, which hosts all other app views. Only the *root NgModule* should set the `bootstrap` property.\n+* `bootstrap`: The main application view, called the *root component*, which hosts all other application views. Only the *root NgModule* should set the `bootstrap` property.\n \n Here's a simple root NgModule definition.\n \n@@ -53,13 +53,13 @@ When you create a component, it's associated directly with a single view, called\n \n <div class=\"alert is-helpful\">\n \n-**Note:** The hierarchical structure of views is a key factor in the way Angular detects and responds to changes in the DOM and app data.\n+**Note:** The hierarchical structure of views is a key factor in the way Angular detects and responds to changes in the DOM and application data.\n \n </div>\n \n ## NgModules and JavaScript modules\n \n-The NgModule system is different from and unrelated to the JavaScript (ES2015) module system for managing collections of JavaScript objects. These are *complementary* module systems that you can use together to write your apps.\n+The NgModule system is different from and unrelated to the JavaScript (ES2015) module system for managing collections of JavaScript objects. These are *complementary* module systems that you can use together to write your applications.\n \n In JavaScript each *file* is a module and all objects defined in the file belong to that module.\n The module declares some objects to be public by marking them with the `export` key word."
        },
        {
            "sha": "f6c2fb0ae2295fda0d4c983f13721f0139dd21fe",
            "filename": "aio/content/guide/architecture-next-steps.md",
            "status": "modified",
            "additions": 10,
            "deletions": 10,
            "changes": 20,
            "blob_url": "https://github.com/angular/angular/blob/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Farchitecture-next-steps.md",
            "raw_url": "https://github.com/angular/angular/raw/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Farchitecture-next-steps.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Farchitecture-next-steps.md?ref=4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f",
            "patch": "@@ -15,15 +15,15 @@ about the features and tools that can help you develop and deliver Angular appli\n \n * The [NgModules](guide/ngmodules) guide provides in-depth information on the modular structure of an Angular application.\n \n-* The [Routing and navigation](guide/router) guide provides in-depth information on how to construct applications that allow a user to navigate to different [views](guide/glossary#view) within your single-page app.\n+* The [Routing and navigation](guide/router) guide provides in-depth information on how to construct applications that allow a user to navigate to different [views](guide/glossary#view) within your single-page application.\n \n * The [Dependency injection](guide/dependency-injection) guide provides in-depth information on how to construct an application such that each component class can acquire the services and objects it needs to perform its function.\n \n ## Responsive programming\n \n The [template syntax](guide/template-syntax) and related topics contain details about how to display your component data when and where you want it within a view, and how to collect input from users that you can respond to.\n \n-Additional pages and sections describe some basic programming techniques for Angular apps.\n+Additional pages and sections describe some basic programming techniques for Angular applications.\n \n * [Lifecycle hooks](guide/lifecycle-hooks): Tap into key moments in the lifetime of a component, from its creation to its destruction, by implementing the lifecycle hook interfaces.\n \n@@ -38,13 +38,13 @@ without deep knowledge of animation techniques or CSS.\n \n ## Client-server interaction\n \n-Angular provides a framework for single-page apps, where most of the logic and data resides on the client.\n-Most apps still need to access a server using the `HttpClient` to access and save data.\n+Angular provides a framework for single-page applications, where most of the logic and data resides on the client.\n+Most applications still need to access a server using the `HttpClient` to access and save data.\n For some platforms and applications, you might also want to use the PWA (Progressive Web App) model to improve the user experience.\n \n * [HTTP](guide/http): Communicate with a server to get data, save data, and invoke server-side actions with an HTTP client.\n \n-* [Server-side rendering](guide/universal): Angular Universal generates static application pages on the server through server-side rendering (SSR). This allows you to run your Angular app on the server in order to improve performance and show the first page quickly on mobile and low-powered devices, and also facilitate web crawlers.\n+* [Server-side rendering](guide/universal): Angular Universal generates static application pages on the server through server-side rendering (SSR). This allows you to run your Angular application on the server in order to improve performance and show the first page quickly on mobile and low-powered devices, and also facilitate web crawlers.\n \n * [Service workers and PWA](guide/service-worker-intro): Use a service worker to reduce dependency on the network and significantly improve the user experience.\n \n@@ -60,23 +60,23 @@ For some platforms and applications, you might also want to use the PWA (Progres\n \n * [Deployment](guide/deployment): Learn techniques for deploying your Angular application to a remote server.\n \n-* [Security guidelines](guide/security): Learn about Angular's built-in protections against common web-app vulnerabilities and attacks such as cross-site scripting attacks.\n+* [Security guidelines](guide/security): Learn about Angular's built-in protections against common web-application vulnerabilities and attacks such as cross-site scripting attacks.\n \n-* [Internationalization](guide/i18n): Make your app available in multiple languages with Angular's internationalization (i18n) tools.\n+* [Internationalization](guide/i18n): Make your application available in multiple languages with Angular's internationalization (i18n) tools.\n \n-* [Accessibility](guide/accessibility): Make your app accessible to all users.\n+* [Accessibility](guide/accessibility): Make your application accessible to all users.\n \n ## File structure, configuration, and dependencies\n \n * [Workspace and file structure](guide/file-structure): Understand the structure of Angular workspace and project folders.\n \n * [Building and serving](guide/build): Learn to define different build and proxy server configurations for your project, such as development, staging, and production.\n \n-* [npm packages](guide/npm-packages): The Angular Framework, Angular CLI, and components used by Angular applications are packaged as [npm](https://docs.npmjs.com/) packages and distributed via the npm registry. The Angular CLI creates a default `package.json` file, which specifies a starter set of packages that work well together and jointly support many common application scenarios.\n+* [npm packages](guide/npm-packages): The Angular Framework, Angular CLI, and components used by Angular applications are packaged as [npm](https://docs.npmjs.com/) packages and distributed using the npm registry. The Angular CLI creates a default `package.json` file, which specifies a starter set of packages that work well together and jointly support many common application scenarios.\n \n * [TypeScript configuration](guide/typescript-configuration): TypeScript is the primary language for Angular application development.\n \n-* [Browser support](guide/browser-support): Make your apps compatible across a wide range of browsers.\n+* [Browser support](guide/browser-support): Make your applications compatible across a wide range of browsers.\n \n ## Extending Angular\n "
        },
        {
            "sha": "512bf5e54485e1d6b5baf1eedc2e06aa05c54ac6",
            "filename": "aio/content/guide/architecture-services.md",
            "status": "modified",
            "additions": 4,
            "deletions": 4,
            "changes": 8,
            "blob_url": "https://github.com/angular/angular/blob/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Farchitecture-services.md",
            "raw_url": "https://github.com/angular/angular/raw/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Farchitecture-services.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Farchitecture-services.md?ref=4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f",
            "patch": "@@ -1,6 +1,6 @@\n # Introduction to services and dependency injection\n \n-*Service* is a broad category encompassing any value, function, or feature that an app needs.\n+*Service* is a broad category encompassing any value, function, or feature that an application needs.\n A service is typically a class with a narrow, well-defined purpose.\n It should do something specific and do it well.\n \n@@ -17,7 +17,7 @@ A component can delegate certain tasks to services, such as fetching data from t\n validating user input, or logging directly to the console.\n By defining such processing tasks in an *injectable service class*, you make those tasks\n available to any component.\n-You can also make your app more adaptable by injecting different providers of the same kind of service,\n+You can also make your application more adaptable by injecting different providers of the same kind of service,\n as appropriate in different circumstances.\n \n Angular doesn't *enforce* these principles. Angular does help you *follow* these principles\n@@ -50,7 +50,7 @@ Similarly, use the `@Injectable()` decorator to indicate that a component or oth\n \n * A *provider* is an object that tells an injector how to obtain or create a dependency.\n \n-For any dependency that you need in your app, you must register a provider with the app's injector,\n+For any dependency that you need in your app, you must register a provider with the application's injector,\n so that the injector can use the provider to create new instances.\n For a service, the provider is typically the service class itself.\n \n@@ -93,7 +93,7 @@ or in the `@NgModule()` or `@Component()` metadata\n    When you provide the service at the root level, Angular creates a single, shared instance of `HeroService`\n    and injects it into any class that asks for it.\n    Registering the provider in the `@Injectable()` metadata also allows Angular to optimize an app\n-   by removing the service from the compiled app if it isn't used, a process known as *tree-shaking*.\n+   by removing the service from the compiled application if it isn't used, a process known as *tree-shaking*.\n \n * When you register a provider with a [specific NgModule](guide/architecture-modules), the same instance of a service is available to all components in that NgModule. To register at this level, use the `providers` property of the `@NgModule()` decorator.\n "
        },
        {
            "sha": "a64a055a07091b2aaf0eafabed36e7a6529ddb7f",
            "filename": "aio/content/guide/architecture.md",
            "status": "modified",
            "additions": 8,
            "deletions": 8,
            "changes": 16,
            "blob_url": "https://github.com/angular/angular/blob/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Farchitecture.md",
            "raw_url": "https://github.com/angular/angular/raw/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Farchitecture.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Farchitecture.md?ref=4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f",
            "patch": "@@ -2,10 +2,10 @@\n \n Angular is a platform and framework for building single-page client applications using HTML and TypeScript.\n Angular is written in TypeScript.\n-It implements core and optional functionality as a set of TypeScript libraries that you import into your apps.\n+It implements core and optional functionality as a set of TypeScript libraries that you import into your applications.\n \n The architecture of an Angular application relies on certain fundamental concepts.\n-The basic building blocks of the Angular framework are Angular components that are organized into *NgModules*. NgModules collect related code into functional sets; an Angular app is defined by a set of NgModules. An app always has at least a *root module* that enables bootstrapping, and typically has many more *feature modules*.\n+The basic building blocks of the Angular framework are Angular components that are organized into *NgModules*. NgModules collect related code into functional sets; an Angular application is defined by a set of NgModules. An application always has at least a *root module* that enables bootstrapping, and typically has many more *feature modules*.\n \n * Components define *views*, which are sets of screen elements that Angular can choose among and modify according to your program logic and data.\n \n@@ -17,7 +17,7 @@ Modules, components and services are classes that use *decorators*. These decora\n \n * The metadata for a service class provides the information Angular needs to make it available to components through *dependency injection (DI)*.\n \n-An app's components typically define many views, arranged hierarchically. Angular provides the `Router` service to help you define navigation paths among views. The router provides sophisticated in-browser navigational capabilities.\n+An application's components typically define many views, arranged hierarchically. Angular provides the `Router` service to help you define navigation paths among views. The router provides sophisticated in-browser navigational capabilities.\n \n <div class=\"alert is-helpful\">\n \n@@ -27,14 +27,14 @@ An app's components typically define many views, arranged hierarchically. Angula\n \n <div class=\"alert is-helpful\">\n \n-  For the sample app that this page describes, see the <live-example></live-example>.\n+  For the sample application that this page describes, see the <live-example></live-example>.\n </div>\n \n ## Modules\n \n Angular *NgModules* differ from and complement JavaScript (ES2015) modules. An NgModule declares a compilation context for a set of components that is dedicated to an application domain, a workflow, or a closely related set of capabilities. An NgModule can associate its components with related code, such as services, to form functional units.\n \n-Every Angular app has a *root module*, conventionally named `AppModule`, which provides the bootstrap mechanism that launches the application. An app typically contains many functional modules.\n+Every Angular application has a *root module*, conventionally named `AppModule`, which provides the bootstrap mechanism that launches the application. An application typically contains many functional modules.\n \n Like JavaScript modules, NgModules can import functionality from other NgModules, and allow their own functionality to be exported and used by other NgModules. For example, to use the router service in your app, you import the `Router` NgModule.\n \n@@ -66,7 +66,7 @@ A template combines HTML with Angular markup that can modify HTML elements befor\n Template *directives* provide program logic, and *binding markup* connects your application data and the DOM.\n There are two types of data binding:\n \n-* *Event binding* lets your app respond to user input in the target environment by updating your application data.\n+* *Event binding* lets your application respond to user input in the target environment by updating your application data.\n * *Property binding* lets you interpolate values that are computed from your application data into the HTML.\n \n Before a view is displayed, Angular evaluates the directives and resolves the binding syntax in the template to modify the HTML elements and the DOM, according to your program data and logic. Angular supports *two-way data binding*, meaning that changes in the DOM, such as user choices, are also reflected in your program data.\n@@ -98,7 +98,7 @@ For data or logic that isn't associated with a specific view, and that you want\n \n ### Routing\n \n-The Angular `Router` NgModule provides a service that lets you define a navigation path among the different application states and view hierarchies in your app. It is modeled on the familiar browser navigation conventions:\n+The Angular `Router` NgModule provides a service that lets you define a navigation path among the different application states and view hierarchies in your application. It is modeled on the familiar browser navigation conventions:\n \n * Enter a URL in the address bar and the browser navigates to a corresponding page.\n \n@@ -110,7 +110,7 @@ The router maps URL-like paths to views instead of pages. When a user performs a\n \n If the router determines that the current application state requires particular functionality, and the module that defines it hasn't been loaded, the router can *lazy-load* the module on demand.\n \n-The router interprets a link URL according to your app's view navigation rules and data state. You can navigate to new views when the user clicks a button or selects from a drop box, or in response to some other stimulus from any source. The router logs activity in the browser's history, so the back and forward buttons work as well.\n+The router interprets a link URL according to your application's view navigation rules and data state. You can navigate to new views when the user clicks a button or selects from a drop box, or in response to some other stimulus from any source. The router logs activity in the browser's history, so the back and forward buttons work as well.\n \n To define navigation rules, you associate *navigation paths* with your components. A path uses a URL-like syntax that integrates your program data, in much the same way that template syntax integrates your views with your program data. You can then apply program logic to choose which views to show or to hide, in response to user input and your own access rules.\n "
        },
        {
            "sha": "204c705a642e5c605bd700caf6760bb06b6b8dd6",
            "filename": "aio/content/guide/browser-support.md",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/angular/angular/blob/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Fbrowser-support.md",
            "raw_url": "https://github.com/angular/angular/raw/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Fbrowser-support.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fbrowser-support.md?ref=4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f",
            "patch": "@@ -103,7 +103,7 @@ For example, if you need the optional [web animations polyfill](https://caniuse.\n </code-example>\n \n You can then add the import statement in the `src/polyfills.ts` file.\n-For many polyfills, you can simply un-comment the corresponding `import` statement in the file, as in the following example.\n+For many polyfills, you can un-comment the corresponding `import` statement in the file, as in the following example.\n \n <code-example header=\"src/polyfills.ts\">\n   /**"
        },
        {
            "sha": "1585b02ac200ff8156bed3667b7a8b781b6db4f3",
            "filename": "aio/content/guide/file-structure.md",
            "status": "modified",
            "additions": 4,
            "deletions": 4,
            "changes": 8,
            "blob_url": "https://github.com/angular/angular/blob/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Ffile-structure.md",
            "raw_url": "https://github.com/angular/angular/raw/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Ffile-structure.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Ffile-structure.md?ref=4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f",
            "patch": "@@ -34,7 +34,7 @@ The top level of the workspace contains workspace-wide configuration files, conf\n | :--------------------- | :------------------------------------------|\n | `.editorconfig`        | Configuration for code editors. See [EditorConfig](https://editorconfig.org/). |\n | `.gitignore`           | Specifies intentionally untracked files that [Git](https://git-scm.com/) should ignore. |\n-| `README.md`            | Introductory documentation for the root app. |\n+| `README.md`            | Introductory documentation for the root application. |\n | `angular.json`         | CLI configuration defaults for all projects in the workspace, including configuration options for build, serve, and test tools that the CLI uses, such as [TSLint](https://palantir.github.io/tslint/), [Karma](https://karma-runner.github.io/), and [Protractor](https://www.protractortest.org/). For details, see [Angular Workspace Configuration](guide/workspace-config). |\n | `package.json`          | Configures [npm package dependencies](guide/npm-packages) that are available to all projects in the workspace. See [npm documentation](https://docs.npmjs.com/files/package.json) for the specific format and contents of this file. |\n | `package-lock.json`     | Provides version information for all packages installed into `node_modules` by the npm client. See [npm documentation](https://docs.npmjs.com/files/package-lock.json) for details. If you use the yarn client, this file will be [yarn.lock](https://yarnpkg.com/lang/en/docs/yarn-lock/) instead. |\n@@ -54,7 +54,7 @@ This initial root-level application is the *default app* for CLI commands (unles\n \n <div class=\"alert is-helpful\">\n \n-   Besides using the CLI on the command line, you can also manipulate files directly in the app's source folder and configuration files.\n+   Besides using the CLI on the command line, you can also manipulate files directly in the application's source folder and configuration files.\n \n </div>\n \n@@ -90,7 +90,7 @@ Angular components, templates, and styles go here.\n \n | `src/app/` FILES | PURPOSE |\n | :-------------------------- | :------------------------------------------|\n-| `app/app.component.ts`      | Defines the logic for the app's root component, named `AppComponent`. The view associated with this root component becomes the root of the [view hierarchy](guide/glossary#view-hierarchy) as you add components and services to your application. |\n+| `app/app.component.ts`      | Defines the logic for the application's root component, named `AppComponent`. The view associated with this root component becomes the root of the [view hierarchy](guide/glossary#view-hierarchy) as you add components and services to your application. |\n | `app/app.component.html`    | Defines the HTML template associated with the root `AppComponent`. |\n | `app/app.component.css`     | Defines the base CSS stylesheet for the root `AppComponent`. |\n | `app/app.component.spec.ts` | Defines a unit test for the root `AppComponent`. |\n@@ -141,7 +141,7 @@ The following command creates a workspace with all of the workspace-wide configu\n ng new my-workspace --create-application false\n </code-example>\n \n-You can then generate apps and libraries with names that are unique within the workspace.\n+You can then generate applications and libraries with names that are unique within the workspace.\n \n <code-example language=\"bash\">\n cd my-workspace"
        },
        {
            "sha": "12d1bb8aaa3f0b0aa09ba0748e51c500890d1588",
            "filename": "aio/content/guide/npm-packages.md",
            "status": "modified",
            "additions": 6,
            "deletions": 6,
            "changes": 12,
            "blob_url": "https://github.com/angular/angular/blob/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Fnpm-packages.md",
            "raw_url": "https://github.com/angular/angular/raw/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Fnpm-packages.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fnpm-packages.md?ref=4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f",
            "patch": "@@ -1,6 +1,6 @@\n # Workspace npm dependencies\n \n-The Angular Framework, Angular CLI, and components used by Angular applications are packaged as [npm packages](https://docs.npmjs.com/getting-started/what-is-npm \"What is npm?\") and distributed via the [npm registry](https://docs.npmjs.com/).\n+The Angular Framework, Angular CLI, and components used by Angular applications are packaged as [npm packages](https://docs.npmjs.com/getting-started/what-is-npm \"What is npm?\") and distributed using the [npm registry](https://docs.npmjs.com/).\n \n You can download and install these npm packages by using the [npm CLI client](https://docs.npmjs.com/cli/install), which is installed with and runs as a [Node.js®](https://nodejs.org \"Nodejs.org\") application. By default, the Angular CLI uses the npm client.\n \n@@ -21,7 +21,7 @@ If you already have projects running on your machine that use other versions of\n Both `npm` and `yarn` install the packages that are identified in a [`package.json`](https://docs.npmjs.com/files/package.json) file.\n \n The CLI command `ng new` creates a `package.json` file when it creates the new workspace.\n-This `package.json` is used by all projects in the workspace, including the initial app project that is created by the CLI when it creates the workspace.\n+This `package.json` is used by all projects in the workspace, including the initial application project that is created by the CLI when it creates the workspace.\n \n Initially, this `package.json` includes _a starter set of packages_, some of which are required by Angular and others that support common application scenarios.\n You add packages to `package.json` as your application evolves.\n@@ -48,7 +48,7 @@ The `dependencies` section of `package.json` contains:\n \n * [**Angular packages**](#angular-packages): Angular core and optional modules; their package names begin `@angular/`.\n \n-* [**Support packages**](#support-packages): 3rd party libraries that must be present for Angular apps to run.\n+* [**Support packages**](#support-packages): 3rd party libraries that must be present for Angular applications to run.\n \n * [**Polyfill packages**](#polyfills): Polyfills plug gaps in a browser's JavaScript implementation.\n \n@@ -64,12 +64,12 @@ Package name                               | Description\n ----------------------------------------   | --------------------------------------------------\n [**@angular/animations**](api/animations) | Angular's animations library makes it easy to define and apply animation effects such as page and list transitions. For more information, see the [Animations guide](guide/animations).\n [**@angular/common**](api/common) | The commonly-needed services, pipes, and directives provided by the Angular team. The [`HttpClientModule`](api/common/http/HttpClientModule) is also here, in the [`@angular/common/http`](api/common/http) subfolder. For more information, see the [HttpClient guide](guide/http).\n-**@angular/compiler** | Angular's template compiler. It understands templates and can convert them to code that makes the application run and render. Typically you don’t interact with the compiler directly; rather, you use it indirectly via `platform-browser-dynamic` when JIT compiling in the browser. For more information, see the [Ahead-of-time Compilation guide](guide/aot-compiler).\n+**@angular/compiler** | Angular's template compiler. It understands templates and can convert them to code that makes the application run and render. Typically you don’t interact with the compiler directly; rather, you use it indirectly using `platform-browser-dynamic` when JIT compiling in the browser. For more information, see the [Ahead-of-time Compilation guide](guide/aot-compiler).\n [**@angular/core**](api/core) | Critical runtime parts of the framework that are needed by every application. Includes all metadata decorators, `Component`, `Directive`,  dependency injection, and the component lifecycle hooks.\n [**@angular/forms**](api/forms) | Support for both [template-driven](guide/forms) and [reactive forms](guide/reactive-forms). For information about choosing the best forms approach for your app, see [Introduction to forms](guide/forms-overview).\n [**@angular/<br />platform&#8209;browser**](api/platform-browser) | Everything DOM and browser related, especially the pieces that help render into the DOM. This package also includes the `bootstrapModuleFactory()` method for bootstrapping applications for production builds that pre-compile with [AOT](guide/aot-compiler).\n-[**@angular/<br />platform&#8209;browser&#8209;dynamic**](api/platform-browser-dynamic) | Includes [providers](api/core/Provider) and methods to compile and run the app on the client using the [JIT compiler](guide/aot-compiler).\n-[**@angular/router**](api/router) | The router module navigates among your app pages when the browser URL changes. For more information, see [Routing and Navigation](guide/router).\n+[**@angular/<br />platform&#8209;browser&#8209;dynamic**](api/platform-browser-dynamic) | Includes [providers](api/core/Provider) and methods to compile and run the application on the client using the [JIT compiler](guide/aot-compiler).\n+[**@angular/router**](api/router) | The router module navigates among your application pages when the browser URL changes. For more information, see [Routing and Navigation](guide/router).\n \n \n {@a support-packages}"
        },
        {
            "sha": "bc7b19b51dbfa3ee2a4385b56caf59e2263dff79",
            "filename": "aio/content/guide/typescript-configuration.md",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/angular/angular/blob/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Ftypescript-configuration.md",
            "raw_url": "https://github.com/angular/angular/raw/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Ftypescript-configuration.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Ftypescript-configuration.md?ref=4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f",
            "patch": "@@ -138,7 +138,7 @@ Many libraries&mdash;jQuery, Jasmine, and Lodash among them&mdash;do *not* inclu\n Fortunately, either their authors or community contributors have created separate `d.ts` files for these libraries and\n published them in well-known locations.\n \n-You can install these typings via `npm` using the\n+You can install these typings with `npm` using the\n [`@types/*` scoped package](https://www.typescriptlang.org/docs/handbook/declaration-files/consumption.html)\n and Typescript, starting at 2.0, automatically recognizes them.\n "
        },
        {
            "sha": "305fbc3f0dfa2f9f0d840ced1ec705054f4e1916",
            "filename": "aio/content/guide/workspace-config.md",
            "status": "modified",
            "additions": 10,
            "deletions": 10,
            "changes": 20,
            "blob_url": "https://github.com/angular/angular/blob/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Fworkspace-config.md",
            "raw_url": "https://github.com/angular/angular/raw/4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f/aio%2Fcontent%2Fguide%2Fworkspace-config.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fworkspace-config.md?ref=4cd2cc439d4fcb8e7c8312b51debfddf0475cd5f",
            "patch": "@@ -11,11 +11,11 @@ The following properties, at the top level of the file, configure the workspace.\n \n * `version`: The configuration-file version.\n * `newProjectRoot`: Path where new projects are created. Absolute or relative to the workspace folder.\n-* `defaultProject`: Default project name to use in commands, where not provided as an argument. When you use `ng new` to create a new app in a new workspace, that app is the default project for the workspace until you change it here.\n+* `defaultProject`: Default project name to use in commands, where not provided as an argument. When you use `ng new` to create a new application in a new workspace, that application is the default project for the workspace until you change it here.\n * `schematics` : A set of [schematics](guide/glossary#schematic) that customize the `ng generate` sub-command option defaults for this workspace. See [Generation schematics](#schematics) below.\n * `projects` : Contains a subsection for each project (library or application) in the workspace, with the per-project configuration options.\n \n-The initial app that you create with `ng new app_name` is listed under \"projects\":\n+The initial application that you create with `ng new app_name` is listed under \"projects\":\n \n <code-example language=\"json\">\n \n@@ -33,7 +33,7 @@ When you create a library project with `ng generate library`, the library projec\n <div class=\"alert is-helpful\">\n \n   Note that the `projects` section of the configuration file does not correspond exactly to the workspace file structure.\n-  * The initial app created by `ng new` is at the top level of the workspace file structure.\n+  * The initial application created by `ng new` is at the top level of the workspace file structure.\n   * Additional applications and libraries go into a `projects` folder in the workspace.\n \n   For more information, see [Workspace and project file structure](guide/file-structure).\n@@ -62,7 +62,7 @@ The following top-level configuration properties are available for each project,\n | `root`          | The root folder for this project's files, relative to the workspace folder. Empty for the initial app, which resides at the top level of the workspace. |\n | `sourceRoot`    | The root folder for this project's source files. |\n | `projectType`   | One of \"application\" or \"library\". An application can run independently in a browser, while a library cannot.|\n-| `prefix`        | A string that Angular prepends to generated selectors. Can be customized to identify an app or feature area. |\n+| `prefix`        | A string that Angular prepends to generated selectors. Can be customized to identify an application or feature area. |\n | `schematics`    | A set of schematics that customize the `ng generate` sub-command option defaults for this project. See [Generation schematics](#schematics) below.  |\n | `architect`     | Configuration defaults for Architect builder targets for this project. |\n \n@@ -134,19 +134,19 @@ See the example in [Build target](#build-target) below.\n * The `architect/build` section configures defaults for options of the `ng build` command.\n See [Build target](#build-target) below for more information.\n \n-* The `architect/serve` section overrides build defaults and supplies additional serve defaults for the `ng serve` command. In addition to the options available for the `ng build` command, it adds options related to serving the app.\n+* The `architect/serve` section overrides build defaults and supplies additional serve defaults for the `ng serve` command. In addition to the options available for the `ng build` command, it adds options related to serving the application.\n \n-* The `architect/e2e` section overrides build-option defaults for building end-to-end testing apps using the `ng e2e` command.\n+* The `architect/e2e` section overrides build-option defaults for building end-to-end testing applications using the `ng e2e` command.\n \n * The `architect/test` section overrides build-option defaults for test builds and supplies additional test-running defaults for the `ng test` command.\n \n * The `architect/lint` section configures defaults for options of the `ng lint` command, which performs code analysis on project source files. The default linting tool for Angular is [TSLint](https://palantir.github.io/tslint/).\n \n * The `architect/extract-i18n` section configures defaults for options of the `ng extract-i18n` command, which extracts marked message strings from source code and outputs translation files.\n \n-* The `architect/server` section configures defaults for creating a Universal app with server-side rendering, using the `ng run <project>:server` command.\n+* The `architect/server` section configures defaults for creating a Universal application with server-side rendering, using the `ng run <project>:server` command.\n \n-* The `architect/app-shell` section configures defaults for creating an app shell for a progressive web app (PWA), using the `ng run <project>:app-shell` command.\n+* The `architect/app-shell` section configures defaults for creating an application shell for a progressive web application (PWA), using the `ng run <project>:app-shell` command.\n \n In general, the options for which you can configure defaults correspond to the command options listed in the [CLI reference page](cli) for each command.\n Note that all options in the configuration file must use [camelCase](guide/glossary#case-conventions), rather than dash-case.\n@@ -174,7 +174,7 @@ Angular CLI comes with two build configurations: `production` and `development`.\n * Removing comments and dead code\n * Rewriting code to use short, mangled names (minification)\n \n-You can define and name additional alternate configurations (such as `stage`, for instance) appropriate to your development process. Some examples of different build configurations are `stable`, `archive` and `next` used by AIO itself, and the individual locale-specific configurations required for building localized versions of an app. For details, see [Internationalization (i18n)](guide/i18n#merge-aot).\n+You can define and name additional alternate configurations (such as `stage`, for instance) appropriate to your development process. Some examples of different build configurations are `stable`, `archive` and `next` used by AIO itself, and the individual locale-specific configurations required for building localized versions of an application. For details, see [Internationalization (i18n)](guide/i18n#merge-aot).\n \n You can select an alternate configuration by passing its name to the `--configuration` command line flag.\n \n@@ -194,7 +194,7 @@ Some additional options can only be set through the configuration file, either b\n | `styles`                   | An array of style files to add to the global context of the project. Angular CLI supports CSS imports and all major CSS preprocessors: [sass/scss](https://sass-lang.com/), [less](http://lesscss.org/), and [stylus](https://stylus-lang.com/). See more in [Styles and scripts configuration](#style-script-config) below. |\n | `stylePreprocessorOptions` | An object containing option-value pairs to pass to style preprocessors. See more in [Styles and scripts configuration](#style-script-config) below. |\n | `scripts`                  | An object containing JavaScript script files to add to the global context of the project. The scripts are loaded exactly as if you had added them in a `<script>` tag inside `index.html`. See more in [Styles and scripts configuration](#style-script-config) below. |\n-| `budgets`                  | Default size-budget type and threshholds for all or parts of your app. You can configure the builder to report a warning or an error when the output reaches or exceeds a threshold size. See [Configure size budgets](guide/build#configure-size-budgets). (Not available in `test` section.) |\n+| `budgets`                  | Default size-budget type and threshholds for all or parts of your application. You can configure the builder to report a warning or an error when the output reaches or exceeds a threshold size. See [Configure size budgets](guide/build#configure-size-budgets). (Not available in `test` section.) |\n | `fileReplacements`         | An object containing files and their compile-time replacements. See more in [Configure target-specific file replacements](guide/build#configure-target-specific-file-replacements).|\n \n {@a complex-config}"
        }
    ],
    "stats": {
        "total": 110,
        "additions": 55,
        "deletions": 55
    }
}