{
    "author": "alxhub",
    "message": "docs: initial commit of Angular Package Format documentation (#43987)\n\nThis commit adds the Angular Package Format to AIO. Previously this document\nwas updated and versioned in Google Docs.\n\nThe document is also updated for the Angular Package Format version 13.\n\nPR Close #43987",
    "sha": "509b14536abe5c8ab086a8be2e1fb7d4c70035a0",
    "files": [
        {
            "sha": "582f22c5903d21e520edf5be0f8ffc0b664ebb32",
            "filename": ".pullapprove.yml",
            "status": "modified",
            "additions": 3,
            "deletions": 1,
            "changes": 4,
            "blob_url": "https://github.com/angular/angular/blob/509b14536abe5c8ab086a8be2e1fb7d4c70035a0/.pullapprove.yml",
            "raw_url": "https://github.com/angular/angular/raw/509b14536abe5c8ab086a8be2e1fb7d4c70035a0/.pullapprove.yml",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/.pullapprove.yml?ref=509b14536abe5c8ab086a8be2e1fb7d4c70035a0",
            "patch": "@@ -1091,7 +1091,8 @@ groups:\n         contains_any_globs(files, [\n           'aio/content/guide/creating-libraries.md',\n           'aio/content/guide/libraries.md',\n-          'aio/content/guide/using-libraries.md'\n+          'aio/content/guide/using-libraries.md',\n+          'aio/content/guide/angular-package-format.md'\n           ])\n     reviewers:\n       users:\n@@ -1223,6 +1224,7 @@ groups:\n         contains_any_globs(files.exclude(\"goldens/public-api/manage.js\"), [\n           'goldens/public-api/**',\n           'docs/NAMING.md',\n+          'aio/content/guide/angular-package-format.md',\n           'aio/content/errors/*.md',\n           'aio/content/guide/glossary.md',\n           'aio/content/guide/styleguide.md',"
        },
        {
            "sha": "9f1bee1f982f1c2302515c8eccbce839d98a05d6",
            "filename": "aio/content/guide/angular-package-format.md",
            "status": "added",
            "additions": 366,
            "deletions": 0,
            "changes": 366,
            "blob_url": "https://github.com/angular/angular/blob/509b14536abe5c8ab086a8be2e1fb7d4c70035a0/aio%2Fcontent%2Fguide%2Fangular-package-format.md",
            "raw_url": "https://github.com/angular/angular/raw/509b14536abe5c8ab086a8be2e1fb7d4c70035a0/aio%2Fcontent%2Fguide%2Fangular-package-format.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fangular-package-format.md?ref=509b14536abe5c8ab086a8be2e1fb7d4c70035a0",
            "patch": "@@ -0,0 +1,366 @@\n+# Angular Package Format\n+\n+This document describes the Angular Package Format (APF).\n+APF is an Angular specific specification for the structure and format of npm packages that is used by all first-party Angular packages (`@angular/core`, `@angular/material`, etc.) and most third-party Angular libraries.\n+\n+APF enables a package to work seamlessly under most common scenarios that use Angular.\n+Packages that use APF are compatible with the tooling offered by the Angular team as well as wider JavaScript ecosystem.\n+It is recommended that third-party library developers follow the same npm package format.\n+\n+<div class=\"alert is-helpful\">\n+\n+APF is versioned along with the rest of Angular, and every major version improves the package format.\n+You can find the versions of the specification prior to v13 in this [google doc](https://docs.google.com/document/d/1CZC2rcpxffTDfRDs6p1cfbmKNLA6x5O-NtkJglDaBVs/preview).\n+\n+</div>\n+\n+## Why specify a package format?\n+\n+In today's JavaScript landscape, developers will consume packages in many different ways, using many different toolchains (Webpack, rollup, esbuild, etc). These tools may understand and require different inputs - some tools may be able to process the latest ES language version, while others may benefit from directly consuming an older ES version.\n+\n+The Angular distribution format supports all of the commonly used development tools and workflows, and adds emphasis on optimizations that result either in smaller application payload size or faster development iteration cycle (build time).\n+\n+Developers can rely on Angular CLI and [ng-packagr](https://github.com/ng-packagr/ng-packagr) (a build tool Angular CLI uses) to produce packages in the Angular package format. See the [Creating Libraries](/guide/creating-libraries) guide for more details.\n+\n+## File layout\n+\n+The following example shows a simplified version of the `@angular/core` package's file layout, with an explanation for each file in the package. This table describes the file layout under `node_modules/@angular/core` annotated to describe the purpose of files and directories:\n+\n+<style>\n+  table tbody>tr>td {\n+    padding: 8px;\n+    vertical-align: middle;\n+    line-height: normal;\n+  }\n+</style>\n+\n+<table>\n+<tbody>\n+<tr>\n+<td><pre>README.md</pre>\n+<td>Package README, used by npmjs web UI</td>\n+</tr>\n+<tr>\n+<td><pre>package.json</pre></td>\n+<td>Primary package.json, describing the package itself as well as all available entrypoints and code formats. This file contains the \"exports\" mapping used by runtimes and tools to perform module resolution.</td>\n+</tr>\n+<tr>\n+<td><pre>core.d.ts</pre></td>\n+<td>Bundled .d.ts for the primary entrypoint (@angular/core)</td>\n+</tr>\n+<tr>\n+<td><pre>esm2020/\n+  core.mjs\n+  index.mjs\n+  public_api.mjs</pre></td>\n+<td>Tree of @angular/core's sources in unflattened ES2020 format.</td>\n+</tr>\n+<tr>\n+<td><pre>esm2020/testing/</pre></td>\n+<td>Tree of the @angular/core/testing entrypoint in unflattened ES2020 format.</td>\n+</tr>\n+<tr>\n+<td><pre>fesm2015/\n+  core.mjs\n+  core.mjs.map\n+  testing.mjs\n+  testing.mjs.map</pre></td>\n+<td>Code for all entrypoints in a flattened (FESM) ES2015 format, along with sourcemaps.</td>\n+</tr>\n+<tr>\n+<td><pre>fesm2020/\n+  core.mjs\n+  core.mjs.map\n+  testing.mjs\n+  testing.mjs.map</pre></td>\n+<td>Code for all entrypoints in flattened (FESM) ES2020 format, along with sourcemaps.</td>\n+</tr>\n+<tr>\n+<td><pre>testing/</pre></td>\n+<td>Directory representing the \"testing\" entrypoint.</td>\n+</tr>\n+<tr>\n+<td><pre>testing/package.json</pre></td>\n+<td>Defines the @angular/core/testing entrypoint with its typings for TypeScript, which does not support the top level \"exports\" based module resolution.</td>\n+</tr>\n+<tr>\n+<td><pre>testing/testing.d.ts</pre></td>\n+<td>Actual .d.ts for the @angular/core/testing entrypoint</td>\n+</tr>\n+</tbody>\n+</table>\n+\n+## `package.json`\n+\n+The primary `package.json` contains important package metadata, including the following:\n+\n+* It [declares](#esm-declaration) the package to be in EcmaScript Module (ESM) format.\n+* It contains an [`\"exports\"` field](#exports) which defines the available source code formats of all entrypoints.\n+* It contains [keys](#legacy-resolution-keys) which define the available source code formats of the primary `@angular/core` entrypoint, for tools which do not understand `\"exports\"`. These keys are considered deprecated, and will be removed as the support for `\"exports\"` rolls out across the ecosystem.\n+* It declares whether the package contains [side-effects](#side-effects).\n+\n+### ESM declaration\n+\n+The top-level `package.json` contains the key:\n+\n+<code-example language=\"js\">\n+{\n+  \"type\": \"module\"\n+}\n+</code-example>\n+\n+This informs resolvers that code within the package is using EcmaScript Modules as opposed to CommonJS modules.\n+\n+### `\"exports\"`\n+\n+The `\"exports\"` field has the following structure:\n+\n+<code-example language=\"js\">\n+\"exports\": {\n+  \"./schematics/*\": {\n+    \"default\": \"./schematics/*.js\"\n+  },\n+  \"./package.json\": {\n+    \"default\": \"./package.json\"\n+  },\n+  \".\": {\n+    \"types\": \"./core.d.ts\",\n+    \"esm2020\": \"./esm2020/core.mjs\",\n+    \"es2020\": \"./fesm2020/core.mjs\",\n+    \"es2015\": \"./fesm2015/core.mjs\",\n+    \"node\": \"./fesm2015/core.mjs\",\n+    \"default\": \"./fesm2020/core.mjs\"\n+  },\n+  \"./testing\": {\n+    \"types\": \"./testing/testing.d.ts\",\n+    \"esm2020\": \"./esm2020/testing/testing.mjs\",\n+    \"es2020\": \"./fesm2020/testing.mjs\",\n+    \"es2015\": \"./fesm2015/testing.mjs\",\n+    \"node\": \"./fesm2015/testing.mjs\",\n+    \"default\": \"./fesm2020/testing.mjs\"\n+  }\n+}\n+</code-example>\n+\n+Of primary interest are the `\".\"` and the `\"./testing\"` keys, which define the available code formats for the `@angular/core` primary entrypoint and the `@angular/core/testing` secondary entrypoint, respectively. For each entrypoint, the available formats are:\n+\n+* Typings (`.d.ts` files)\n+`.d.ts` files are used by TypeScript when depending on a given package.\n+* `es2020` - ES2020 code flattened into a single source file.\n+* `es2015` - ES2015 code flattened into a single source file.\n+* `esm2020` - ES2020 code in unflattened source files (this format is included for experimentation - see [this discussion of defaults](#note-about-the-defaults-in-packagejson) for details).\n+\n+Tooling that is aware of these keys may preferentially select a desirable code format from `\"exports\"`. The remaining 2 keys control the default behavior of tooling:\n+\n+* `\"node\"` selects flattened ES2015 code when the package is loaded in Node.\n+\n+    This format is used due to the requirements of `zone.js`, which does not support native `async`/`await` ES2017 syntax. Therefore, Node is instructed to use ES2015 code, where `async`/`await` structures have been downleveled into Promises.\n+\n+* `\"default\"` selects flattened ES2020 code for all other consumers.\n+\n+### Legacy resolution keys\n+\n+In addition to `\"exports\"`, the top-level `package.json` also defines legacy module resolution keys for resolvers that don't support `\"exports\"`. For `@angular/core` these are:\n+\n+<code-example language=\"js\">\n+{\n+  \"fesm2020\": \"./fesm2020/core.mjs\",\n+  \"fesm2015\": \"./fesm2015/core.mjs\",\n+  \"esm2020\": \"./esm2020/core.mjs\",\n+  \"typings\": \"./core.d.ts\",\n+  \"module\": \"./fesm2015/core.mjs\",\n+  \"es2020\": \"./fesm2020/core.mjs\",\n+}\n+</code-example>\n+\n+As above, a module resolver can use these keys to load a specific code format. Note that instead of `\"default\"`, `\"module\"` selects the format both for Node as well as any tooling not configured to use a specific key. As with `\"node\"`, ES2015 code is selected due to the constraints of ZoneJS.\n+\n+### Side effects\n+\n+The last function of `package.json` is to declare whether the package has [side-effects](#sideeffects-flag).\n+\n+<code-example language=\"js\">\n+{\n+  \"sideEffects\": false\n+}\n+</code-example>\n+\n+Most Angular packages should not depend on top-level side effects, and thus should include this declaration.\n+\n+### Secondary `package.json`s\n+\n+In addition to the top-level `package.json`, secondary entrypoints have a corresponding directory with its own `package.json`. For example, in `@angular/core` the `@angular/core/testing` entrypoint is represented by `testing/package.json`.\n+\n+This secondary `package.json` is required for legacy resolvers which do not support `\"exports\"`. We expect these files to be removed in a future version of the Angular Package Format, once support for `\"exports\"` is consistent across the ecosystem.\n+\n+## Entrypoints and Code Splitting\n+\n+Packages in the Angular Package Format contain one primary entrypoint and zero or more secondary entrypoints (e.g. `@angular/common/http`). Entrypoints serve several functions.\n+\n+1. They define the module specifiers from which users import code (for example, `@angular/core` and `@angular/core/testing`).\n+\n+Users typically perceive these entrypoints as distinct groups of symbols, with different purposes or functionality.\n+\n+Specific entrypoints might only be used for special purposes, such as testing. Such APIs can be separated out from the primary entrypoint to reduce the chance of them being used accidentally or incorrectly.\n+\n+2. They define the granularity at which code can be lazily loaded.\n+\n+Many modern build tools are only capable of \"code splitting\" (aka lazy loading) at the ES Module level. Since the Angular Package Format uses primarily a single \"flat\" ES Module per entrypoint, this means that most build tooling will not be able to split code in a single entrypoint into multiple output chunks.\n+\n+The general rule for APF packages is to use entrypoints for the smallest sets of logically connected code possible. For example, the Angular Material package publishes each logical component or set of components as a separate entrypoint - one for Button, one for Tabs, etc. This allows each Material component to be lazily loaded separately, if desired.\n+\n+Not all libraries require such granularity. Most libraries with a single logical purpose should be published as a single entrypoint. `@angular/core` for example uses a single entrypoint for the runtime, because the Angular runtime is generally used as a single entity.\n+\n+### Resolution of Secondary Entrypoints\n+\n+Secondary entrypoints may be resolved by tooling in one of two ways:\n+\n+* via the `\"exports\"` field of the primary `package.json` for the package\n+* by Node Module Resolution rules, via a `package.json` in a subdirectory corresponding to the entrypoint's module ID. For example, the `testing/package.json` file for the `@angular/core/testing` secondary entrypoint.\n+\n+## README.md\n+\n+The readme file in the markdown format that is used to display description of a package on npm and github.\n+\n+Example readme content of @angular/core package:\n+\n+<code-example language=\"html\">\n+Angular\n+=======\n+\n+The sources for this package are in the main [Angular](https://github.com/angular/angular) repo. Please file issues and pull requests against that repo.\n+\n+License: MIT\n+</code-example>\n+\n+## Partial Compilation\n+\n+Libraries in the Angular Package Format must be published in \"partial compilation\" mode. This is a compilation mode for `ngc` which produces compiled Angular code that is not tied to a specific Angular runtime version, in contrast to the full compilation used for applications, where the Angular compiler and runtime versions must match exactly.\n+\n+To partially compile Angular code, use the `\"compilationMode\"` flag in `\"angularCompilerOptions\"` in your `tsconfig.json`:\n+\n+<code-example language=\"js\">\n+{\n+  ...\n+  \"angularCompilerOptions\": {\n+    \"compilationMode\": \"partial\",\n+  }\n+}\n+</code-example>\n+\n+Partially compiled library code is then converted to fully compiled code during the application build process by the Angular CLI.\n+\n+If your build pipeline does not use the Angular CLI then refer to the [Consuming partial ivy code outside the Angular CLI](/guide/creating-libraries#consuming-partial-ivy-code-outside-the-angular-cli) guide.\n+\n+## Optimizations\n+\n+### Flattening of ES Modules\n+\n+The Angular Package Format specifies that code be published in \"flattened\" ES module format. This significantly reduces the build time of Angular applications as well as download and parse time of the final application bundle. Please check out the excellent post [\"The cost of small modules\"](https://nolanlawson.com/2016/08/15/the-cost-of-small-modules/) by Nolan Lawson.\n+\n+The Angular compiler has support for generating index ES module files that can then be used to generate flattened modules using tools like Rollup, resulting in a file format we call Flattened ES Module or FESM.\n+\n+FESM is a file format created by flattening all ES Modules accessible from an entrypoint into a single ES Module. It’s formed by following all imports from a package and copying that code into a single file while preserving all public ES exports and removing all private imports.\n+\n+The shortened name “FESM” (pronounced “phesom”) can have a number after it such as “FESM5” or “FESM2015”. The number refers to the language level of the JavaScript inside the module. So a FESM5 file would be ESM+ES5 (import/export statements and ES5 source code).\n+\n+To generate a flattened ES Module index file, use the following configuration options in your tsconfig.json file:\n+\n+<code-example language=\"js\">\n+{\n+  \"compilerOptions\": {\n+    ...\n+    \"module\": \"esnext\",\n+    \"target\": \"es2020\",\n+    ...\n+  },\n+  \"angularCompilerOptions\": {\n+    ...\n+    \"flatModuleOutFile\": \"my-ui-lib.js\",\n+    \"flatModuleId\": \"my-ui-lib\"\n+  }\n+}\n+</code-example>\n+\n+Once the index file (e.g. `my-ui-lib.js`) is generated by ngc, bundlers and optimizers like Rollup can be used to produce the flattened ESM file.\n+\n+#### Note about the defaults in package.json\n+\n+As of webpack v4 the flattening of ES modules optimization should not be necessary for webpack users, and in fact theoretically we should be able to get better code-splitting without flattening of modules in webpack. In practice we still see size regressions when using unflattened modules as input for webpack v4. This is why `\"module\"` and `\"es2020\"` package.json entries still point to fesm files. We are investigating this issue and expect that we'll switch the `\"module\"` and `\"es2020\"` package.json entry points to unflattened files when the size regression issue is resolved. The APF currently includes unflattened ESM2020 code for the purpose of validating such a future change.\n+\n+### \"sideEffects\" flag\n+\n+By default, EcmaScript Modules are side-effectful: importing from a module ensures that any code at the top level of that module will execute. This is often undesirable, as most side-effectful code in typical modules is not truly side-effectful, but instead only affects specific symbols. If those symbols are not imported and used, it's often desirable to remove them in an optimization process known as tree-shaking, and the side-effectful code can prevent this.\n+\n+Build tools such as Webpack support a flag which allows ackages to declare that they do not depend on side-effectful code at the top level of their modules, giving the tools more freedom to tree-shake code from the package. The end result of these optimizations should be smaller bundle size and better code distribution in bundle chunks after code-splitting. This optimization can break your code if it contains non-local side-effects - this is however not common in Angular applications and it's usually a sign of bad design. Our recommendation is for all packages to claim the side-effect free status by setting the `sideEffects` property to `false`, and that developers follow the [Angular Style Guide](https://angular.io/guide/styleguide) which naturally results in code without non-local side-effects.\n+\n+More info: [webpack docs on side-effects](https://github.com/webpack/webpack/tree/master/examples/side-effects)\n+ \n+### ES2020 Language Level\n+\n+ES2020 Language level is now the default language level that is consumed by Angular CLI and other tooling. The Angular CLI will downlevel the bundle to a language level that is supported by all targeted browsers at application build time.\n+\n+### d.ts bundling / type definition flattening\n+\n+As of APF v8 we now prefer to run [API Extractor](https://api-extractor.com/), to bundle TypeScript definitions so that the entire API appears in a single file.\n+\n+In prior APF versions each entry point would have a `src` directory next to the .d.ts entry point and this directory contained individual d.ts files matching the structure of the original source code. While this distribution format is still allowed and supported, it is highly discouraged because it confuses tools like IDEs that then offer incorrect autocompletion, and allows users to depend on deep-import paths which are typically not considered to be public API of a library or a package.\n+\n+### Tslib\n+\n+As of APF v10, we recommend adding tslib as a direct dependency of your primary entry-point. This is because the tslib version is tied to the TypeScript version used to compile your library.\n+\n+## Examples\n+\n+* [@angular/core package](https://unpkg.com/browse/@angular/core@13.0.0-rc.0/)\n+* [@angular/material package](https://unpkg.com/browse/@angular/material@13.0.0-rc.0/)\n+\n+## Definition of Terms\n+\n+The following terms are used throughout this document very intentionally. In this section we define all of them to provide additional clarity.\n+\n+<style>\n+dt {\n+  font-size: larger;\n+  font-weight: bold;\n+  padding: 16px 0px;\n+}\n+</style>\n+\n+<dl>\n+<dt>Package</dt>\n+<dd>The smallest set of files that are published to NPM and installed together, for example @angular/core. This package includes a manifest called package.json, compiled source code, typescript definition files, source maps, metadata, etc. The package is installed with npm install @angular/core.</dd>\n+<dt>Symbol</dt>\n+<dd>A class, function, constant or variable contained in a module and optionally made visible to the external world via a module export.</dd>\n+<dt>Module</dt>\n+<dd>Short for ECMAScript Modules. A file containing statements that import and export symbols. This is identical to the definition of modules in the ECMAScript spec.</dd>\n+<dt>ESM</dt>\n+<dd>Short for ECMAScript Modules (see above)</dd>\n+<dt>FESM</dt>\n+<dd>Short for Flattened ES Modules and consists of a file format created by flattening all ES Modules accessible from an entry point into a single ES Module.\n+</dd>\n+<dt>Module ID</dt>\n+<dd>The identifier of a module used in the import statements, e.g. `@angular/core`. The ID often maps directly to a path on the filesystem, but this is not always the case due to various module resolution strategies.</dd>\n+<dt>Module Specifier</dt>\n+<dd>A module identifier (see above)</dd>\n+<dt>Module Resolution Strategy</dt>\n+<dd>Algorithm used to convert Module IDs to paths on the filesystem. Node.js has one that is well specified and widely used, TypeScript supports several module resolution strategies, Closure has yet another strategy.</dd>\n+<dt>Module Format</dt>\n+<dd>Specification of the module syntax that covers at minimum the syntax for the importing and exporting from a file. Common module formats are CommonJS (CJS, typically used for Node.js applications) or ECMAScript Modules (ESM). The module format indicates only the packaging of the individual modules, but not the JavaScript language features used to make up the module content. Because of this, the Angular team often uses the language level specifier as a suffix to the module format, e.g. ESM+ES5 specifies that the module is in ESM format and contains code down-leveled to ES5. Other commonly used combos: ESM+ES2015, CJS+ES5, and CJS+ES2015.</dd>\n+<dt>Bundle</dt>\n+<dd>An artifact in the form of a single JS file, produced by a build tool, e.g. WebPack or Rollup, that contains symbols originating in one or more modules. Bundles are a browser-specific workaround that reduce network strain that would be caused if browsers were to start downloading hundreds if not tens of thousands of files. Node.js typically doesn't use bundles. Common bundle formats are UMD and System.register.</dd>\n+<dt>Language Level</dt>\n+<dd>The language of the code (ES5 or ES2015). Independent of the module format.</dd>\n+<dt>Entry Point</dt>\n+<dd>A module intended to be imported by the user. It is referenced by a unique module ID and exports the public API referenced by that module ID. An example is @angular/core or @angular/core/testing. Both entry points exist in the @angular/core package, but they export different symbols. A package can have many entry points.</dd>\n+<dt>Deep Import</dt>\n+<dd>A process of retrieving symbols from modules that are not Entry Points. These module IDs are usually considered to be private APIs that can change over the lifetime of the project or while the bundle for the given package is being created.</dd>\n+<dt>Top-Level Import</dt>\n+<dd>An import coming from an entry point. The available top-level imports are what define the public API and are exposed in “@angular/name” modules, such as @angular/core  or @angular/common.</dd>\n+<dt>Tree-shaking</dt>\n+<dd>The process of identifying and removing code not used by an application - also known as dead code elimination. This is a global optimization performed at the application level using tools like Rollup, Closure Compiler, or Uglify.</dd>\n+<dt>AOT Compiler</dt>\n+<dd>The Ahead of Time Compiler for Angular.</dd>\n+<dt>Flattened Type Definitions</dt>\n+<dd>The bundled TypeScript definitions generated from api-extractor.</dd>\n+</dl>\n\\ No newline at end of file"
        },
        {
            "sha": "e0ce64ca8d3028801f03e743f402180c18065350",
            "filename": "aio/content/guide/glossary.md",
            "status": "modified",
            "additions": 8,
            "deletions": 0,
            "changes": 8,
            "blob_url": "https://github.com/angular/angular/blob/509b14536abe5c8ab086a8be2e1fb7d4c70035a0/aio%2Fcontent%2Fguide%2Fglossary.md",
            "raw_url": "https://github.com/angular/angular/raw/509b14536abe5c8ab086a8be2e1fb7d4c70035a0/aio%2Fcontent%2Fguide%2Fglossary.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fglossary.md?ref=509b14536abe5c8ab086a8be2e1fb7d4c70035a0",
            "patch": "@@ -34,6 +34,14 @@ An Angular [component](#component) packaged as a [custom element](#custom-elemen\n \n Learn more in [Angular Elements Overview](guide/elements).\n \n+{@a apf}\n+\n+## Angular package format (APF)\n+\n+An Angular specific specification for layout of npm packages that is used by all first-party Angular packages, and most third-party Angular libraries.\n+\n+Learn more in the [Angular Package Format specification](guide/angular-package-format).\n+\n {@a annotation}\n \n ## annotation"
        },
        {
            "sha": "45d7483b74785dbfab1af33b162bcf1c4e6e62e4",
            "filename": "aio/content/navigation.json",
            "status": "modified",
            "additions": 6,
            "deletions": 1,
            "changes": 7,
            "blob_url": "https://github.com/angular/angular/blob/509b14536abe5c8ab086a8be2e1fb7d4c70035a0/aio%2Fcontent%2Fnavigation.json",
            "raw_url": "https://github.com/angular/angular/raw/509b14536abe5c8ab086a8be2e1fb7d4c70035a0/aio%2Fcontent%2Fnavigation.json",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fnavigation.json?ref=509b14536abe5c8ab086a8be2e1fb7d4c70035a0",
            "patch": "@@ -740,6 +740,11 @@\n               \"url\": \"guide/creating-libraries\",\n               \"title\": \"Creating Libraries\",\n               \"tooltip\": \"Extend Angular by creating, publishing, and using your own libraries.\"\n+            },\n+            {\n+              \"url\": \"guide/angular-package-format\",\n+              \"title\": \"Angular Package Format\",\n+              \"tooltip\": \"Information about the Angular Package Format.\"\n             }\n           ]\n         }\n@@ -1232,4 +1237,4 @@\n       ]\n     }\n   ]\n-}\n+}\n\\ No newline at end of file"
        },
        {
            "sha": "f36591e12934a92084c5867beddd0c6df5394744",
            "filename": "aio/firebase.json",
            "status": "modified",
            "additions": 3,
            "deletions": 0,
            "changes": 3,
            "blob_url": "https://github.com/angular/angular/blob/509b14536abe5c8ab086a8be2e1fb7d4c70035a0/aio%2Ffirebase.json",
            "raw_url": "https://github.com/angular/angular/raw/509b14536abe5c8ab086a8be2e1fb7d4c70035a0/aio%2Ffirebase.json",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Ffirebase.json?ref=509b14536abe5c8ab086a8be2e1fb7d4c70035a0",
            "patch": "@@ -188,6 +188,9 @@\n       // Use discoverable link for Angular DevTools and redirect to the guide page\n       {\"type\": 301, \"source\": \"/devtools\", \"destination\": \"/guide/devtools\"},\n \n+      // Use discoverable link for Angular Package Format and redirect to the guide page\n+      {\"type\": 301, \"source\": \"/apf\", \"destination\": \"/guide/angular-package-format\"},\n+\n       // Temporarily serve the guide at `/devtools` as well as `/guide/devtools` until users have\n       // their SW updated to a version that knows about the `/devtools` redirect.\n       {\"type\": 302, \"source\": \"/generated/docs/devtools.json\", \"destination\": \"/generated/docs/guide/devtools.json\"}"
        },
        {
            "sha": "5c3b5751002f0ac6303758e67e8dea8c7e35c277",
            "filename": "aio/tests/deployment/shared/URLS_TO_REDIRECT.txt",
            "status": "modified",
            "additions": 1,
            "deletions": 0,
            "changes": 1,
            "blob_url": "https://github.com/angular/angular/blob/509b14536abe5c8ab086a8be2e1fb7d4c70035a0/aio%2Ftests%2Fdeployment%2Fshared%2FURLS_TO_REDIRECT.txt",
            "raw_url": "https://github.com/angular/angular/raw/509b14536abe5c8ab086a8be2e1fb7d4c70035a0/aio%2Ftests%2Fdeployment%2Fshared%2FURLS_TO_REDIRECT.txt",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Ftests%2Fdeployment%2Fshared%2FURLS_TO_REDIRECT.txt?ref=509b14536abe5c8ab086a8be2e1fb7d4c70035a0",
            "patch": "@@ -1,3 +1,4 @@\n+/apf --> /guide/angular-package-format\n /api/animate/AnimationBuilder --> /api/animations/AnimationBuilder\n /api/animate/CssAnimationBuilder --> /api/animations/CssAnimationBuilder\n /api/api/core/ElementRef --> /api/core/ElementRef"
        }
    ],
    "stats": {
        "total": 389,
        "additions": 387,
        "deletions": 2
    }
}