{
    "author": "markgoho",
    "message": "docs: clarify voting phase for feature requests (#42663)\n\nPR Close #42663",
    "sha": "88b15d572fa0a0336fb1eee0187fb8b1486e076d",
    "files": [
        {
            "sha": "28f9bf3b254275f936f98a3cdefd7e6a503ec1f6",
            "filename": "docs/GITHUB_PROCESS.md",
            "status": "modified",
            "additions": 13,
            "deletions": 7,
            "changes": 20,
            "blob_url": "https://github.com/angular/angular/blob/88b15d572fa0a0336fb1eee0187fb8b1486e076d/docs%2FGITHUB_PROCESS.md",
            "raw_url": "https://github.com/angular/angular/raw/88b15d572fa0a0336fb1eee0187fb8b1486e076d/docs%2FGITHUB_PROCESS.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/docs%2FGITHUB_PROCESS.md?ref=88b15d572fa0a0336fb1eee0187fb8b1486e076d",
            "patch": "@@ -28,16 +28,22 @@ initiates a voting process.\n \n ## Voting phase\n \n-To include the community in the feature request process, we open voting for 60 days. Anyone can cast\n-a vote for the request with a thumbs-up (👍) reaction. When a feature request reaches 20 or more\n-upvotes, we formally consider the feature request. Alternatively, the bot closes the request.\n+To include the community in the feature request process, we open voting for a fixed length of time.\n+Anyone can cast a vote for the request with a thumbs-up (👍) reaction on the original issue description.\n+When a feature request reaches 20 or more upvotes, we formally consider the feature request.\n+Alternatively, the bot closes the request.\n+\n+**For issues that are 60+ days old**: The voting phase is 20 days\n+\n+**For new issues**: The voting phase is 60 days\n \n ## Consideration phase\n \n-If the feature request receives 20 or more votes, we verify the Angular team can afford to maintain\n-the feature and whether it aligns with the long-term vision of Angular. If the answers to both of\n-these questions are yes, we prioritize the request, alternatively we close it with an explanation of\n-our decision.\n+If the feature request receives 20 or more thumbs-up (👍) votes on the original issue description\n+(during the voting phase described above), we verify the Angular team can afford to maintain the\n+feature and whether it aligns with the long-term vision of Angular. If the answers to both of these\n+questions are yes, we prioritize the request, alternatively we close it with an explanation of our\n+decision.\n \n ## Diagram\n "
        }
    ],
    "stats": {
        "total": 20,
        "additions": 13,
        "deletions": 7
    }
}