{
    "author": "kapunahelewong",
    "message": "docs: add documentation for Angular linker (#41485)\n\nPR Close #41485",
    "sha": "931d40b18a7db620166546aa0679ffb499915aff",
    "files": [
        {
            "sha": "e9bf2891c3613685f5f288ed99e0db8744d0e37d",
            "filename": "aio/content/guide/creating-libraries.md",
            "status": "modified",
            "additions": 109,
            "deletions": 10,
            "changes": 119,
            "blob_url": "https://github.com/angular/angular/blob/931d40b18a7db620166546aa0679ffb499915aff/aio%2Fcontent%2Fguide%2Fcreating-libraries.md",
            "raw_url": "https://github.com/angular/angular/raw/931d40b18a7db620166546aa0679ffb499915aff/aio%2Fcontent%2Fguide%2Fcreating-libraries.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fcreating-libraries.md?ref=931d40b18a7db620166546aa0679ffb499915aff",
            "patch": "@@ -118,23 +118,23 @@ To learn more, see [Schematics Overview](guide/schematics) and [Schematics for L\n \n Use the Angular CLI and the npm package manager to build and publish your library as an npm package.\n \n-Before publishing a library to NPM, build it using the `production` configuration which uses the older compiler and runtime known as View Engine instead of Ivy.\n+\n+Angular CLI uses a tool called [ng-packagr](https://github.com/ng-packagr/ng-packagr/blob/master/README.md) to create packages\n+from your compiled code that can be published to npm.\n+See [Building libraries with Ivy](guide/creating-libraries#ivy-libraries) for information on the\n+distribution formats supported by `ng-packagr` and guidance on how\n+to choose the right format for your library.\n+\n+You should always build libraries for distribution using the `production` configuration.\n+This ensures that generated output uses the appropriate optimizations and the correct package format for npm.\n \n <code-example language=\"bash\">\n ng build my-lib\n cd dist/my-lib\n npm publish\n </code-example>\n \n-If you've never published a package in npm before, you must create a user account. Read more in [Publishing npm Packages](https://docs.npmjs.com/getting-started/publishing-npm-packages).\n-\n-<div class=\"alert is-important\">\n-\n-For now, it is not recommended to publish Ivy libraries to NPM because Ivy generated code is not backward compatible with View Engine, so apps using View Engine will not be able to consume them. Furthermore, the internal Ivy instructions are not yet stable, which can potentially break consumers using a different Angular version from the one used to build the library.\n \n-When a published library is used in an Ivy app, the Angular CLI will automatically convert it to Ivy using a tool known as the Angular compatibility compiler (`ngcc`). Thus, publishing your libraries using the View Engine compiler ensures that they can be transparently consumed by both View Engine and Ivy apps.\n-\n-</div>\n \n {@a lib-assets}\n \n@@ -147,7 +147,6 @@ You can use this feature when your library needs to publish optional theming fil\n \n * Learn more about how to use the tool to [embed assets in CSS](https://github.com/ng-packagr/ng-packagr/blob/master/docs/embed-assets-css.md).\n \n-\n ## Linked libraries\n \n While working on a published library, you can use [npm link](https://docs.npmjs.com/cli/link) to avoid reinstalling the library on every build.\n@@ -243,3 +242,103 @@ For this reason, an app that depends on a library should only use TypeScript pat\n TypeScript path mappings should *not* point to the library source `.ts` files.\n \n </div>\n+\n+{@a ivy-libraries}\n+\n+## Building libraries with Ivy\n+\n+There are three distribution formats that you can use when publishing a library:\n+\n+* View Engine _(deprecated)_&mdash;legacy format, slated for removal in Angular version 13.\n+  Only use this format if you must support View Engine applications.\n+* partial-Ivy **(recommended)**&mdash;contains portable code that can be consumed by Ivy applications built with any version of Angular from v12 onwards.\n+* full-Ivy&mdash;contains private Angular Ivy instructions, which are not guaranteed to work across different versions of Angular. This format requires that the library and application are built with the _exact_ same version of Angular. This format is useful for environments where all library and application code is built directly from source.\n+\n+New libraries created with Angular CLI default to partial-Ivy format.\n+If you are creating a new library with `ng generate library`, Angular uses Ivy by default with no further action on your part.\n+\n+### Transitioning libraries to partial-Ivy format\n+\n+Existing libraries, which are configured to generate the View Engine format, do not change when upgrading to later versions of Angular that use Ivy.\n+\n+If you intend to publish your library to npm, compile with partial-Ivy code by setting `\"compilationMode\": \"partial\"` in `tsconfig.prod.json`.\n+\n+A library that uses View Engine, rather than Ivy, has a `tsconfig.prod.json` file that contains the following:\n+\n+<code-example>\n+\n+\"angularCompilerOptions\": {\n+  \"enableIvy\": false\n+}\n+\n+</code-example>\n+\n+To convert such libraries to use the partial-Ivy format, change the `tsconfig.prod.json` file by removing the `enableIvy` option and adding the `compilationMode` option.\n+\n+Enable partial-Ivy compilation by replacing `\"enableIvy\": false` with `\"compilationMode\": \"partial\"` as follows:\n+\n+<code-example>\n+\n+\"angularCompilerOptions\": {\n+  \"compilationMode\": \"partial\"\n+}\n+\n+</code-example>\n+\n+For publishing to npm use the partial-Ivy format as it is stable between patch versions of Angular.\n+\n+Avoid compiling libraries with full-Ivy code if you are publishing to npm because the generated Ivy instructions are not part of Angular's public API, and so may change between patch versions.\n+\n+Partial-Ivy code is not backward compatible with View Engine.\n+If you use the library in a View Engine application, you must compile the library into the View Engine format by setting `\"enableIvy\": false` in the `tsconfig.json` file.\n+\n+Ivy applications can still consume the View Engine format because the Angular compatibility compiler, or `ngcc`, can convert it to Ivy.\n+\n+## Ensuring library version compatibility\n+\n+The Angular version used to build an application should always be the same or greater than the Angular versions used to build any of its dependent libraries.\n+For example, if you had a library using Angular version 12, the application that depends on that library should use Angular version 12 or later.\n+Angular does not support using an earlier version for the application.\n+\n+<div class=\"alert is-helpful\">\n+\n+The Angular CLI uses Ivy to build applications and no longer uses View Engine.\n+A library or an application built with View Engine cannot consume a partial-Ivy library.\n+\n+</div>\n+\n+Because this process happens during the application build, it uses the same version of the Angular compiler, ensuring that the application and all of its libraries use a single version of Angular.\n+\n+If you intend to publish your library to npm, compile with partial-Ivy code by setting `\"compilationMode\": \"partial\"` in `tsconfig.prod.json`.\n+This partial format is stable between different versions of Angular, so is safe to publish to npm.\n+\n+Avoid compiling libraries with full-Ivy code if you are publishing to npm because the generated Ivy instructions are not part of Angular's public API, and so might change between patch versions.\n+\n+Partial-Ivy code is not backward compatible with View Engine.\n+If you use the library in a View Engine application, you must compile the library into the View Engine format by setting `\"enableIvy\": false` in the `tsconfig.json` file.\n+\n+Ivy applications can still consume the View Engine format because the Angular compatibility compiler, or `ngcc`, can convert it to Ivy in the Angular CLI.\n+\n+If you've never published a package in npm before, you must create a user account. Read more in [Publishing npm Packages](https://docs.npmjs.com/getting-started/publishing-npm-packages).\n+\n+\n+## Consuming partial-Ivy code outside the Angular CLI\n+\n+An application installs many Angular libraries from npm into its `node_modules` directory.\n+However, the code in these libraries cannot be bundled directly along with the built application as it is not fully compiled.\n+To finish compilation, you can use the Angular linker.\n+\n+For applications that don't use the Angular CLI, the linker is available as a Babel plugin.\n+You can use the Babel plugin using the module `@angular/compiler-cli/linker/babel` to incorporate into your builds.\n+For example, you can integrate the plugin into a custom Webpack build by registering the linker as a plugin for `babel-loader`.\n+\n+Previously, if you ran `yarn install` or `npm install` you had to re-run `ngcc`.\n+Now, libraries only need to be processed by the linker a single time, regardless of other npm operations.\n+\n+The Angular linker Babel plugin supports build caching, meaning that libraries only need to be processed by the linker a single time, regardless of other npm operations.\n+\n+<div class=\"alert is-helpful\">\n+\n+The Angular CLI integrates the linker plugin automatically, so if consumers of your library are using the CLI, they can install Ivy-native libraries from npm without any additional configuration.\n+\n+</div>"
        }
    ],
    "stats": {
        "total": 119,
        "additions": 109,
        "deletions": 10
    }
}