{
    "author": "sumitarora",
    "message": "docs(devtools): updating documentation",
    "sha": "981f8fa014bdcd54d7e69d87919754c1d7952744",
    "files": [
        {
            "sha": "431fe7e44eb5bc382960d084b4ea4be2860b8371",
            "filename": "docs/overview.md",
            "status": "modified",
            "additions": 34,
            "deletions": 47,
            "changes": 81,
            "blob_url": "https://github.com/angular/angular/blob/981f8fa014bdcd54d7e69d87919754c1d7952744/docs%2Foverview.md",
            "raw_url": "https://github.com/angular/angular/raw/981f8fa014bdcd54d7e69d87919754c1d7952744/docs%2Foverview.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/docs%2Foverview.md?ref=981f8fa014bdcd54d7e69d87919754c1d7952744",
            "patch": "@@ -6,27 +6,26 @@\n     - [Navigate to the host node](#navigate-to-the-host-node)\n     - [Navigate to source](#navigate-to-source)\n     - [Update property value](#update-property-value)\n-    - [Access selected component in console](#access-selected-component-in-console)\n-    - [Selecting DOM Node](#selecting-dom-node)\n-  - [Profiler](#profiler)\n-    - [Default profiler view](#default-profiler-view)\n-    - [Directive details](#directive-details)\n-    - [Flame graph view](#flame-graph-view)\n+    - [Access selected component or directive in console](#access-selected-component-or-directive-in-console)\n+    - [Selecting a directive or component](#selecting-a-directive-or-component)\n+  - [Profiling your application](#profiling-your-application)\n+    - [Understanding your application's execution](#understanding-your-applications-execution)\n+    - [Understanding component's execution](#understanding-components-execution)\n+    - [Hierarchical views](#hierarchical-views)\n     - [Debugging OnPush](#debugging-onpush)\n-    - [Treemap view](#treemap-view)\n     - [Import recording](#import-recording)\n \n # Overview\n \n-Angular DevTools is a Chrome extension that provides debugging and profiling capabilities for Angular applications. Angular Devtools supports Angular v9 and above, with Ivy enabled.\n+Angular DevTools is a Chrome DevTools extension that provides debugging and profiling capabilities for Angular applications. Angular DevTools supports Angular Ivy applications v9 and above.\n \n-You can install devtools from Chrome Webstore by searching \"Angular Devtools\" or can click here.\n+You can find Angular DevTools in the [Chrome Web Store](...).\n \n-Once installed, open Chrome DevTools. You should see an \"Angular\" tab.\n+Once you install Angular DevTools, you can find the extension under the \"Angular\" tab in Chrome DevTools.\n \n ![component explorer](assets/open-devtools.gif)\n \n-When you open it, you'll see two additional tabs:\n+When you open the extension, you'll see two additional tabs:\n \n - [Components](#components) - allows you to explore the components and directives in your application and preview or edit their state.\n - [Profiler](#profiler) - allows you to profile your application and understand what is the performance bottleneck during change detection execution.\n@@ -37,29 +36,29 @@ At the top-right corner of Angular DevTools you'll find what is the version of A\n \n ## Bug reports\n \n-You can **report issues and feature requests [here](https://github.com/rangle/angular-devtools/issues)**.\n-\n-When opening an issue, please follow the issue template provided.\n+You can **report issues and feature requests on [GitHub](https://github.com/rangle/angular-devtools/issues)**.\n \n If you're reporting an issue with the profiler, export the profiler recording by clicking the \"save profile\" button, and then attach that export as a file in the issue.\n \n-> Make sure while exporting profiler recording, it does not contain any proprietary information.\n+> Make sure while exporting profiler recording, it does not contain any confidential information.\n \n ## Debugging your application\n \n The component tab allows you to explore the structure of your application. You can visualize and inspect the component and directive instances and preview or modify their state. In the next a couple of sections we'll look into how you can use this tab effectively to debug your application.\n \n ### Exploring the structure of the application\n \n-The component tree displays a hierarchical relationship of the _components_ and _directives_ within your application. When you select a component or directive instance, Angular DevTools presents additional information about it.\n-\n ![component explorer](assets/component-explorer.png)\n \n In the screenshot above, you can see the component tree of an application.\n \n+The component tree displays a hierarchical relationship of the _components_ and _directives_ within your application. When you select a component or a directive instance, Angular DevTools presents additional information about it.\n+\n ### Viewing properties\n \n-You can click on the individual components or directives to select them and preview their properties. Component properties will get displayed on the right-hand side of the component tree. To navigate in the component tree, you can use the arrows:\n+You can click on the individual components or directives to select them and preview their properties. Angular DevTools will display their properties and metadata on the right-hand side of the component tree.\n+\n+You can navigate in the component tree using the mouse or the following keyboard shortcuts:\n \n - Up and down to select the previous and next nodes.\n - Left and right to collapse and expand a node.\n@@ -82,37 +81,35 @@ For components, Angular DevTools would also allow you to navigate to the compone\n \n ### Update property value\n \n-Like Chrome DevTools, the property view allows you to edit the value of an input, output, or state property. Right-click on the property value. If edit functionality is available for this value type, you'll see a text input. Type the new value and press enter.\n+Like Chrome DevTools, the property view allows you to edit the value of an input, output, or another property. Right-click on the property value. If edit functionality is available for this value type, you'll see a text input. Type the new value and press enter.\n \n ![update property](assets/update-property.gif)\n \n-### Access selected component in console\n+### Access selected component or directive in console\n \n-As a shortcut in the console, Angular DevTools provides you access to the currently selected component. Just type `$ng0` to get a reference to the instance of the selected component. DevTools keeps references to the last 5 selections in the variables `$ng0`, `$ng1`, `$ng2`, `$ng3`, and `$ng4`.\n+As a shortcut in the console, Angular DevTools provides you access to the instances of the recently selected components or directives. Type `$ng0` to get a reference to the instance of the currently selected component or directive, `$ng1` for the previously selected instance, etc.\n \n ![access console](assets/access-console.gif)\n \n-### Selecting DOM Node\n+### Selecting a directive or component\n \n-Like Chrome Devtools you can use selection to hover over the rendered components on the page and select the component within the component tree.\n+Similarly to Chrome DevTools you can inspect the page to select a particular component or directive. Click on the directive explorer and hover a DOM element on the page. Angular DevTools will recognize the associated directives and/or components and allow you to select the corresponding entry in the component explorer.\n \n ![selecting dom node](assets/selecting-dom-node.gif)\n \n-## Profiler\n-\n-The profiler tab allows you to preview the execution time of Angular's change detection and your component's lifecycle hooks.\n+## Profiling your application\n \n-Currently, Angular DevTools does not allow profiling of component and the directive's outputs.\n+The profiler tab allows you to preview the execution of Angular's change detection.\n \n ![profiler](assets/profiler.png)\n \n-The profiler allows you to start profiling or import an existing profile. You can start profiling your application by clicking on the circle at the top left.\n+The profiler allows you to start profiling or import an existing profile. You can start profiling your application by clicking on the circle at the top-left.\n \n During profiling, Angular DevTools will capture execution events, such as change detection and lifecycle hook execution. To finish recording, click on the same button.\n \n You can also import an existing recording. Read more about this feature at the [Import recording](#import-recording) section.\n \n-### Default profiler view\n+### Understanding your application's execution\n \n On the screenshot below, you can find the default view of the profiler once you complete recording.\n \n@@ -122,32 +119,28 @@ At the top, you can see a sequence of bars, each one of them symbolizing change\n \n ![profiler selected bar](assets/profiler-selected-bar.png)\n \n-Above the change detection cycle visualization, you can find how much time exactly Angular spent in this cycle. Angular DevTools will also try to estimate the frame drop at this point so that it can indicate when you should consider\n-optimizing your component tree.\n+Above the change detection timeline, you can find how much time Angular spent in this cycle. Angular DevTools will also try to estimate the frame drop at this point so that it can indicate when the execution of your application may impact the user experience.\n \n-Additionally, Angular DevTools will also indicate what triggered the change detection (i.e., change detection's source).\n+Angular DevTools will also indicate what triggered the change detection (i.e., change detection's source).\n \n-### Directive details\n+### Understanding component's execution\n \n-You can easily notice how much time you spend on the individual components/directives. When you click on a bar, you'll see detailed view about your selection:\n+When you click on a bar, you'll find a detailed view about how much time your application spent in the particular directive or component:\n \n ![directive details](assets/directive-details.gif)\n \n-On the screenshot above you can find a pie chart showing how much time the specific directive/component spent in change detection versus lifecycle hooks and also, its parent hierarchy, so that you can efficiently allocate it in the\n-component tree.\n+### Hierarchical views\n \n-### Flame graph view\n+![flame graph view](assets/flame-graph-view.gif)\n \n-You can also preview the change detection execution in a flame graph. Each tile in the graph represents an element on the screen at a specific position in the DOM tree.\n+You can also preview the change detection execution in a flame graph-like view. Each tile in the graph represents an element on the screen at a specific position in the render tree.\n \n-> For example, if during one change detection cycle at a specific position in the component tree we had `ComponentA`, this component was removed, and on its place Angular rendered `ComponentB`; you'll see both components at the same tile.\n+For example, if during one change detection cycle at a specific position in the component tree we had `ComponentA`, this component was removed, and on its place Angular rendered `ComponentB`; you'll see both components at the same tile.\n \n Each tile is colored depending on how much time Angular has spent there. DevTools determines the intensity of the color by the time spent relative to the tile where we've spent the most time in change detection.\n \n When you click on a certain tile, you'll see details about it in the panel on the right. Double click on the tile, will zoom it in so you can preview the nested children:\n \n-![flame graph view](assets/flame-graph-view.gif)\n-\n ### Debugging OnPush\n \n To preview in which components Angular did change detection, check the \"Change detection\" checkbox at the top, above the flame graph.\n@@ -156,12 +149,6 @@ This view will color in green all the tiles in which Angular change detection, a\n \n ![debugging onpush](assets/debugging-onpush.gif)\n \n-### Treemap view\n-\n-The treemap view is experimental. It aims to show in which component in the component tree you spent the most time during the selected change detection cycle.\n-\n-![ree map](assets/tree-map.gif)\n-\n ### Import recording\n \n Pressing the \"Export to JSON\" button at the top-left of a recorded profiling session will export it as a JSON file and save it on the disk. Later on, you can import the file in the initial view of the profiler, pressing on the \"Choose file\" input:"
        }
    ],
    "stats": {
        "total": 81,
        "additions": 34,
        "deletions": 47
    }
}