{
    "author": "chihab",
    "message": "docs: fix typo (#44592)\nPR Close #44592",
    "sha": "c6c75c9b7018cfeb4d2bbc8945f3af1ca71943d3",
    "files": [
        {
            "sha": "bd7b4d92656f53e9709d403348a833172f991916",
            "filename": "aio/content/guide/angular-package-format.md",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/angular/angular/blob/c6c75c9b7018cfeb4d2bbc8945f3af1ca71943d3/aio%2Fcontent%2Fguide%2Fangular-package-format.md",
            "raw_url": "https://github.com/angular/angular/raw/c6c75c9b7018cfeb4d2bbc8945f3af1ca71943d3/aio%2Fcontent%2Fguide%2Fangular-package-format.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fangular-package-format.md?ref=c6c75c9b7018cfeb4d2bbc8945f3af1ca71943d3",
            "patch": "@@ -245,7 +245,7 @@ As of webpack v4 the flattening of ES modules optimization should not be necessa\n \n By default, EcmaScript Modules are side-effectful: importing from a module ensures that any code at the top level of that module will execute. This is often undesirable, as most side-effectful code in typical modules is not truly side-effectful, but instead only affects specific symbols. If those symbols are not imported and used, it's often desirable to remove them in an optimization process known as tree-shaking, and the side-effectful code can prevent this.\n \n-Build tools such as Webpack support a flag which allows ackages to declare that they do not depend on side-effectful code at the top level of their modules, giving the tools more freedom to tree-shake code from the package. The end result of these optimizations should be smaller bundle size and better code distribution in bundle chunks after code-splitting. This optimization can break your code if it contains non-local side-effects - this is however not common in Angular applications and it's usually a sign of bad design. Our recommendation is for all packages to claim the side-effect free status by setting the `sideEffects` property to `false`, and that developers follow the [Angular Style Guide](https://angular.io/guide/styleguide) which naturally results in code without non-local side-effects.\n+Build tools such as Webpack support a flag which allows packages to declare that they do not depend on side-effectful code at the top level of their modules, giving the tools more freedom to tree-shake code from the package. The end result of these optimizations should be smaller bundle size and better code distribution in bundle chunks after code-splitting. This optimization can break your code if it contains non-local side-effects - this is however not common in Angular applications and it's usually a sign of bad design. Our recommendation is for all packages to claim the side-effect free status by setting the `sideEffects` property to `false`, and that developers follow the [Angular Style Guide](https://angular.io/guide/styleguide) which naturally results in code without non-local side-effects.\n \n More info: [webpack docs on side-effects](https://github.com/webpack/webpack/tree/master/examples/side-effects)\n  "
        }
    ],
    "stats": {
        "total": 2,
        "additions": 1,
        "deletions": 1
    }
}