{
    "author": "nobobo1234",
    "message": "docs: Changing typo Stacblitz into Stackblitz in the Tour of Hereos tutorial docs page (#37794)\n\nChanging the typo of Stacblitz into Stackblitz in the tour of hereos tutorial docs page since that is the actual name of the service\n\nPR Close #37794",
    "sha": "cde4653c62ca4d0889ed35a9991e275515d4bbd2",
    "files": [
        {
            "sha": "e988eae0c875f5c8c0cc1085e63261f80d4f58e9",
            "filename": "aio/content/tutorial/index.md",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/angular/angular/blob/cde4653c62ca4d0889ed35a9991e275515d4bbd2/aio%2Fcontent%2Ftutorial%2Findex.md",
            "raw_url": "https://github.com/angular/angular/raw/cde4653c62ca4d0889ed35a9991e275515d4bbd2/aio%2Fcontent%2Ftutorial%2Findex.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Ftutorial%2Findex.md?ref=cde4653c62ca4d0889ed35a9991e275515d4bbd2",
            "patch": "@@ -6,7 +6,7 @@\n In this tutorial, you build your own app from the ground up, providing experience with the typical development process, as well as an introduction to basic app-design concepts, tools, and terminology.\n \n If you're completely new to Angular, you might want to try the [**Try it now**](start) quick-start app first.\n-It is based on a ready-made  partially-completed project, which you can examine and modify in the StacBlitz interactive development environment, where you can see the results in real time.\n+It is based on a ready-made  partially-completed project, which you can examine and modify in the StackBlitz interactive development environment, where you can see the results in real time.\n \n The \"Try it\" tutorial covers the same major topics&mdash;components, template syntax, routing, services, and accessing data via HTTP&mdash;in a condensed format, following the most current best practices.\n "
        }
    ],
    "stats": {
        "total": 2,
        "additions": 1,
        "deletions": 1
    }
}