{
    "author": "rockument69",
    "message": "docs: Refactor module-types.md to make it easier to understand (#38206)\n\nProject DOCS-736 to rewrite headings to focus on user tasks,\nverify that the content is up-to-date and complete, and\nadd relevant links to other NgModule topics to improve readability.\nAlso addresses one of many issues in GitHub issue 21531.\n\nPR Close #38206",
    "sha": "cf98db28d54bb4f5c1bccd8329bf9f8148c02586",
    "files": [
        {
            "sha": "cd5aae56e9ac0bd9efb92484a9afbc9371665e72",
            "filename": "aio/content/guide/module-types.md",
            "status": "modified",
            "additions": 153,
            "deletions": 105,
            "changes": 258,
            "blob_url": "https://github.com/angular/angular/blob/cf98db28d54bb4f5c1bccd8329bf9f8148c02586/aio%2Fcontent%2Fguide%2Fmodule-types.md",
            "raw_url": "https://github.com/angular/angular/raw/cf98db28d54bb4f5c1bccd8329bf9f8148c02586/aio%2Fcontent%2Fguide%2Fmodule-types.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fmodule-types.md?ref=cf98db28d54bb4f5c1bccd8329bf9f8148c02586",
            "patch": "@@ -1,116 +1,41 @@\n-# Types of feature modules\n+# Guidelines for creating NgModules\n \n-There are five general categories of feature modules which\n-tend to fall into the following groups:\n+This topic provides a conceptual overview of the different categories of [NgModules](guide/glossary#ngmodule \"Definition of NgModule\") you can create in order to organize your code in a modular structure.\n+These categories are not cast in stone—they are suggestions.\n+You may want to create NgModules for other purposes, or combine the characteristics of some of these categories.\n \n-* Domain feature modules.\n-* Routed feature modules.\n-* Routing modules.\n-* Service feature modules.\n-* Widget feature modules.\n+NgModules are a great way to organize an app and keep code related to a specific functionality or feature separate from other code.\n+Use NgModules to consolidate [components](guide/glossary#component \"Definition of component\"), [directives](guide/glossary#directive \"Definition of directive\"), and [pipes](guide/glossary#pipe \"Definition of pipe)\") into cohesive blocks of functionality.\n+Focus each block on a feature or business domain, a workflow or navigation flow, a common collection of utilities, or one or more [providers](guide/glossary#provider \"Definition of provider\") for [services](guide/glossary#service \"Definition of service\").\n \n-While the following guidelines describe the use of each type and their\n-typical characteristics, in real world apps, you may see hybrids.\n+For more about NgModules, see [Organizing your app with NgModules](guide/ngmodules \"Organizing your app with NgModules\").\n \n-<table>\n-\n- <tr>\n-   <th style=\"vertical-align: top\">\n-     Feature Module\n-   </th>\n-\n-   <th style=\"vertical-align: top\">\n-     Guidelines\n-   </th>\n- </tr>\n-\n- <tr>\n-   <td>Domain</td>\n-   <td>\n-     Domain feature modules deliver a user experience dedicated to a particular application domain like editing a customer or placing an order.\n-\n-     They typically have a top component that acts as the feature root and private, supporting sub-components descend from it.\n-\n-     Domain feature modules consist mostly of declarations. Only the top component is exported.\n-\n-     Domain feature modules rarely have providers. When they do, the lifetime of the provided services should be the same as the lifetime of the module.\n-\n-     Domain feature modules are typically imported exactly once by a larger feature module.\n-\n-     They might be imported by the root `AppModule` of a small application that lacks routing.\n-   </td>\n- </tr>\n- <tr>\n-   <td>Routed</td>\n-   <td>\n-     Routed feature modules are domain feature modules whose top components are the targets of router navigation routes.\n-\n-     All lazy-loaded modules are routed feature modules by definition.\n-\n-     Routed feature modules don’t export anything because their components never appear in the template of an external component.\n-\n-     A lazy-loaded routed feature module should not be imported by any module. Doing so would trigger an eager load, defeating the purpose of lazy loading.That means you won’t see them mentioned among the `AppModule` imports. An eager loaded routed feature module must be imported by another module so that the compiler learns about its components.\n-\n-     Routed feature modules rarely have providers for reasons explained in [Lazy Loading Feature Modules](/guide/lazy-loading-ngmodules). When they do, the lifetime of the provided services should be the same as the lifetime of the module. Don't provide application-wide singleton services in a routed feature module or in a module that the routed module imports.\n-   </td>\n- </tr>\n-\n- <tr>\n-   <td>Routing</td>\n-   <td>\n-\n-     A routing module provides routing configuration for another module and separates routing concerns from its companion module.\n-\n-     A routing module typically does the following:\n-\n-     <ul>\n-     <li>Defines routes.</li>\n-     <li>Adds router configuration to the module's imports.</li>\n-     <li>Adds guard and resolver service providers to the module's providers.</li>\n-     <li>The name of the routing module should parallel the name of its companion module, using the suffix \"Routing\". For example, <code>FooModule</code> in <code>foo.module.ts</code> has a routing module named <code>FooRoutingModule</code> in <code>foo-routing.module.ts</code>. If the companion module is the root <code>AppModule</code>, the <code>AppRoutingModule</code> adds router configuration to its imports with <code>RouterModule.forRoot(routes)</code>. All other routing modules are children that import <code>RouterModule.forChild(routes)</code>.</li>\n-     <li>A routing module re-exports the <code>RouterModule</code> as a convenience so that components of the companion module have access to router directives such as <code>RouterLink</code> and <code>RouterOutlet</code>.</li>\n-     <li>A routing module does not have its own declarations. Components, directives, and pipes are the responsibility of the feature module, not the routing module.</li>\n-     </ul>\n-\n-     A routing module should only be imported by its companion module.\n-\n-   </td>\n- </tr>\n-\n- <tr>\n-   <td>Service</td>\n-   <td>\n-\n-     Service modules provide utility services such as data access and messaging. Ideally, they consist entirely of providers and have no declarations. Angular's `HttpClientModule` is a good example of a service module.\n-\n-     The root `AppModule` is the only module that should import service modules.\n-\n-   </td>\n- </tr>\n-\n- <tr>\n-   <td>Widget</td>\n-   <td>\n+<div class=\"alert is-helpful\">\n \n-     A widget module makes components, directives, and pipes available to external modules. Many third-party UI component libraries are widget modules.\n+For the example app used in NgModules-related topics, see the <live-example name=\"ngmodules\"></live-example>.\n \n-     A widget module should consist entirely of declarations, most of them exported.\n+</div>\n \n-     A widget module should rarely have providers.\n+## Summary of NgModule categories\n \n-     Import widget modules in any module whose component templates need the widgets.\n+All apps start by [bootstrapping a root NgModule](guide/bootstrapping \"Launching an app with a root NgModule\").\n+You can organize your other NgModules any way you wish.\n \n-   </td>\n- </tr>\n+This topic provides some guidelines for the following general categories of NgModules:\n \n-</table>\n+* [Domain](#domain): A domain NgModule is organized around a feature, business domain, or user experience.\n+* [Routed](#routed): The top component of the NgModule acts as the destination of a [router](guide/glossary#router \"Definition of router\") navigation route.\n+* [Routing](#routing): A routing NgModule provides the routing configuration for another NgModule.\n+* [Service](#service): A service NgModule provides utility services such as data access and messaging.\n+* [Widget](#widget): A widget NgModule makes a component, directive, or pipe available to other NgModules.\n+* [Shared](#shared): A shared NgModule makes a set of components, directives, and pipes available to other NgModules.\n \n-The following table summarizes the key characteristics of each feature module group.\n+The following table summarizes the key characteristics of each category.\n \n <table>\n  <tr>\n    <th style=\"vertical-align: top\">\n-     Feature Module\n+     NgModule\n    </th>\n \n    <th style=\"vertical-align: top\">\n@@ -135,7 +60,7 @@ The following table summarizes the key characteristics of each feature module gr\n    <td>Yes</td>\n    <td>Rare</td>\n    <td>Top component</td>\n-   <td>Feature, AppModule</td>\n+   <td>Another domain, AppModule</td>\n  </tr>\n \n  <tr>\n@@ -151,7 +76,7 @@ The following table summarizes the key characteristics of each feature module gr\n    <td>No</td>\n    <td>Yes (Guards)</td>\n    <td>RouterModule</td>\n-   <td>Feature (for routing)</td>\n+   <td>Another domain (for routing)</td>\n  </tr>\n \n  <tr>\n@@ -167,14 +92,137 @@ The following table summarizes the key characteristics of each feature module gr\n    <td>Yes</td>\n    <td>Rare</td>\n    <td>Yes</td>\n-   <td>Feature</td>\n+   <td>Another domain</td>\n+ </tr>\n+\n+ <tr>\n+   <td>Shared</td>\n+   <td>Yes</td>\n+   <td>No</td>\n+   <td>Yes</td>\n+   <td>Another domain</td>\n  </tr>\n </table>\n \n-<hr />\n+{@a domain}\n+\n+## Domain NgModules\n+\n+Use a domain NgModule to deliver a user experience dedicated to a particular feature or app domain, such as editing a customer or placing an order.\n+One example is `ContactModule` in the <live-example name=\"ngmodules\"></live-example>.\n+\n+A domain NgModule organizes the code related to a certain function, containing all of the components, routing, and templates that make up the function.\n+Your top component in the domain NgModule acts as the feature or domain's root, and is the only component you export.\n+Private supporting subcomponents descend from it.\n+\n+Import a domain NgModule exactly once into another NgModule, such as a domain NgModule, or into the root NgModule (`AppModule`) of an app that contains only a few NgModules.\n+\n+Domain NgModules consist mostly of declarations.\n+You rarely include providers.\n+If you do, the lifetime of the provided services should be the same as the lifetime of the NgModule.\n+\n+<div class=\"alert is-helpful\">\n+\n+For more information about lifecycles, see [Hooking into the component lifecycle](guide/lifecycle-hooks \"Hooking into the component lifecycle\").\n+\n+</div>\n+\n+{@a routed}\n+\n+## Routed NgModules\n+\n+Use a routed NgModule for all [lazy-loaded NgModules](guide/lazy-loading-ngmodules \"Lazy-loading an NgModule\").\n+Use the top component of the NgModule as the destination of a router navigation route.\n+Routed NgModules don’t export anything because their components never appear in the template of an external component.\n+\n+Don't import a lazy-loaded routed NgModule into another NgModule, as this would trigger an eager load, defeating the purpose of lazy loading.\n+\n+Routed NgModules rarely have providers because you load a routed NgModule only when needed (such as for routing).\n+Services listed in the NgModules' `provider` array would not be available because the root injector wouldn’t know about the lazy-loaded NgModule.\n+If you include providers, the lifetime of the provided services should be the same as the lifetime of the NgModule.\n+Don't provide app-wide [singleton services](guide/singleton-services) in a routed NgModule or in an NgModule that the routed NgModule imports.\n+\n+<div class=\"alert is-helpful\">\n+\n+For more information about providers and lazy-loaded routed NgModules, see [Limiting provider scope](guide/providers#limiting-provider-scope-by-lazy-loading-modules \"Providing dependencies: Limiting provider scope\").\n+\n+</div>\n+\n+{@a routing}\n+\n+## Routing NgModules\n+\n+Use a routing NgModule to provide the routing configuration for a domain NgModule, thereby separating routing concerns from its companion domain NgModule.\n+One example is `ContactRoutingModule` in the <live-example name=\"ngmodules\"></live-example>, which provides the routing for its companion domain NgModule `ContactModule`.\n+\n+<div class=\"alert is-helpful\">\n \n-## More on NgModules\n+For an overview and details about routing, see [In-app navigation: routing to views](guide/router \"In-app navigation: routing to views\").\n+\n+</div>\n+\n+Use a routing NgModule to do the following tasks:\n+\n+* Define routes.\n+* Add router configuration to the NgModule's import.\n+* Add guard and resolver service providers to the NgModule's providers.\n+\n+The name of the routing NgModule should parallel the name of its companion NgModule, using the suffix `Routing`.\n+For example, <code>ContactModule</code> in <code>contact.module.ts</code> has a routing NgModule named <code>ContactRoutingModule</code> in <code>contact-routing.module.ts</code>.\n+\n+Import a routing NgModule only into its companion NgModule.\n+If the companion NgModule is the root <code>AppModule</code>, the <code>AppRoutingModule</code> adds router configuration to its imports with <code>RouterModule.forRoot(routes)</code>.\n+All other routing NgModules are children that import <code>RouterModule.forChild(routes)</code>.\n+\n+In your routing NgModule, re-export the <code>RouterModule</code> as a convenience so that components of the companion NgModule have access to router directives such as <code>RouterLink</code> and <code>RouterOutlet</code>.\n+\n+Don't use declarations in a routing NgModule.\n+Components, directives, and pipes are the responsibility of the companion domain NgModule, not the routing NgModule.\n+\n+{@a service}\n+\n+## Service NgModules\n+\n+Use a service NgModule to provide a utility service such as data access or messaging.\n+Ideal service NgModules consist entirely of providers and have no declarations.\n+Angular's `HttpClientModule` is a good example of a service NgModule.\n+\n+Use only the root `AppModule` to import service NgModules.\n+\n+{@a widget}\n+\n+## Widget NgModules\n+\n+Use a widget NgModule to make a component, directive, or pipe available to external NgModules.\n+Import widget NgModules into any NgModules that need the widgets in their templates.\n+Many third-party UI component libraries are provided as widget NgModules.\n+\n+A widget NgModule should consist entirely of declarations, most of them exported.\n+It would rarely have providers.\n+\n+{@a shared}\n+\n+## Shared NgModules\n+\n+Put commonly used directives, pipes, and components into one NgModule, typically named `SharedModule`, and then import just that NgModule wherever you need it in other parts of your app.\n+You can import the shared NgModule in your domain NgModules, including [lazy-loaded NgModules](guide/lazy-loading-ngmodules \"Lazy-loading an NgModule\").\n+One example is `SharedModule` in the <live-example name=\"ngmodules\"></live-example>, which provides the `AwesomePipe` custom pipe and `HighlightDirective` directive.\n+\n+Shared NgModules should not include providers, nor should any of its imported or re-exported NgModules include providers.\n+\n+To learn how to use shared modules to organize and streamline your code, see [Sharing NgModules in an app](guide/sharing-ngmodules \"Sharing NgModules in an app\").\n+\n+## Next steps\n \n You may also be interested in the following:\n-* [Lazy Loading Modules with the Angular Router](guide/lazy-loading-ngmodules).\n-* [Providers](guide/providers).\n+\n+* For more about NgModules, see [Organizing your app with NgModules](guide/ngmodules \"Organizing your app with NgModules\").\n+* To learn more about the root NgModule, see [Launching an app with a root NgModule](guide/bootstrapping \"Launching an app with a root NgModule\").\n+* To learn about frequently used Angular NgModules and how to import them into your app, see [Frequently-used modules](guide/frequent-ngmodules \"Frequently-used modules\").\n+* For a complete description of the NgModule metadata properties, see [Using the NgModule metadata](guide/ngmodule-api \"Using the NgModule metadata\").\n+\n+If you want to manage NgModule loading and the use of dependencies and services, see the following:\n+\n+* To learn about loading NgModules eagerly when the app starts, or lazy-loading NgModules asynchronously by the router, see [Lazy-loading feature modules](guide/lazy-loading-ngmodules).\n+* To understand how to provide a service or other dependency for your app, see [Providing Dependencies for an NgModule](guide/providers \"Providing Dependencies for an NgModule\").\n+* To learn how to create a singleton service to use in NgModules, see [Making a service a singleton](guide/singleton-services \"Making a service a singleton\")."
        }
    ],
    "stats": {
        "total": 258,
        "additions": 153,
        "deletions": 105
    }
}