{
    "author": "IgorMinar",
    "message": "ci: decrease the minBodyLength commit message limit to 20 chars (#37949)\n\nThe motivation behind this change is to improve the productivity in the angular/angular repo\nwithout sacrificing the original goal of having better understanding of changes within\nthe repo.\n\nWhen the minBodyLength limit was originally introduced the goal was simple: force\ncommitters to provide more contextual information for each change coming into the\nrepo. Too often we found ourselves in a situation where nobody understood what\nmotivated some of the changes and we needed more contextual info to know if the\nchange was correct, desirable, and still relevant (at a later point in time).\n\nWhen the limit was introduced, we needed to pick a minimum body length - given no\ndata, and frustration with even big changes being committed with just a words in\nthe subject (along the lines of \"fix(core): fixing a bug\"), we overcompensated\nand started off with a really high bar of minBodyLength set to 100 chars.\n\nThis turned out to be impractical and created a big friction point in making valid\nchanges in the angular/angular repo, and in fact caused some of the refactorings\nand smaller changes to be either skipped or combined into other commits which\nincreased the burden for code reviewers.\n\nThe evidence in the friction points can be seen in the number of PRs that fail to pass\nthe current lint check on the first try, but more importantly also in the \"creative\"\nwriting that some of the committers are forced to resort to in order to satisfy the\ncurrent checks. Examples:\n\n- https://github.com/angular/angular/commit/286fbf42c65a02e6da7420cd19a2c5baff3f2656\n- https://github.com/angular/angular/commit/b2816a1536075397d876ba27ce2b7dcd785d4a39\n\nGiven that we primarily care to document the motivation behind each change\n(the answer to the ultimate question: WHY?), I've collected several *common* &\n*valid* commit messages that are minimalistic and capture the WHY sufficiently:\n\n```\nRefactoring for readability.  => 28 chars\nImproving variable naming.    => 26 chars\nAdditional test coverage.     => 25 chars\nCleaning up the code.         => 21 chars\nSimplified the code.          => 20 chars\n```\n\nThese commit message bodies in addition to the commit message subject should\nsufficiently satisfy the need to capture the context and motivation behind each\nchange without creating an undue burden on committers.\n\nExample minimalistic commit message:\n\n------\n\nrefactor(core): cleanup the expression parser\n\nSimplifying the code.\n\n----\n\nGiven this research, I'm decreasing the minBodyLenth in angular/angular to 20 chars.\n\nThe commit message quality can be additionally improved by implementing a commit message\ntemplate via `.gitmessage` that will guide the committers in following our commit message\nguidelines via instructions provided in the form of in-the-flow help rather than as an after\nthe fact lint check.\n\nMore info: https://thoughtbot.com/blog/better-commit-messages-with-a-gitmessage-template\n\nI'm intentionally deferring such change for a separate PR as not to complicate or delay the\nminBodyLength limit decrease.\n\nPR Close #37949",
    "sha": "d0c0f25a480ea02034a8d21df395bf3e03855fab",
    "files": [
        {
            "sha": "5fcee181b92fd82748b2ce9cbd11e032224fb052",
            "filename": ".ng-dev/config.ts",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/angular/angular/blob/d0c0f25a480ea02034a8d21df395bf3e03855fab/.ng-dev%2Fconfig.ts",
            "raw_url": "https://github.com/angular/angular/raw/d0c0f25a480ea02034a8d21df395bf3e03855fab/.ng-dev%2Fconfig.ts",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/.ng-dev%2Fconfig.ts?ref=d0c0f25a480ea02034a8d21df395bf3e03855fab",
            "patch": "@@ -3,7 +3,7 @@ import {MergeConfig} from '../dev-infra/pr/merge/config';\n // The configuration for `ng-dev commit-message` commands.\n const commitMessage = {\n   'maxLength': 120,\n-  'minBodyLength': 100,\n+  'minBodyLength': 20,\n   'minBodyLengthTypeExcludes': ['docs'],\n   'types': [\n     'build',"
        }
    ],
    "stats": {
        "total": 2,
        "additions": 1,
        "deletions": 1
    }
}