{
    "author": "josephperrott",
    "message": "docs: reword a few phrases in the GITHUB_PROCESS.md doc (#41977)\n\nReword a few things in the explanation around our `Feature request process` to make\nthe process a little clearer.\n\nPR Close #41977",
    "sha": "e29eb8abfbfdfb793e08ac88e14b7ba6d2ff2136",
    "files": [
        {
            "sha": "9e539311f382549bc39f9f944ac8119dd0d15b11",
            "filename": "docs/GITHUB_PROCESS.md",
            "status": "modified",
            "additions": 11,
            "deletions": 10,
            "changes": 21,
            "blob_url": "https://github.com/angular/angular/blob/e29eb8abfbfdfb793e08ac88e14b7ba6d2ff2136/docs%2FGITHUB_PROCESS.md",
            "raw_url": "https://github.com/angular/angular/raw/e29eb8abfbfdfb793e08ac88e14b7ba6d2ff2136/docs%2FGITHUB_PROCESS.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/docs%2FGITHUB_PROCESS.md?ref=e29eb8abfbfdfb793e08ac88e14b7ba6d2ff2136",
            "patch": "@@ -1,6 +1,6 @@\n <a name=\"conversation-locking\"></a>\n # Automatic conversation locking\n-Closed issues and pull requests are locked automatically after 30 days of inactivity. \n+Closed issues and pull requests are locked automatically after 30 days of inactivity.\n \n ## I want to comment on a locked conversation, what should I do?\n When an issue has been closed and inactive for over 30 days, the original context is likely outdated.\n@@ -17,26 +17,27 @@ providing any of the additional information the team needs to investigate.\n # Feature request process\n \n To manage the requests we receive at scale, we introduced automation in our feature request\n-management process. After we triage a ticket and we identify it as a feature request, it goes\n+management process. After we triage an issue and we identify it as a feature request, it goes\n through several steps.\n \n ## Manual review\n \n-First, we manually review to verify if it aligns with any of the existing roadmap efforts. If it\n-does, we prioritize it. Alternatively, we keep it open and our feature request bot initiates a\n-voting process.\n+First, we manually review the issue to see if it aligns with any of the existing roadmap efforts. If\n+it does, we prioritize it accordingly. Alternatively, we keep it open and our feature request bot\n+initiates a voting process.\n \n ## Voting phase\n \n To include the community in the feature request process, we open voting for 60 days. Anyone can cast\n-a vote for the request with a thump-up (👍) reaction. If the feature request reaches 20 or more\n-upvotes, we review it again manually. Alternatively, the bot closes the request.\n+a vote for the request with a thumbs-up (👍) reaction. When a feature request reaches 20 or more\n+upvotes, we formally consider the feature request. Alternatively, the bot closes the request.\n \n ## Consideration phase\n \n-If the feature request receives 20 or more votes, we verify if we can afford to maintain it and\n-whether it aligns with the long-term vision of Angular. If the answers of both questions are yes,\n-we prioritize the request, alternatively we close it.\n+If the feature request receives 20 or more votes, we verify the Angular team can afford to maintain\n+the feature and whether it aligns with the long-term vision of Angular. If the answers to both of\n+these questions are yes, we prioritize the request, alternatively we close it with an explanation of\n+our decision.\n \n ## Diagram\n "
        }
    ],
    "stats": {
        "total": 21,
        "additions": 11,
        "deletions": 10
    }
}