{
    "author": "mikzat",
    "message": "docs(forms): reduce ambiguity in forms data flow wording (#41900)\n\nPR Close #41900",
    "sha": "f12d0675393b7d05925c70fc8e23500246f3973f",
    "files": [
        {
            "sha": "15d26cb2d6851e4db0625e05189cf2574e267bc0",
            "filename": "aio/content/guide/forms-overview.md",
            "status": "modified",
            "additions": 11,
            "deletions": 4,
            "changes": 15,
            "blob_url": "https://github.com/angular/angular/blob/f12d0675393b7d05925c70fc8e23500246f3973f/aio%2Fcontent%2Fguide%2Fforms-overview.md",
            "raw_url": "https://github.com/angular/angular/raw/f12d0675393b7d05925c70fc8e23500246f3973f/aio%2Fcontent%2Fguide%2Fforms-overview.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fforms-overview.md?ref=f12d0675393b7d05925c70fc8e23500246f3973f",
            "patch": "@@ -36,19 +36,19 @@ The table below summarizes the key differences between reactive and template-dri\n ||Reactive|Template-driven|\n |--- |--- |--- |\n |[Setup of form model](#setup) | Explicit, created in component class | Implicit, created by directives |\n-|[Data model](#data-flow-in-forms) | Structured and immutable | Unstructured and mutable |\n-|Predictability | Synchronous | Asynchronous |\n+|[Data model](#mutability-of-the-data-model) | Structured and immutable | Unstructured and mutable |\n+|[Data flow](#data-flow-in-forms) | Synchronous | Asynchronous |\n |[Form validation](#validation) | Functions | Directives |\n \n ### Scalability\n \n If forms are a central part of your application, scalability is very important. Being able to reuse form models across components is critical.\n \n-Reactive forms are more scalable than template-driven forms. They provide direct access to the underlying form API, and synchronous access to the form data model, making creating large-scale forms easier.\n+Reactive forms are more scalable than template-driven forms. They provide direct access to the underlying form API, and use [synchronous data flow](#data-flow-in-reactive-forms) between the view and the data model, which makes creating large-scale forms easier.\n Reactive forms require less setup for testing, and testing does not require deep understanding of change detection to properly test form updates and validation.\n \n Template-driven forms focus on simple scenarios and are not as reusable.\n-They abstract away the underlying form API, and provide only asynchronous access to the form data model.\n+They abstract away the underlying form API, and use [asynchronous data flow](#data-flow-in-template-driven-forms) between the view and the data model.\n The abstraction of template-driven forms also affects testing.\n Tests are deeply reliant on manual change detection execution to run properly, and require more setup.\n \n@@ -119,6 +119,8 @@ Similarly, when the program logic changes values in the data model, those values\n Reactive and template-driven forms differ in how they handle data flowing from the user or from programmatic changes.\n The following diagrams illustrate both kinds of data flow for each type of form, using the favorite-color input field defined above.\n \n+{@a data-flow-in-reactive-forms}\n+\n ### Data flow in reactive forms\n \n In reactive forms each form element in the view is directly linked to the form model (a `FormControl` instance). Updates from the view to the model and from the model to the view are synchronous and do not depend on how the UI is rendered.\n@@ -146,6 +148,8 @@ The model-to-view diagram shows how a programmatic change to the model is propag\n   <img src=\"generated/images/guide/forms-overview/dataflow-reactive-forms-mtv.png\" alt=\"Reactive forms data flow - model to view\">\n </div>\n \n+{@a data-flow-in-template-driven-forms}\n+\n ### Data flow in template-driven forms\n \n In template-driven forms, each form element is linked to a directive that manages the form model internally.\n@@ -181,6 +185,8 @@ The model-to-view diagram shows how data flows from model to view when the `favo\n   <img src=\"generated/images/guide/forms-overview/dataflow-td-forms-mtv.png\" alt=\"Template-driven forms data flow - model to view\" width=\"100%\">\n </div>\n \n+{@a mutability-of-the-data-model}\n+\n ### Mutability of the data model\n \n The change-tracking method plays a role in the efficiency of your application.\n@@ -201,6 +207,7 @@ The difference is demonstrated in the previous examples that use the favorite-co\n * With template-driven forms, the **favorite color property** is always modified to its new value.\n \n {@a validation}\n+\n ## Form validation\n \n Validation is an integral part of managing any set of forms. Whether you're checking for required fields or querying an external API for an existing username, Angular provides a set of built-in validators as well as the ability to create custom validators."
        },
        {
            "sha": "528b35782cf9400faec948dad37003883cc88ff3",
            "filename": "aio/content/guide/reactive-forms.md",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/angular/angular/blob/f12d0675393b7d05925c70fc8e23500246f3973f/aio%2Fcontent%2Fguide%2Freactive-forms.md",
            "raw_url": "https://github.com/angular/angular/raw/f12d0675393b7d05925c70fc8e23500246f3973f/aio%2Fcontent%2Fguide%2Freactive-forms.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Freactive-forms.md?ref=f12d0675393b7d05925c70fc8e23500246f3973f",
            "patch": "@@ -24,7 +24,7 @@ Reactive forms use an explicit and immutable approach to managing the state of a\n \n Reactive forms also provide a straightforward path to testing because you are assured that your data is consistent and predictable when requested. Any consumers of the streams have access to manipulate that data safely.\n \n-Reactive forms differ from [template-driven forms](guide/forms \"Template-driven forms guide\") in distinct ways. Reactive forms provide more predictability with synchronous access to the data model, immutability with observable operators, and change tracking through observable streams.\n+Reactive forms differ from [template-driven forms](guide/forms \"Template-driven forms guide\") in distinct ways. Reactive forms provide synchronous access to the data model, immutability with observable operators, and change tracking through observable streams.\n \n Template-driven forms allow direct access to modify data in your template, but are less explicit than reactive forms because they rely on directives embedded in the template, along with mutable data to track changes asynchronously. See the [Forms Overview](guide/forms-overview \"Overview of Angular forms.\") for detailed comparisons between the two paradigms.\n "
        }
    ],
    "stats": {
        "total": 17,
        "additions": 12,
        "deletions": 5
    }
}