{
    "author": "mgechev",
    "message": "docs: remove reference to an obsolete design doc (#42842)\n\nThe type checking design document is no longer relevant. This PR\nremoves the reference to it. Close #42424.\n\nPR Close #42842",
    "sha": "f5baa55b817a1ad2197ed100ca10b77c975201df",
    "files": [
        {
            "sha": "5dfc2a13b1424b6c4fc41f1b7066b750f55cadf9",
            "filename": "packages/compiler/design/architecture.md",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/angular/angular/blob/f5baa55b817a1ad2197ed100ca10b77c975201df/packages%2Fcompiler%2Fdesign%2Farchitecture.md",
            "raw_url": "https://github.com/angular/angular/raw/f5baa55b817a1ad2197ed100ca10b77c975201df/packages%2Fcompiler%2Fdesign%2Farchitecture.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/packages%2Fcompiler%2Fdesign%2Farchitecture.md?ref=f5baa55b817a1ad2197ed100ca10b77c975201df",
            "patch": "@@ -296,7 +296,7 @@ Type guards require determining which directives apply to an element to determin\n \n Correctly typing an expression that includes a pipe requires determining the result type of the `transform` method of the type.\n \n-Additionally, more advanced type-checking as described in [Type Checking Templates](https://goo.gl/Q3tSgP) also requires determining the types of the directives that apply to an element as well as how the attributes map to the properties of the directives.\n+Additionally, more advanced type-checking also requires determining the types of the directives that apply to an element as well as how the attributes map to the properties of the directives.\n \n The types of directives can be found using a selector scope as described for reference inversion. Once a selector scope is produced, the component and directives that apply to an element can be determined from the selector scope. The `.d.ts` changes described above also includes the attribute to property maps. The `TypeGuard`s are recorded as static fields that are included in the `.d.ts` file of the directive.\n "
        }
    ],
    "stats": {
        "total": 2,
        "additions": 1,
        "deletions": 1
    }
}