{
    "author": "kapunahelewong",
    "message": "docs: update docs-style-guide (#36281)\n\nThis commit updates the documentation style guide\nso that it is in line with current standards, those\nof Google as well as those within the Angular docs.\n\nPR Close #36281",
    "sha": "f76f2eb38157c1c24166c0aed5ab5386b6dcb069",
    "files": [
        {
            "sha": "64f4f2649215d2b49bd67fbf1991f47a2ef3ef91",
            "filename": "aio/content/examples/docs-style-guide/src/app/not-great.component.ts",
            "status": "added",
            "additions": 13,
            "deletions": 0,
            "changes": 13,
            "blob_url": "https://github.com/angular/angular/blob/f76f2eb38157c1c24166c0aed5ab5386b6dcb069/aio%2Fcontent%2Fexamples%2Fdocs-style-guide%2Fsrc%2Fapp%2Fnot-great.component.ts",
            "raw_url": "https://github.com/angular/angular/raw/f76f2eb38157c1c24166c0aed5ab5386b6dcb069/aio%2Fcontent%2Fexamples%2Fdocs-style-guide%2Fsrc%2Fapp%2Fnot-great.component.ts",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fexamples%2Fdocs-style-guide%2Fsrc%2Fapp%2Fnot-great.component.ts?ref=f76f2eb38157c1c24166c0aed5ab5386b6dcb069",
            "patch": "@@ -0,0 +1,13 @@\n+import { Component } from '@angular/core';\n+\n+@Component({\n+  selector: 'app-not-great',\n+})\n+// #docregion not-great\n+export class NotGreatComponent {\n+\n+  buggyFunction() {\n+    // things could be better here...\n+  }\n+}\n+// #enddocregion not-great"
        },
        {
            "sha": "446a46848fbc8632bee41656efdb99a20f39747b",
            "filename": "aio/content/guide/docs-style-guide.md",
            "status": "modified",
            "additions": 581,
            "deletions": 543,
            "changes": 1124,
            "blob_url": "https://github.com/angular/angular/blob/f76f2eb38157c1c24166c0aed5ab5386b6dcb069/aio%2Fcontent%2Fguide%2Fdocs-style-guide.md",
            "raw_url": "https://github.com/angular/angular/raw/f76f2eb38157c1c24166c0aed5ab5386b6dcb069/aio%2Fcontent%2Fguide%2Fdocs-style-guide.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/aio%2Fcontent%2Fguide%2Fdocs-style-guide.md?ref=f76f2eb38157c1c24166c0aed5ab5386b6dcb069",
            "patch": "@@ -1,242 +1,170 @@\n # Angular documentation style guide\n-<!-- formerly Authors Style Guide -->\n \n-This style guide is for anyone who contributes to the Angular documentation (this site).\n-These guidelines should be followed by all authors.\n-Deviations must be approved by a documentation editor.\n+This style guide covers the standards for writing [Angular documentation on angular.io](https://angular.io/docs).\n+These standards ensure consistency in writing style, Markdown conventions, and code snippets.\n \n-The guidelines described here serve two purposes:\n+## Prerequisites\n \n-* To ensure a high-quality, consistent experience for Angular documentation users.\n+Before contributing to the Angular documentation, it is helpful if you are familiar with the following:\n \n-* To simplify the writing process for contributing authors.\n-This guide helps you make decisions about tone, voice, and style.\n-It also helps you find the right markup quickly.\n+* `git`: for an introduction, see GitHub's [Git Handbook](https://guides.github.com/introduction/git-handbook/)\n+* `GitHub`: for an introduction, see GitHub's [Hello World](https://guides.github.com/activities/hello-world/)\n+* Markdown: see GitHub's [Mastering Markdown](https://guides.github.com/features/mastering-markdown/)\n+* Angular coding style: see the [Angular Style Guide](guide/styleguide \"Angular Application Code Style Guide\")\n+* Google writing style: The [Google Developer Documentation Style Guide](https://developers.google.com/style/) is a comprehensive resource that this Angular documentation style guide builds upon.\n \n+## Kinds of Angular documentation\n \n-<div class=\"alert is-helpful\">\n-\n-This guide is a *living document*; it changes over time.\n-We strive for consistency to the extent feasible, but you may find parts of our documentation that don't match this style guide.\n-When in doubt, **follow this guide rather than imitating existing documents.**\n-\n-</div>\n-\n-## Scope of these guidelines\n-\n-We ask all contributing authors to adhere to three aspects of style:\n-\n-\n-* **Writing style:** Word usage, grammar, capitalization, and punctuation.\n-Adherence to Angular's writing guidelines ensures a consistent \"voice\", helps ensure accuracy of the information, and facilitates use world-wide, by audiences with different backgrounds.\n-\n-\n-* **Markup style:** How to include images, tables, alert boxes, and code snippets.\n-Angular docs are written in Markdown, with custom extensions for this site. Correct markup ensures a consistent look-and-feel, and is essential for the doc to build and function correctly.\n-\n-\n-* **Angular coding style:** Coding style for example apps and code snippets.\n-Code examples are encouraged for demonstrating how to apply the concepts and features discussed.\n-Angular has a custom framework that enables authors to include code snippets directly from example apps that are automatically tested as part of doc builds.\n-To contribute example code, you must understand Angular itself and the custom framework for Angular doc examples.\n-\n-For each aspect of style, the following table explains where to find the primary guidelines and what this Angular Documentation Style Guide offers.\n-\n-\n-Style                    | Guidelines\n------------------------- | -------------------------------\n-**Writing style**        | Primary: [Google Developer Documentation Style Guide](https://developers.google.com/style/)<br />This guide: Specifies any special considerations for Angular docs.\n-**Markup style**         | Primary: This guide<br />This guide: Specifies guidelines for markup of guides and tutorials, which are written primarily in Markdown.\n-**Angular coding style** | Primary: [Angular Style Guide](guide/styleguide \"Angular Application Code Style Guide\").<br />This guide: How to create, store, and include code examples in guides and tutorials.\n-\n-<div class=\"alert is-helpful\">\n-\n-Note: Angular API and CLI reference docs are generated from source code and/or related source files, which may have other markup styles and other ways of including code examples.\n-\n-</div>\n+The categories of Angular documentation include:\n \n+* [Guides](docs): much of what's in the [documentation section of angular.io](docs).\n+Guides walk the reader step-by-step through tasks to demonstrate concepts and are often accompanied by a working example.\n+These include [Getting Started](start), [Tour of Heroes](tutorial), and pages about [Forms](guide/forms-overview), [Dependency Injection](guide/dependency-injection), and [HttpClient](guide/http).\n+Contributing members of the community and Angular team members maintain this documentation in [Markdown](https://daringfireball.net/projects/markdown/syntax \"Markdown\").\n+* [API documentation](api): reference documents for the [Angular Application Programming Interface, or API](api).\n+These are more succinct than guides and serve as a reference for Angular features.\n+They are especially helpful for people already acquainted with Angular concepts.\n+The [angular.io](https://angular.io/) infrastructure generates these documents from source code and comments that contributors edit.\n+* [CLI documentation](cli): the [angular.io](https://angular.io/) infrastructure generates these documents from CLI source code.\n \n-## Doc generation and tooling\n \n-To make changes to the documentation pages and sample code, clone the [Angular github repository](https://github.com/angular/angular \"Angular repo\") and go to the `aio/` folder.\n-\n-The [aio/README.md](https://github.com/angular/angular/blob/master/aio/README.md \"AIO ReadMe\") explains how to install and use the tools to edit and test your changes.\n-\n-Here are a few essential commands for guide page authors.\n-\n-1. `yarn setup` &mdash; installs packages; builds docs, stackblitz, and zips.\n-\n-1. `yarn docs-watch --watch-only` &mdash; watches for saved content changes and refreshes the browser. The (optional) `--watch-only` flag skips the initial docs rebuild.\n-\n-1. `yarn start`  &mdash;  starts the doc viewer application so you can see your local changes in the browser.\n-\n-1.  http://localhost:4200/  &mdash;  browse to the app running locally.\n-\n-You can combine `yarn docs-watch` and `yarn start` into one command with `yarn serve-and-sync`.\n-\n-## Guide pages\n-\n- All but a few guide pages are [markdown](https://daringfireball.net/projects/markdown/syntax \"markdown\") files with an `.md` extension.\n-\n-Every guide page file is stored in the `content/guide` directory. Although the [side navigation](#navigation) panel displays as a hierarchy, the directory is flat with no sub-folders.\n-The flat folder approach allows us to shuffle the apparent navigation structure without moving page files or redirecting old page URLs.\n-\n-The doc generation process consumes the markdown files in the `content/guide` directory and produces JSON files in the `src/generated/docs/guide` directory, which is also flat. Those JSON files contain a combination of document metadata and HTML content.\n-\n-The reader requests a page by its Page URL. The doc viewer fetches the corresponding JSON file, interprets it, and renders it as fully-formed HTML page.\n-\n-Page URLs mirror the `content` file structure. The URL for the page of a guide is in the form `guide/{page-name}`. The page for _this_ \"Authors Style Guide\" is located at `content/guide/docs-style-guide.md` and its URL is `guide/docs-style-guide`.\n+## Markdown and HTML\n \n+While the Angular guides are [Markdown](https://daringfireball.net/projects/markdown/syntax \"Markdown\") files, there are some sections within the guides that use HTML.\n \n <div class=\"alert is-helpful\">\n \n-_Tutorial_ pages are exactly like guide pages. The only difference is that they reside in `content/tutorial` instead of `content/guide` and have URLs like `tutorial/{page-name}`.\n-\n-_API_ pages are generated from Angular source code into the `src/generated/docs/api` directory.\n-The doc viewer translates URLs that begin `api/` into requests for document JSON files in that directory. This style guide does not discuss creation or maintenance of API pages.\n-\n-_Marketing_ pages are similar to guide pages. They're located in the `content/marketing` directory. While they can be markdown files, they may be static HTML pages or dynamic HTML pages that render with JSON data.\n-\n-Only a few people are authorized to write marketing pages. This style guide does not discuss creation or maintenance of marketing pages.\n+  To enable HTML in an Angular guide, **always** follow every opening and closing HTML tag with a blank line.\n \n </div>\n \n-## Markdown and HTML\n-\n-While documentation guide pages ultimately render as HTML, almost all of them are written in [markdown](https://daringfireball.net/projects/markdown/syntax \"markdown\").\n-\n-Markdown is easier to read and to edit than HTML. Many editors (including Visual Studio Code) can render markdown as you type it.\n-\n-From time to time you'll have to step away from markdown and write a portion of the document in HTML. Markdown allows you to mix HTML and markdown in the same document.\n-\n-Standard markdown processors don't allow you to put markdown _within_ HTML tags. But the Angular documentation markdown processor **supports markdown within HTML**, as long as you follow one rule:\n-\n-<div class=\"alert is-critical\">\n-\n-**Always** follow every opening and closing HTML tag with _a blank line_.\n-\n-</div>\n+Notice the required blank line after the opening `<div>` in the following example:\n \n ```html\n-<div class=\"alert is-critical\">\n+<div class=\"alert is-helpful\">\n \n   **Always** follow every opening and closing HTML tag with _a blank line_.\n \n </div>\n ```\n \n-<div class=\"alert is-helpful\">\n-\n-  It is customary but not required to _precede_ the _closing HTML_ tag with a blank line as well.\n-\n-</div>\n+It is customary but not required to precede the closing HTML tag with a blank line as well.\n \n ## Title\n \n-Every guide document must have a title.\n+Every guide document must have a title, and it should appear at the top of the page.\n \n-The title should appear at the top of the physical page.\n-Begin the title with the markdown `#` character. Alternatively, you can write the equivalent `<h1>`.\n+Begin the title with the Markdown `#` character, which renders as an `<h1>` in the browser.\n \n ```html\n   # Angular documentation style guide\n ```\n \n-**Only one title (`<h1>`) per document!**\n+**A document can have only one `<h1>`.**\n \n-Title text should be in \"Sentence case\", which means the first word is capitalized and all other words are lower case (unless they are technical terms that are always capitalized, like \"Angular\").\n+Title text should be in _Sentence case_, which means the first word is capitalized and all other words are lower case.\n+Technical terms that are always capitalized, like \"Angular\", are the exception.\n \n ```html\n   # Deprecation policy in Angular\n ```\n \n **Always follow the title with at least one blank line.**\n \n-Note that the corresponding left-nav TOC text should be in \"title case\", which means that you use capital letters to start the first words and all principal words. Use lower case letters for secondary words such as \"in\", \"of\", and \"the\". The TOC title can also be shortened to fit in the column.\n+The corresponding text in the left nav is in _Title Case_, which means that you use capital letters to start the first words and all principal words.\n+Use lower case letters for secondary words such as \"in\", \"of\", and \"the\".\n+You can also shorten the nav title to fit in the column.\n \n ## Sections\n \n-A typical document is divided into sections.\n+A typical document has sections.\n+\n+All section headings are in _Sentence case_, which means the first word is capitalized and all other words are lower case.\n \n-All heading text should be in \"Sentence case\", which means the first word is capitalized and all other words are lower case.\n+**Always follow a section heading with at least one blank line.**\n \n-**Always follow the section heading with at least one blank line.**\n+### Main section heading\n \n-<h2 class=\"no-toc\">\n-Main section heading\n-</h2>\n There are usually one or more main sections that may be further divided into secondary sections.\n \n-Begin a main section heading with the markdown `##` characters. Alternatively, you can write the equivalent `<h2>` HTML tag.\n+Begin a main section heading with the Markdown `##` characters, which renders as an `<h2>` in the browser.\n \n-The main section heading should be followed by a blank line and then the content for that heading.\n+Follow main section headings with a blank line and then the content for that heading as in the following example:\n \n ```html\n-  ## Sections\n+  ## Main section heading\n \n-  A typical document is divided into sections.\n+  Content after a blank line.\n ```\n \n-<h3 class=\"no-toc\">\n-Secondary section heading\n-</h3>\n+### Secondary section heading\n \n-A secondary section heading is related to a main heading and _falls textually within_ the bounds of that main heading.\n+A secondary section heading is related to a main heading and falls textually within the bounds of that main heading.\n \n-Begin a secondary heading with the markdown `###` characters. Alternatively, you can write the equivalent `<h3>` HTML tag.\n+Begin a secondary heading with the Markdown `###` characters, which renders as an `<h3>` in the browser.\n \n-The secondary heading should be followed by a blank line and then the content for that heading.\n+Follow a secondary heading by a blank line and then the content for that heading as in the following example:\n \n ```html\n   ### Secondary section heading\n \n-  A secondary section ...\n+  Content after a blank line.\n ```\n \n-#### Additional section headings\n-\n-Try to minimize the heading depth, preferably only two. But more headings, such as this one, are permitted if they make sense.\n+### Additional section headings\n \n-**N.B.**:  The [Table-of-contents](#table-of-contents) generator only considers main (`<h2>`) and secondary (`<h3>`) headings.\n+While you can use additional section headings, the [Table-of-contents (TOC)](#table-of-contents) generator only shows `<h2>` and `<h3>` headings in the TOC on the right of the page.\n \n ```html\n-  #### Additional section headings\n+  #### The TOC won't display this\n \n-  Try to minimize ...\n+  Content after a blank line.\n ```\n \n ## Table of contents\n \n-Most pages display a table of contents (TOC). The TOC appears in the right panel when the viewport is wide. When narrow, the TOC appears in an expandable/collapsible region near the top of the page.\n+Most pages display a table of contents or TOC.\n+The TOC appears in the right panel when the viewport is wide.\n+When narrow, the TOC appears in a collapsible region near the top of the page.\n \n-You should not create your own TOC by hand. The TOC is generated automatically from the page's main and secondary section headers.\n+You don't need to create your own TOC by hand because the TOC generator creates one automatically from the page's  `<h2>` and `<h3>` headers.\n \n-To exclude a heading from the TOC, create the heading as an `<h2>` or `<h3>` element with a class called 'no-toc'. You can't do this with markdown.\n+To exclude a heading from the TOC, create the heading as an `<h2>` or `<h3>` element with a class called 'no-toc'.\n \n ```html\n <h3 class=\"no-toc\">\n+\n This heading is not displayed in the TOC\n+\n </h3>\n ```\n \n-You can turn off TOC generation for the _entire_ page by writing the title with an `<h1>` tag and the `no-toc` class.\n+You can turn off TOC generation for the entire page by writing the title with an `<h1>` tag and the `no-toc` class.\n \n ```html\n <h1 class=\"no-toc\">\n+\n A guide without a TOC\n+\n </h1>\n ```\n \n ## Navigation\n \n-The navigation links at the top, left, and bottom of the screen are generated from the JSON configuration file, `content/navigation.json`.\n+To generate the navigation links at the top, left, and bottom of the screen, use the JSON configuration file, `content/navigation.json`.\n+\n+<div class=\"alert is-helpful\">\n+\n+If you have an idea that would result in navigation changes, [file an issue](https://github.com/angular/angular/issues/new/choose) first so that the Angular team and community can discuss the change.\n \n-The authority to change the `navigation.json` file is limited to a few core team members.\n-But for a new guide page, you should suggest a navigation title and position in the left-side navigation panel called the \"side nav\".\n+</div>\n \n-Look for the `SideNav` node in `navigation.json`. The `SideNav` node is an array of navigation nodes. Each node is either an _item_ node for a single document or a _header_ node with child nodes.\n+For a new guide page, edit the `SideNav` node in `navigation.json`.\n+The `SideNav` node is an array of navigation nodes.\n+Each node is either an item node for a single document or a header node with child nodes.\n \n-Find the header for your page. For example, a guide page that describes an Angular feature is probably a child of the `Fundamentals` header.\n+Find the header for your page.\n+For example, a guide page that describes an Angular feature is probably a child of the `Fundamentals` header.\n \n ```html\n {\n@@ -246,57 +174,50 @@ Find the header for your page. For example, a guide page that describes an Angul\n }\n ```\n \n-A _header_ node child can be an _item_ node or another _header_ node. If your guide page belongs under a sub-header, find that sub-header in the JSON.\n+A header node child can be an item node or another header node.\n+If your guide page belongs under a sub-header, find that sub-header in the JSON.\n \n-Add an _item_ node for your guide page as a child of the appropriate _header_ node. It probably looks something like this one.\n+Add an item node for your guide page as a child of the appropriate header node as in the following example:\n \n ```html\n-{\n-  \"url\": \"guide/architecture\",\n-  \"title\": \"Architecture\",\n-  \"tooltip\": \"The basic building blocks of Angular applications.\"\n-}\n+  {\n+    \"url\": \"guide/docs-style-guide\",\n+    \"title\": \"Doc authors style guide\",\n+    \"tooltip\": \"Style guide for documentation authors.\",\n+  },\n ```\n \n A navigation node has the following properties:\n \n-* `url`- the URL of the guide page (_item node only_).\n+* `url`: the URL of the guide page, which is an item node only.\n \n-* `title`- the text displayed in the side nav.\n+* `title`: the text displayed in the side nav.\n \n-* `tooltip` - text that appears when the reader hovers over the navigation link.\n+* `tooltip`: text that appears when the reader hovers over the navigation link.\n \n-* `children` - an array of child nodes (_header node only_).\n-\n-* `hidden` - defined and set true if this is a guide page that should _not_ be displayed in the navigation panel. Rarely needed, it is a way to hide the page from navigation while making it available to readers who should know about it. _This_ \"Authors Style Guide\" is a hidden page.\n+* `children`: an array of child nodes, which is a header node only.\n \n+* `hidden`: defined and set `true` if this is a guide page that should not be displayed in the navigation panel.\n \n <div class=\"alert is-critical\">\n \n-Do not create a node that is both a _header_ and an _item_ node. That is, do not specify the `url` property of a _header_ node.\n+Do not create a node that is both a header and an item node by specifying the `url` property of a header node.\n \n </div>\n \n-\n-<div class=\"alert is-critical\">\n-\n-The current guidelines allow for a three-level navigation structure with two header levels. Don't add a third header level.\n-\n-</div>\n-\n-\n ## Code snippets\n \n-Guides are rich in examples of working Angular code. Example code can be commands entered in a terminal window, a fragment of TypeScript or HTML, or an entire code file.\n+[Angular.io](https://angular.io/docs) has a custom framework that enables authors to include code snippets directly from working example apps that are automatically tested as part of documentation builds.\n \n-Whatever the source, the doc viewer renders them as \"code snippets\", either individually with the [_code-example_](#code-example \"code-example\") component or as a tabbed collection with the [_code-tabs_](#code-tabs \"code-tabs\") component.\n+In addition to working code snippets, example code can include terminal commands, a fragment of TypeScript or HTML, or an entire code file.\n \n+Whatever the source, the doc viewer renders them as code snippets, either individually with the [code-example](#code-example \"code-example\") component or as a tabbed collection with the [code-tabs](#code-tabs \"code-tabs\") component.\n \n {@a code-example}\n \n-### Code example\n+### When to use code font\n \n-You can display a simple, inline code snippet with the markdown backtick syntax.\n+You can display a minimal, inline code snippet with the Markdown backtick syntax.\n Use a single backtick on either side of a term when referring to code or the\n name of a file in a sentence.\n The following are some examples:\n@@ -305,115 +226,106 @@ The following are some examples:\n * The `name` property is `Sally`.\n * Add the component class name to the `declarations` array.\n \n-The markdown is as follows:\n+The Markdown is as follows:\n \n-```markdown\n+```md\n \n * In the `app.component.ts`, add a `logger()` method.\n * The <code class=\"no-auto-link\">item</code> property is `true`.\n * Add the component class name to the `declarations` array.\n \n ```\n-In certain cases, when you apply backticks around a term, it may auto-link to\n-the API documentation. If you do not intend the term to be a link, use the following\n-syntax:\n+\n+### Auto-linking in code snippets\n+\n+In certain cases, when you apply backticks around a term, it may auto-link to the API documentation.\n+If you do not intend the term to be a link, use the following syntax:\n \n ```html\n The <code class=\"no-auto-link\">item</code> property is `true`.\n ```\n \n-For block code snippets, we generally prefer to display code with\n-the Angular documentation _code-example_ component represented by the `<code-example>` tag.\n-The `<code-example>` tag has a `header` attribute that you use to identify the file that the example comes from. The header should be used whenever possible to establish the context of the example.\n-See [Code snippets and code examples](guide/docs-style-guide#code-snippets-and-code-samples) for more details.\n-\n-<h3 class=\"no-toc\">Inline code-snippets</h3>\n+### Hard-coded snippets\n \n-You should source code snippets [from working sample code](#from-code-samples) when possible.\n-But there are times when an inline snippet is the better choice.\n+Ideally, you should source code snippets [from working sample code](#from-code-samples), though there are times when an inline snippet is necessary.\n \n-For terminal input and output, put the content between `<code-example>` tags, set the CSS class to `code-shell`, and set the language attribute to `sh` as in this example.\n+For terminal input and output, place the content between `<code-example>` tags, set the CSS class to `code-shell`, and set the language attribute to `sh` as in this example:\n \n <code-example language=\"sh\" class=\"code-shell\">\n+\n   npm start\n+\n </code-example>\n \n ```html\n <code-example language=\"sh\" class=\"code-shell\">\n+\n   npm start\n+\n </code-example>\n ```\n \n-Inline, hand-coded snippets like this one are _not_ testable and, therefore, are intrinsically unreliable.\n-This example belongs to the small set of pre-approved, inline snippets that includes\n-user input in a command shell or the _output_ of some process.\n+Inline, hard-coded snippets like this one are not testable and, therefore, intrinsically unreliable.\n+This example belongs to the small set of pre-approved, inline snippets that includes user input in a command shell or the output of some process.\n \n-**Do not write inline code snippets** unless you have a good reason and the editor's permission to do so.\n In all other cases, code snippets should be generated automatically from tested code samples.\n \n-For hypothetical examples such as illustrations of configuration options in a JSON file, you should still use The `<code-example>` tag with the `header` attribute to identify the context.\n+For hypothetical examples such as illustrations of configuration options in a JSON file, use the `<code-example>` tag with the `header` attribute to identify the context.\n \n {@a from-code-samples}\n \n-<h3 class=\"no-toc\">Code snippets and code samples</h3>\n-\n-One of the documentation design goals is that guide page code snippets should be examples of real, working code.\n+### Compilable example apps\n \n-We meet this goal by displaying code snippets that are derived directly from standalone code samples, written specifically for these guide pages.\n+One of the Angular documentation design goals is that guide page code snippets be examples of working code.\n \n-The author of a guide page is responsible for the code sample that supports that page.\n-The author must also write end-to-end tests for the sample.\n+Authors meet this goal by displaying code snippets directly from working sample apps, written specifically for these guide pages.\n \n-Code samples are located in sub-folders of the `content/examples` directory of the `angular/angular` repository. An example folder name should be the same as the guide page it supports.\n+Find sample apps in sub-folders of the `content/examples` directory of the `angular/angular` repository.\n+An example folder name is often the same as the guide page it supports.\n \n <div class=\"alert is-helpful\">\n \n-A guide page might not have its own sample code. It might refer instead to a sample belonging to another page.\n+A guide page might not have its own sample code.\n+It might refer instead to a sample belonging to another page.\n \n </div>\n \n-The Angular CI process runs all end-to-end tests for every Angular PR. Angular re-tests the samples after every new version of a sample and every new version of Angular itself.\n+The Angular CI process runs all end-to-end tests for every Angular PR.\n+Angular re-tests the samples after every new version of a sample and every new version of Angular.\n \n-When possible, every snippet of code on a guide page should be derived from a code sample file. You tell the Angular documentation engine which code file - or fragment of a code file - to display by configuring `<code-example>` attributes.\n+When possible, every snippet of code on a guide page should be derived from a code sample file. You tell the Angular documentation engine which code file&mdash;or fragment of a code file&mdash;to display by configuring `<code-example>` attributes.\n \n-#### Code snippet from a file\n+{@a display-whole-file}\n \n-_This_ \"Authors Doc Style Guide\" has its own sample application, located in the `content/examples/docs-style-guide` folder.\n+### Displaying an entire code file\n \n-The following _code-example_ displays the sample's `app.module.ts`.\n+This Angular documentation style guide that you are currently reading has its own example application, located in the `content/examples/docs-style-guide` folder.\n+\n+The following `<code-example>` displays the sample's `app.module.ts`:\n \n <code-example path=\"docs-style-guide/src/app/app.module.ts\" header=\"src/app/app.module.ts\"></code-example>\n \n-Here's the brief markup that produced that lengthy snippet:\n+The following markup produces that snippet:\n \n ```html\n-<code-example\n-  path=\"docs-style-guide/src/app/app.module.ts\"\n-  header=\"src/app/app.module.ts\">\n+<code-example path=\"docs-style-guide/src/app/app.module.ts\" header=\"src/app/app.module.ts\">\n </code-example>\n ```\n \n-You identified the snippet's source file by setting the `path` attribute to sample folder's location _within_ `content/examples`.\n+The `path` attribute identifies the snippet's source file at the example app folder's location within `content/examples`.\n In this example, that path is  `docs-style-guide/src/app/app.module.ts`.\n \n-You added a header to tell the reader where to find the file by setting the `header` attribute.\n-Following convention, you set the `header` attribute to the file's location within the sample's root folder.\n-\n-<div class=\"alert is-helpful\">\n-\n-Unless otherwise noted, all code snippets in this page are derived from sample source code\n-located in the `content/examples/docs-style-guide` directory.\n+The header tells the reader where to find the file.\n+Following convention, set the `header` attribute to the file's location within the example app's root folder.\n \n-</div>\n+Unless otherwise noted, all code snippets in this page are from sample source code located in the `content/examples/docs-style-guide` directory.\n \n <div class=\"alert is-important\">\n \n-The doc tooling reports an error if the file identified in the path does not exist **or is _git_-ignored**.\n-\n-Most `.js` files are _git_-ignored.\n-If you want to include an ignored code file in your project and display it in a guide you must _un-ignore_ it.\n+The documentation tooling reports an error if the file identified in the path does not exist or is in the [`.git-ignore` file](https://github.com/angular/angular/blob/master/aio/content/examples/.gitignore).\n+Most `.js` files are in `.git-ignore`.\n \n-The preferred way to un-ignore a file is to update the `content/examples/.gitignore` like this:\n+To include an ignored code file in your project and display it in a guide, remove it from `.git-ignore`. Update the `content/examples/.gitignore` as follows:\n \n <code-example header=\"content/examples/.gitignore\">\n   # my-guide\n@@ -423,38 +335,20 @@ The preferred way to un-ignore a file is to update the `content/examples/.gitign\n \n </div>\n \n-#### Code-example attributes\n-\n-You control the _code-example_ output by setting one or more of its attributes:\n-\n-* `path`- the path to the file in the `content/examples` folder.\n-\n-* `header`- the header of the code listing.\n-\n-* `region`- displays the source file fragment with that region name; regions are identified by _docregion_ markup in the source file, as explained [below](#region \"Displaying a code fragment\").\n-\n-* `linenums`- value may be `true`, `false`, or a `number`. When not specified, line numbers default to `false` (i.e. no line numbers are displayed). The rarely used `number` option starts line numbering at the given value. `linenums=4` sets the starting line number to 4.\n-\n-* `class`- code snippets can be styled with the CSS classes `no-box`, `code-shell`, and `avoid`.\n-\n-* `hideCopy`- hides the copy button\n-\n-* `language`- the source code language such as `javascript`, `html`, `css`, `typescript`, `json`, or `sh`. This attribute only works for inline examples.\n-\n {@a region}\n \n-#### Displaying a code fragment\n+### Displaying part of a code file\n \n-Often you want to focus on a fragment of code within a sample code file. In this example, you focus on the `AppModule` class and its `NgModule` metadata.\n+To include a snippet of code within a sample code file, rather than the entire file, use the `<code-example>` `region` attribute.\n+The following example focuses on the `AppModule` class and its `@NgModule()` metadata:\n \n <code-example\n   path=\"docs-style-guide/src/app/app.module.ts\"\n+  header=\"src/app/app.module.ts\"\n   region=\"class\">\n </code-example>\n \n-First you surround that fragment in the source file with a named _docregion_ as described [below](#source-code-markup).\n-Then you reference that _docregion_ in the `region` attribute of the `<code-example>` like this\n-\n+To render the above example, the HTML in the Markdown file is as follows:\n \n ```html\n <code-example\n@@ -463,23 +357,72 @@ Then you reference that _docregion_ in the `region` attribute of the `<code-exam\n </code-example>\n ```\n \n-A couple of observations:\n+The `path` points to the file, just as in examples that render the [entire file](guide/docs-style-guide#display-whole-file).\n+The `region` attribute specifies a portion of the source file delineated by an opening `#docregion` and a closing `#enddocregion`.\n+\n+You can see the `class` `#docregion` in the source file below.\n+Notice the commented lines `#docregion` and `#enddocregion` in `content/examples/docs-style-guide/src/app/app.module.ts` with the name `class`.\n+\n+<code-example header=\"src/app/app.module.ts\">\n+\n+import { NgModule }      from '@angular/core';\n+import { BrowserModule } from '@angular/platform-browser';\n+import { FormsModule }   from '@angular/forms';\n+\n+import { AppComponent }  from './app.component';\n+\n+// #docregion class\n+@NgModule({\n+  imports:      [ BrowserModule, FormsModule ],\n+  declarations: [ AppComponent ],\n+  bootstrap:    [ AppComponent ]\n+})\n+export class AppModule { }\n+// #enddocregion class\n+\n+</code-example>\n \n-1. The `region` value, `\"class\"`, is the name of the `#docregion` in the source file. Confirm that by looking at `content/examples/docs-style-guide/src/app/app.module.ts`\n+The opening and ending `#docregion` lines designate any lines of code between them as being included in the code snippet.\n+This is why the import statements outside of the `class` `#docregion` are not in the code snippet.\n \n-1. Omitting the `header` is fine when the source of the fragment is obvious. We just said that this is a fragment of the `app.module.ts` file which was displayed immediately above, in full, with a header.\n-There's no need to repeat the header.\n+For more information on how to prepare example app files for use in guides, see\n+ [Source code markup](#source-code-markup).\n \n-#### Example of bad code\n+### Code snippet options\n \n-Sometimes you want to display an example of bad code or bad design.\n+Specify the `<code-example>` output with the following attributes:\n \n-You should be careful. Readers don't always read carefully and are likely to copy and paste your example of bad code in their own applications. So don't display bad code often.\n+* `path`: the path to the file in the `content/examples` folder.\n \n-When you do, set the `class` to `avoid`. The code snippet will be framed in bright red to grab the reader's attention.\n+* `header`: the header of the code listing.\n+  This is the title of the code snippet and can include the path and extra information such as whether the snippet is an excerpt.\n+\n+* `region`: displays the source file fragment with that region name; regions are identified by `#docregion` markup in the source file.\n+  See [Displaying a code snippet](#region \"Displaying a code snippet\").\n+\n+* `linenums`: value may be `true`, `false`, or a `number`.\n+  The default is `false`, which means that the browser displays no line numbers.\n+  The `number` option starts line numbering at the given value.\n+  For example, `linenums=4` sets the starting line number to 4.\n+\n+* `class`: code snippets can be styled with the CSS classes `no-box`, `code-shell`, and `avoid`.\n+\n+* `hideCopy`: hides the copy button.\n+\n+* `language`: the source code language such as `javascript`, `html`, `css`, `typescript`, `json`, or `sh`.\n+  This attribute only applies to hard-coded examples.\n+\n+### Displaying bad code\n+\n+Occasionally, you want to display an example of less than ideal code or design, such as with **avoid** examples in the [Angular Style Guide](guide/styleguide).\n+Because it is possible for readers to copy and paste examples of inferior code in their own applications, try to minimize use of such code.\n+\n+In cases where you need unacceptable examples, you can set the `class` to `avoid` or have the word `avoid` in the filename of the source file.\n+By putting the word `avoid` in the filename or path, the documentation generator automatically adds the `avoid` class to the `<code-example>`.\n+Either of these options frames the code snippet in bright red to grab the reader's attention.\n \n Here's the markup for an \"avoid\" example in the\n-[_Angular Style Guide_](guide/styleguide#style-05-03 \"Style 05-03: components as elements\").\n+[Angular Style Guide](guide/styleguide#style-05-03 \"Style 05-03: components as elements\") that uses the word `avoid` in the path name:\n \n ```html\n <code-example\n@@ -489,28 +432,53 @@ Here's the markup for an \"avoid\" example in the\n </code-example>\n ```\n \n+Having the word \"avoid\" in the file name causes the browser to render the code snippet with a red header and border:\n+\n <code-example path=\"styleguide/src/05-03/app/heroes/shared/hero-button/hero-button.component.avoid.ts\" region=\"example\" header=\"app/heroes/hero-button/hero-button.component.ts\">\n </code-example>\n \n+Alternatively, the HTML could include the `avoid` class as in the following:\n+\n+```html\n+<code-example\n+  path=\"docs-style-guide/src/app/not-great.component.ts\"\n+  header=\"docs-style-guide/src/app/not-great.component.ts\"\n+  region=\"not-great\"\n+  class=\"avoid\">\n+</code-example>\n+```\n+\n+Explicitly applying the class `avoid` causes the same result of a red header and red border:\n+\n+<code-example path=\"docs-style-guide/src/app/not-great.component.ts\" header=\"docs-style-guide/src/app/not-great.component.ts\" region=\"not-great\" class=\"avoid\">\n+\n+</code-example>\n+\n {@a code-tabs}\n+\n ### Code Tabs\n \n-Code tabs display code much like _code examples_ do.  The added advantage is that they can display multiple code samples within a tabbed interface.  Each tab is displayed using _code pane_.\n+Code tabs display code much like `code-examples` with the added advantage of displaying multiple code samples within a tabbed interface.\n+Each tab displays code using a `code-pane`.\n \n-#### Code-tabs attributes\n+#### `code-tabs` attributes\n \n-* `linenums`: The value can be `true`, `false` or a number indicating the starting line number. If not specified, it defaults to `false`.\n+* `linenums`: The value can be `true`, `false`, or a number indicating the starting line number.\n+The default is `false`.\n \n-#### Code-pane attributes\n+#### `code-pane` attributes\n \n-* `path` - a file in the content/examples folder\n-* `header` - seen in the header of a tab\n-* `linenums` - overrides the `linenums` property at the `code-tabs` level for this particular pane. The value can be `true`, `false` or a number indicating the starting line number. If not specified, it defaults to `false`.\n+* `path`: a file in the `content/examples` folder\n+* `header`: what displays in the header of a tab\n+* `linenums`: overrides the `linenums` property at the `code-tabs` level for this particular pane.\n+The value can be `true`, `false`, or a number indicating the starting line number.\n+The default is `false`.\n \n-The next example displays multiple code tabs, each with its own header.\n-It demonstrates control over display of line numbers at both the `<code-tabs>` and `<code-pane>` levels.\n+The following example displays multiple code tabs, each with its own header.\n+It demonstrates showing line numbers in `<code-tabs>` and `<code-pane>`.\n \n <code-tabs linenums=\"true\">\n+\n   <code-pane\n     header=\"app.component.html\"\n     path=\"docs-style-guide/src/app/app.component.html\">\n@@ -529,12 +497,11 @@ It demonstrates control over display of line numbers at both the `<code-tabs>` a\n     header=\"package.json (scripts)\"\n     path=\"docs-style-guide/package.1.json\">\n   </code-pane>\n-</code-tabs>\n \n-Here's the markup for that example.\n+</code-tabs>\n \n-Note how the `linenums` attribute in the `<code-tabs>` explicitly enables numbering for all panes.\n-The `linenums` attribute in the second pane disables line numbering for _itself only_.\n+The `linenums` attribute set to `true` on `<code-tabs>` explicitly enables numbering for all panes.\n+However, the `linenums` attribute set to `false` in the second `<code-pane>` disables line numbering only for itself.\n \n ```html\n <code-tabs linenums=\"true\">\n@@ -561,24 +528,24 @@ The `linenums` attribute in the second pane disables line numbering for _itself\n \n {@a source-code-markup}\n \n-## Source code markup\n+## Preparing source code for code snippets\n \n-You must add special code snippet markup to sample source code files before they can be displayed by `<code-example>` and `<code-tabs>` components.\n+To display  `<code-example>` and `<code-tabs>` snippets, add code snippet markup to sample source code files.\n \n <div class=\"alert is-helpful\">\n \n-The sample source code for this page, located in `context/examples/docs-style-guide`, contains examples of every code snippet markup described in this section.\n+The sample source code for this page, located in `content/examples/docs-style-guide`, contains examples of every code snippet markup described in this section.\n \n </div>\n \n-Code snippet markup is always in the form of a comment. Here's the default _docregion_ markup for a TypeScript or JavaScript file:\n+Code snippet markup is always in the form of a comment.\n+The default `#docregion` markup for a TypeScript or JavaScript file is as follows:\n \n ```\n // #docregion\n-... some code ...\n+... some TypeScript or JavaScript code ...\n // #enddocregion\n ```\n-Different file types have different comment syntax so adjust accordingly.\n \n ```html\n <!-- #docregion -->\n@@ -592,60 +559,53 @@ Different file types have different comment syntax so adjust accordingly.\n /* #enddocregion */\n ```\n \n-The doc generation process erases these comments before displaying them in the doc viewer.\n-It also strips them from stackblitz and sample code downloads.\n+The documentation generation process erases these comments before displaying them in the documentation viewer, StackBlitz, and sample code downloads.\n \n <div class=\"alert is-important\">\n \n-Code snippet markup is not supported in JSON files because comments are forbidden in JSON files.\n-See [below](#json-files) for details and workarounds.\n+Because JSON does not allow comments, code snippet markup doesn't work in JSON files.\n+See the section on [JSON files](#json-files) for more information.\n \n </div>\n \n+### `#docregion`\n \n-#### _#docregion_\n+Use `#docregion` in source files to mark code for use in `<code-example>` or `<code-tabs>` components.\n \n-The _#docregion_ is the most important kind of code snippet markup.\n+The `#docregion` comment begins a code snippet region.\n+Every line of code after that comment belongs in the region until the code fragment processor encounters the end of the file or a closing `#enddocregion`.\n \n-The `<code-example>` and `<code-tabs>` components won't display a source code file unless it has a _#docregion_.\n+The following `src/main.ts` is a an example of a file with a single `#docregion` at the top of the file.\n \n-The _#docregion_ comment begins a code snippet region.\n-Every line of code _after_ that comment belongs in the region _until_ the code fragment processor encounters the end of the file or a closing _#enddocregion_.\n+<code-example path=\"docs-style-guide/src/main.ts\" header=\"src/main.ts\"></code-example>\n \n-<div class=\"alert is-helpful\">\n-\n-The `src/main.ts` is a simple example of a file with a single _#docregion_ at the top of the file.\n+As a result, the entire file is in the `<code-example>`.\n \n-<code-example\n-  path=\"docs-style-guide/src/main.ts\"\n-  header=\"src/main.ts\"></code-example>\n-\n-</div>\n \n-#### Named _#docregions_\n+### Naming a `#docregion`\n \n-You'll often display multiple snippets from different fragments within the same file.\n-You distinguish among them by giving each fragment its own _#docregion name_ as follows.\n+To display multiple snippets from different fragments within the same file, give each fragment its own `#docregion` name as follows, where `your-region-name` is a hyphenated lowercase string:\n \n ```\n-// #docregion region-name\n+// #docregion your-region-name\n ... some code ...\n-// #enddocregion region-name\n+// #enddocregion your-region-name\n ```\n \n-Remember to refer to this region by name in the `region` attribute of the `<code-example>` or `<code-pane>` as you did in an example above like this:\n+Reference this region by name in the `region` attribute of the `<code-example>` or `<code-pane>` as follows:\n \n ```html\n <code-example\n-  path=\"docs-style-guide/src/app/app.module.ts\"\n-  region=\"class\"></code-example>\n+  path=\"your-example-app/src/app/your-file.ts\"\n+  region=\"your-region-name\"></code-example>\n ```\n \n-The _#docregion_ with no name is the _default region_. Do _not_ set the `region` attribute when referring to the default _#docregion_.\n+Because the `#docregion` with no name is the default region, you do not need to set the `region` attribute when referring to the default `#docregion`.\n+\n+### Nesting a `#docregion`\n \n-#### Nested _#docregions_\n+Place a `#docregion` within another `#docregion` as in the following example with a nested `inner-region`:\n \n-You can nest _#docregions_ within _#docregions_\n ```\n // #docregion\n ... some code ...\n@@ -655,22 +615,16 @@ You can nest _#docregions_ within _#docregions_\n ... yet more code ...\n /// #enddocregion\n ```\n-<div class=\"alert is-helpful\">\n-\n-The `src/app/app.module.ts` file has a good example of a nested region.\n-\n-</div>\n \n-#### Combining fragments\n+### Combining code fragments\n \n-You can combine several fragments from the same file into a single code snippet by defining\n-multiple _#docregions_ with the _same region name_.\n+Combine several fragments from the same file into a single code snippet by defining multiple `#docregion` sections with the same region name.\n+The following example defines two nested `#docregion` sections.\n \n-Examine the `src/app/app.component.ts` file which defines two nested _#docregions_.\n+The inner region, `class-skeleton`, appears twice&mdash;once to capture the code that opens the class definition and a second time to capture the code that closes the class definition.\n \n-The inner, `class-skeleton` region appears twice, once to capture the code that opens the class definition and once to capture the code that closes the class definition.\n+<code-example header=\"src/app/app.component.ts\">\n \n-<code-example>\n // #docplaster\n ...\n // #docregion class, class-skeleton\n@@ -686,242 +640,270 @@ export class AppComponent {\n // #docregion class-skeleton\n }\n // #enddocregion class, class-skeleton\n+\n </code-example>\n \n-Here's are the two corresponding code snippets displayed side-by-side.\n+The `#docplaster` marker tells the processor what text string to use&mdash;that is, the \"plaster\"&mdash;to join each of the fragments into a single snippet.\n+Place the \"plaster\" text on the same line.\n+For example, `#docplaster ---` would use `---` as the \"plaster\" text.\n+In the case of the previous file, the \"plaster\" text is empty so there will be nothing in between each fragment.\n+\n+Without `#docplaster`, the processor inserts the default plaster&mdash;an ellipsis comment&mdash;between the fragments.\n+\n+Here are the two corresponding code snippets for side-by-side comparison.\n \n <code-tabs>\n-  <code-pane\n-    header=\"app.component.ts (class)\"\n-    path=\"docs-style-guide/src/app/app.component.ts\"\n-    region=\"class\">\n-  </code-pane>\n-  <code-pane\n-    header=\"app.component.ts (class-skeleton)\"\n-    path=\"docs-style-guide/src/app/app.component.ts\"\n-    region=\"class-skeleton\">\n+\n+  <code-pane header=\"app.component.ts (class #docregion)\" path=\"docs-style-guide/src/app/app.component.ts\" region=\"class\">\n+\n   </code-pane>\n-</code-tabs>\n+  <code-pane header=\"app.component.ts (class-skeleton #docregion)\" path=\"docs-style-guide/src/app/app.component.ts\" region=\"class-skeleton\">\n \n-Some observations:\n+  </code-pane>\n \n-* The `#docplaster` at the top is another bit of code snippet markup. It tells the processor how to join the fragments into a single snippet.\n+</code-tabs>\n \n-  In this example, we tell the processor to put the fragments together without anything in between - without any \"plaster\".  Most sample files define this _empty plaster_.\n+The above example also demonstrates that one `#docregion` or `#enddocregion` comment can specify two region names, which is a convenient way to start or stop multiple regions on the same code line.\n+Alternatively, you could put these comments on separate lines as in the following example:\n \n-  If we neglected to add, `#docplaster`, the processor would insert the _default_ plaster - an ellipsis comment - between the fragments. Try removing the `#docplaster` comment yourself to see the effect.\n+<code-example header=\"src/app/app.component.ts\">\n \n-* One `#docregion` comment mentions **_two_** region names as does an `#enddocregion` comment. This is a convenient way to start (or stop) multiple regions on the same code line. You could have put these comments on separate lines and many authors prefer to do so.\n+// #docplaster\n+...\n+// #docregion class\n+// #docregion class-skeleton\n+export class AppComponent {\n+// #enddocregion class-skeleton\n+  title = 'Authors Style Guide Sample';\n+  heroes = HEROES;\n+  selectedHero: Hero;\n \n-#### JSON files\n+  onSelect(hero: Hero): void {\n+    this.selectedHero = hero;\n+  }\n+// #docregion class-skeleton\n+}\n+// #enddocregion class\n+// #enddocregion class-skeleton\n \n-Code snippet markup is not supported for JSON files because comments are forbidden in JSON files.\n+</code-example>\n \n-You can display an entire JSON file by referring to it in the `src` attribute.\n-But you can't display JSON fragments because you can't add `#docregion` tags to the file.\n+### JSON files\n \n-If the JSON file is too big, you could copy the nodes-of-interest into markdown backticks.\n+The `<code-example>` component cannot display portions of a JSON file because JSON forbids comments.\n+However, you can display an entire JSON file by referencing it in the `<code-example>` `src` attribute.\n \n-Unfortunately, it's easy to mistakenly create invalid JSON that way. The preferred way is to create a JSON partial file with the fragment you want to display.\n+For large JSON files, you could copy the nodes-of-interest into Markdown backticks, but as it's easy to mistakenly create invalid JSON that way, consider creating a JSON partial file with the fragment you want to display.\n \n-You can't test this partial file and you'll never use it in the application. But at least your IDE can confirm that it is syntactically correct.\n+You can't test a partial file nor use it in the application, but at least your editor can confirm that it is syntactically correct.\n+You can also store the partial file next to the original, so it is more likely that the author will remember to keep the two in sync.\n \n Here's an example that excerpts certain scripts from `package.json` into a partial file named `package.1.json`.\n \n-<code-example\n-  path=\"docs-style-guide/package.1.json\"\n-  header=\"package.json (selected scripts)\"></code-example>\n+<code-example path=\"docs-style-guide/package.1.json\" header=\"package.json (selected scripts)\"></code-example>\n \n ```html\n-<code-example\n-  path=\"docs-style-guide/package.1.json\"\n-  header=\"package.json (selected scripts)\"></code-example>\n+<code-example path=\"docs-style-guide/package.1.json\" header=\"package.json (selected scripts)\"></code-example>\n ```\n \n-#### Partial file naming\n+In some cases, it is preferable to use the name of the full file rather than the partial.\n+In this case, the full file is `package.json` and the partial file is `package.1.json`.\n+Since the focus is generally on the full file rather than the partial, using the name of the file the reader edits, in this example `package.json`, clarifies which file to work in.\n \n-Many guides tell a story. In that story, the app evolves incrementally, often with simplistic or incomplete code along the way.\n+### Partial file naming\n \n-To tell that story in code, you'll often need to create partial files or intermediate versions of the final source code file with fragments of code that don't appear in the final app.\n+The step-by-step nature of the guides necessitate refactoring, which means there are code snippets that evolve through a guide.\n \n-Such partial and intermediate files need their own names.\n-Follow the doc sample naming convention. Add a number before the file extension as illustrated here:\n+Use partial files to demonstrate intermediate versions of the final source code with fragments of code that don't appear in the final app.\n+The sample naming convention adds a number before the file extension, as follows:\n \n ```html\n package.1.json\n app.component.1.ts\n app.component.2.ts\n ```\n \n-You'll find many such files among the samples in the Angular documentation.\n+Remember to exclude these files from StackBlitz by listing them in the `stackblitz.json` as illustrated here:\n \n-Remember to exclude these files from stackblitz by listing them in the `stackblitz.json` as illustrated here.\n+<code-example path=\"docs-style-guide/stackblitz.json\" header=\"stackblitz.json\"></code-example>\n \n-<code-example\n-  path=\"docs-style-guide/stackblitz.json\"\n-  header=\"stackblitz.json\"></code-example>\n \n {@a live-examples}\n-## Live examples\n-\n-By adding `<live-example>` to the page you generate links that run sample code in the Stackblitz live coding environment and download that code to the reader's file system.\n \n-Live examples (AKA \"stackblitz\") are defined by one or more `stackblitz.json` files in the root of a code sample folder. Each sample folder usually has a single unnamed definition file, the default `stackblitz.json`.\n-\n-<div class=\"alert is-helpful\">\n-\n-You can create additional, named definition files in the form `name.stackblitz.json`. See `content/examples/testing` for examples.\n-\n-The schema for a `stackblitz.json` hasn't been documented yet but looking at the `stackblitz.json` files in the example folders should tell you most of what you need to know.\n+## Live examples\n \n-</div>\n+Adding `<live-example></live-example>` to a page generates two default links: <live-example></live-example>.\n \n-Adding `<live-example></live-example>` to the page generates the two default links.\n+The first is a link to the StackBlitz example, which the default `stackblitz.json` file defines.\n+You can find the `stackblitz.json` file in the `content/examples/example-app` directory, where `example-app` is the sample application folder you're using for the guide.\n \n-<live-example></live-example>\n+By default, the documentation generator uses the name of the guide as the name of the example.\n+So, if you're working on `router.md`, and use `<live-example></live-example>` in the document, the documentation generator looks for `content/examples/router`.\n+Clicking this link opens the code sample on StackBlitz in a new browser tab.\n \n-1. a link to the Stackblitz defined by the default `stackblitz.json` file located in the code sample folder with the same name as the guide page.\n+The second link downloads the sample app.\n \n-2. a link that downloads that sample.\n+Define live examples by one or more `stackblitz.json` files in the root of a code sample folder.\n+Each sample folder usually has a single unnamed definition file, the default `stackblitz.json`.\n \n-Clicking the first link opens the code sample on StackBlitz in a new browser tab.\n+### Live Example for named StackBlitz\n \n-You can change the appearance and behavior of the live example with attributes and classes.\n+You can create additional, named definition files in the form `name.stackblitz.json`.\n+The [Testing](guide/testing) guide (`aio/content/guide/testing.md`) references a named StackBlitz file as follows:\n \n+  ```html\n+  <live-example stackblitz=\"specs\">Tests</live-example>\n+  ```\n \n-<h3 class=\"no-toc\">Custom label and tooltip</h3>\n+The `stackblitz` attribute value of `specs` refers to the `examples/testing/specs.stackblitz.json` file.\n+If you were to leave out the `stackblitz` attribute, the default would be `examples/testing/stackblitz.json`.\n \n-Give the live example anchor a custom label and tooltip by setting the `title` attribute.\n+### Custom label and tooltip\n \n-<live-example title=\"Live Example with title\"></live-example>\n+Change the appearance and behavior of the live example with attributes and classes.\n+The following example gives the live example anchor a custom label and tooltip by setting the `title` attribute:\n \n ```html\n <live-example title=\"Live Example with title\"></live-example>\n ```\n \n-You can achieve the same effect by putting the label between the `<live-example>` tags:\n+The browser renders the following:\n \n-<live-example>Live example with content label</live-example>\n+<live-example title=\"Live Example with title\"></live-example>\n+\n+You can achieve the same effect by putting the label between the `<live-example>` tags:\n \n ```html\n <live-example>Live example with content label</live-example>\n ```\n \n-<h3 class=\"no-toc\">Live example from another guide</h3>\n+The browser renders the following:\n+\n+<live-example>Live example with content label</live-example>\n+\n+### Live example from another guide\n \n-To link to a Stackblitz in a folder whose name is not the same as the current guide page, set the `name` attribute to the name of that folder.\n+To link to an example in a folder where the name is not the same as the current guide page, set the `name` attribute to the name of that folder.\n \n-<live-example name=\"router\">Live Example from the Router guide</live-example>\n+For example, to include the [Router](guide/router) guide example in this style guide, set the `name` attribute to `router`, that is, the name of the folder where that example resides.\n \n ```html\n-<live-example name=\"router\">Live Example from the Router guide</live-example>\n+<live-example name=\"router\">Live example from the Router guide</live-example>\n ```\n \n-<h3 class=\"no-toc\">Live Example for named Stackblitz</h3>\n+<live-example name=\"router\">Live example from the Router guide</live-example>\n \n-To link to a Stackblitz defined by a named `stackblitz.json` file, set the `stackblitz` attribute. The following example links to the Stackblitz defined by `second.stackblitz.json` in the current guide's directory.\n \n-<live-example stackblitz=\"second\"></live-example>\n+### Live Example without download\n+\n+To omit the download link, add the `noDownload` attribute.\n \n ```html\n-<live-example stackblitz=\"second\"></live-example>\n+<live-example noDownload>Just the StackBlitz</live-example>\n ```\n \n-<h3 class=\"no-toc\">Live Example without download</h3>\n+The browser renders the following:\n+\n+<live-example noDownload>Just the StackBlitz</live-example>\n \n-To skip the download link, add the `noDownload` attribute.\n \n-<live-example noDownload>Just the Stackblitz</live-example>\n+### Live Example with download-only\n+\n+To omit the live StackBlitz link and only link to the download, add the `downloadOnly` attribute.\n \n ```html\n-<live-example noDownload>Just the Stackblitz</live-example>\n+<live-example downloadOnly>Download only</live-example>\n ```\n \n-<h3 class=\"no-toc\">Live Example with download-only</h3>\n-\n-To skip the live Stackblitz link and only link to the download, add the `downloadOnly` attribute.\n+The browser renders the following:\n \n <live-example downloadOnly>Download only</live-example>\n \n-```html\n-<live-example downloadOnly>Download only</live-example>\n-```\n \n-<h3 class=\"no-toc\">Embedded live example</h3>\n+### Embedded live example\n \n-By default, a live example link opens a Stackblitz in a separate browser tab.\n-You can embed the Stackblitz within the guide page itself by adding the `embedded` attribute.\n+By default, a live example link opens a StackBlitz example in a separate browser tab.\n+You can embed the StackBlitz example within the guide page by adding the `embedded` attribute.\n \n-For performance reasons, the Stackblitz does not start right away. The reader sees an image instead. Clicking the image starts the sometimes-slow process of launching the embedded Stackblitz within an iframe on the page.\n+For performance reasons, StackBlitz does not start right away.\n+Instead, the `<live-example>` component renders an image.\n+Clicking the image starts the process of launching the embedded StackBlitz within an `<iframe>`.\n \n-Here's an embedded live example for this guide.\n+The following is an embedded `<live-example>` for this guide:\n \n ```html\n <live-example embedded></live-example>\n ```\n \n+The browser renders the following `<iframe>` and a `<p>` with a link to download the example:\n+\n <live-example embedded></live-example>\n \n {@a anchors}\n \n ## Anchors\n \n-Every section header tag is also an anchor point. Another guide page could add a link to this section by writing:\n+Every section header is also an anchor point.\n+Another guide page could add a link to this \"Anchors\" section with the following:\n \n+```html\n <div class=\"alert is-helpful\">\n \n-See the [\"Anchors\"](guide/docs-style-guide#anchors \"Style Guide - Anchors\") section for details.\n+See the [\"Anchors\"](guide/docs-style-guide#anchors \"Style Guide&mdash;Anchors\") section for details.\n \n </div>\n+```\n+\n+The browser renders the following:\n \n-```html\n <div class=\"alert is-helpful\">\n \n-See the [\"Anchors\"](guide/docs-style-guide#anchors \"Style Guide - Anchors\") section for details.\n+See the [\"Anchors\"](guide/docs-style-guide#anchors \"Style Guide&mdash;Anchors\") section for details.\n \n </div>\n-```\n \n-When navigating within the page, you can omit the page URL when specifying the link that [scrolls up](#anchors \"Anchors\") to the beginning of this section.\n+Notice that the above example includes a title of \"Style Guide&mdash;Anchors\".\n+Use titles on anchors to create tooltips and improve UX.\n+\n+When navigating within a page, you can omit the page URL when specifying the link that [scrolls up](#anchors \"Anchors\") to the beginning of this section, as in the following:\n \n ```html\n ... the link that [scrolls up](#anchors \"Anchors\") to ...\n ```\n \n-{@a ugly-anchors}\n-\n-#### Ugly, long section header anchors\n-\n-It is often a good idea to *lock-in* a good anchor name.\n+{@a section-anchors}\n \n-Sometimes the section header text makes for an unattractive anchor. [This one](#ugly-long-section-header-anchors) is pretty bad.\n-\n-```html\n-[This one](#ugly-long-section-header-anchors) is pretty bad.\n-```\n+### Section header anchors\n \n-The greater danger is that **a future rewording of the header text would break** a link to this section.\n+While the documentation generator automatically creates anchors for headers based on the header wording, titles can change, which can potentially break any links to that section.\n \n-For these reasons, it is often wise to add a custom anchor explicitly, just above the heading or\n-text to which it applies, using the special `{@a name}` syntax like this.\n+To mitigate link breakage, add a custom anchor explicitly, just above the heading or text to which it applies, using the special `{@a name}` syntax as follows:\n \n <code-example  language=\"html\">\n-  &#123;@a ugly-anchors&#125;\n+  &#123;@a section-anchors&#125;\n \n-  #### Ugly, long section header anchors\n+  #### Section header anchors\n </code-example>\n \n-Now [link to that custom anchor name](#ugly-anchors) as you did before.\n+Then reference that anchor like this:\n \n ```html\n-Now [link to that custom anchor name](#ugly-anchors) as you did before.\n+This is a [link to that custom anchor name](#section-anchors).\n ```\n \n-<div class=\"alert is-helpful\">\n+The browser renders the following:\n+\n+This is a [link to that custom anchor name](#section-anchors).\n \n-Alternatively, you can use the HTML `<a>` tag.\n+When editing a file, don't remove any anchors.\n+If you change the document structure, you can move an existing anchor within that same doc without breaking a link.\n+You can also add more anchors with more appropriate text.\n+\n+<div class=\"alert is-helpful\">\n \n-If you do, be sure to set the `id` attribute - not the `name` attribute! The docs generator will not convert the `name` to the proper link URL.\n+As an alternative, you can use the HTML `<a>` tag.\n+When using the `<a>` tag, set the `id` attribute&mdash;rather than the `name` attribute because the documentation generator does not convert the `name` to the proper link URL.\n+For example:\n \n ```html\n <a id=\"anchors\"></a>\n@@ -931,58 +913,68 @@ If you do, be sure to set the `id` attribute - not the `name` attribute! The doc\n \n </div>\n \n-## Alerts and Callouts\n+## Alerts and callouts\n \n-Alerts and callouts present warnings, extra detail or references to other pages. They can also be used to provide commentary that _enriches_ the reader's understanding of the content being presented.\n+Alerts and callouts present warnings, extra detail, or references to related topics.\n \n-An alert or callout _must not_ contain anything _essential_ to that understanding. Don't put a critical instruction or a tutorial step in a subsection.\n+An alert or callout should not contain anything essential to understanding the main content.\n+Instructions or tutorial steps should be in the main body of a guide rather than in a subsection.\n \n ### Alerts\n \n-Alerts draw attention to short important points. Alerts should not be used for multi-line content (use [callouts](#callouts \"callouts\") instead).\n+Alerts draw attention to short, important points.\n+For multi-line content, see [callouts](#callouts \"callouts\").\n \n <div class=\"alert is-helpful\">\n \n-  You'll learn about styles for live examples in the [section below](guide/docs-style-guide#live-examples \"Live examples\").\n+  See the [live examples](guide/docs-style-guide#live-examples \"Live examples\") section for more information.\n \n </div>\n \n-  Note that at least one blank line must follow both the opening and closing `<div>` tags. A blank line before the closing `</div>` is customary but not required.\n+Note that at least one blank line must follow both the opening and closing `<div>` tags.\n+A blank line before the closing `</div>` is conventional but not required.\n \n ```html\n <div class=\"alert is-helpful\">\n \n-You'll learn about styles for live examples in the [section below](guide/docs-style-guide#live-examples \"Live examples\").\n+  See the [live examples](guide/docs-style-guide#live-examples \"Live examples\") section for more information.\n \n </div>\n ```\n \n-There are three different _urgency levels_ used to style the alerts based on the severity or importance of the content.\n+There are three different levels for styling the alerts according to the importance of the content.\n \n-<div class=\"alert is-critical\">\n+Use the following the `alert` class along with the appropriate `is-helpful`, `is-important`, or `is-critical` CSS class, as follows:\n \n-A critical alert.\n+```html\n+<div class=\"alert is-helpful\">\n+\n+A helpful, informational alert.\n \n </div>\n+```\n \n+```html\n <div class=\"alert is-important\">\n \n An important alert.\n \n </div>\n+```\n \n-<div class=\"alert is-helpful\">\n+```html\n+<div class=\"alert is-critical\">\n \n-A helpful, informational alert.\n+A critical alert.\n \n </div>\n+```\n \n+The browser renders the following:\n \n-Here is the markup for these alerts.\n-```html\n-<div class=\"alert is-critical\">\n+<div class=\"alert is-helpful\">\n \n-A critical alert.\n+A helpful, informational alert.\n \n </div>\n \n@@ -992,62 +984,81 @@ An important alert.\n \n </div>\n \n-<div class=\"alert is-helpful\">\n+<div class=\"alert is-critical\">\n \n-A helpful, informational alert.\n+A critical alert.\n \n </div>\n-```\n \n ### Callouts\n \n-Callouts, like alerts, are meant to draw attention to important points. Use a callout when you want a riveting header and multi-line content.\n+Callouts, like alerts, highlight important points.\n+Use a callout when you need a header and multi-line content.\n \n If you have more than two paragraphs, consider creating a new page or making it part of the main content.\n \n-Callouts use the same _urgency levels_ that alerts do.\n+Callouts use the same styling levels as alerts.\n \n-<div class=\"callout is-critical\">\n-<header>A critical point</header>\n+Use the CSS class `callout` in conjunction with the appropriate `is-helpful`, `is-important`, or `is-critical` class.\n+The following example uses the `is-helpful` class:\n+\n+```html\n+<div class=\"callout is-helpful\">\n \n-**Pitchfork hoodie semiotics**, roof party pop-up _paleo_ messenger messenger bag cred Carles tousled Truffaut yr. Semiotics viral freegan VHS, Shoreditch disrupt McSweeney's. Intelligentsia kale chips Vice four dollar toast\n+<header>A helpful or informational point</header>\n+\n+  **A helpful note**. Use a helpful callout for information requiring explanation.\n+  Callouts are typically multi-line notes.\n+  They can also contain code snippets.\n \n </div>\n+```\n \n-<div class=\"callout is-important\">\n-<header>An important point</header>\n+The browser renders the three styles as follows:\n+\n+<div class=\"callout is-helpful\">\n+\n+  <header>A helpful or informational point</header>\n \n-**Pitchfork hoodie semiotics**, roof party pop-up _paleo_ messenger bag cred Carles tousled Truffaut yr. Semiotics viral freegan VHS, Shoreditch disrupt McSweeney's. Intelligentsia kale chips Vice four dollar toast\n+  **A helpful note**. Use a helpful callout for information requiring explanation.\n+  Callouts are typically multi-line notes.\n+  They can also contain code snippets.\n \n </div>\n \n-<div class=\"callout is-helpful\">\n-<header>A helpful or informational point</header>\n+<div class=\"callout is-important\">\n \n-**Pitchfork hoodie semiotics**, roof party pop-up _paleo_ messenger bag cred Carles tousled Truffaut yr. Semiotics viral freegan VHS, Shoreditch disrupt McSweeney's. Intelligentsia kale chips Vice four dollar toast\n+  <header>An important point</header>\n+\n+  **An important note**. Use an important callout for significant information requiring explanation.\n+  Callouts are typically multi-line notes.\n+  They can also contain code snippets.\n \n </div>\n \n-Here is the markup for the first of these callouts.\n-```html\n <div class=\"callout is-critical\">\n-<header>A critical point</header>\n \n-**Pitchfork hoodie semiotics**, roof party pop-up _paleo_ messenger bag cred Carles tousled Truffaut yr. Semiotics viral freegan VHS, Shoreditch disrupt McSweeney's. Intelligentsia kale chips Vice four dollar toast\n+  <header>A critical point</header>\n+\n+  **A critical note**. Use a critical callout for compelling information requiring explanation.\n+  Callouts are typically multi-line notes.\n+  They can also contain code snippets.\n \n </div>\n-```\n \n-Notice that:\n-* the callout header text is forced to all upper case\n-* the callout body can be written in markdown\n-* a blank line separates the `</header>` tag from the markdown content\n+When using callouts, consider the following points:\n+\n+* The callout header text style is uppercase.\n+* The header does not render in the table of contents.\n+* You can write the callout body in Markdown.\n+* A blank line separates the `<header>` tag from the Markdown content.\n+* Avoid using an `<h2>`, `<h3>`, `<h4>`, `<h5>`, or `<h6>`, as the CSS for callouts styles the `<header>` element.\n \n-Callouts are meant to grab the user's attention. They are not for casual asides. Please use them sparingly.\n+Use callouts sparingly to grab the user's attention.\n \n ## Trees\n \n-Trees can represent hierarchical data.\n+Use trees to represent hierarchical data such as directory structure.\n \n <div class='filetree'>\n \n@@ -1141,221 +1152,248 @@ Here is the markup for this file tree.\n </div>\n ```\n \n-\n ## Tables\n \n Use HTML tables to present tabular data.\n \n-\n-<style>\n-  td, th {vertical-align: top}\n-</style>\n-\n <table>\n   <tr>\n-    <th>Framework</th>\n-    <th>Task</th>\n-    <th>Speed</th>\n+    <th>Header Type</th>\n+    <th>Markdown</th>\n+    <th>Use</th>\n   </tr>\n   <tr>\n-    <td><code>AngularJS</code></td>\n-    <td>Routing</td>\n-    <td>Fast</td>\n+    <td><code>&lt;h1&gt;</code></td>\n+    <td>#</td>\n+    <td>Title of page</td>\n   </tr>\n   <tr>\n-    <td><code>Angular v2</code></td>\n-    <td>Routing</td>\n-    <!-- can use markdown too; remember blank lines -->\n+    <td><code>&lt;h2&gt;</code></td>\n+    <td>##</td>\n+    <!-- can use Markdown too; remember blank lines -->\n     <td>\n \n-      *Faster*\n+      **Second level headers**\n \n     </td>\n   </tr>\n   <tr>\n-    <td><code>Angular v4</code></td>\n-    <td>Routing</td>\n+    <td><code>&lt;h3&gt;</code></td>\n+    <td>###</td>\n     <td>\n \n-      **Fastest :)**\n+      **Third level headers**\n \n     </td>\n   </tr>\n </table>\n \n-Here is the markup for this table.\n+The following is the markup for this table:\n \n ```html\n-<style>\n-  td, th {vertical-align: top}\n-</style>\n \n <table>\n   <tr>\n-    <th>Framework</th>\n-    <th>Task</th>\n-    <th>Speed</th>\n+    <th>Header Type</th>\n+    <th>Markdown</th>\n+    <th>Use</th>\n   </tr>\n   <tr>\n-    <td><code>AngularJS</code></td>\n-    <td>Routing</td>\n-    <td>Fast</td>\n+    <td><code>&lt;h1&gt;</code></td>\n+    <td>#</td>\n+    <td>Title of page</td>\n   </tr>\n   <tr>\n-    <td><code>Angular v2</code></td>\n-    <td>Routing</td>\n-    <!-- can use markdown too; remember blank lines -->\n+    <td><code>&lt;h2&gt;</code></td>\n+    <td>##</td>\n+    <!-- can use Markdown too; remember blank lines -->\n     <td>\n \n-      *Faster*\n+      **Second level headers**\n \n     </td>\n   </tr>\n   <tr>\n-    <td><code>Angular v4</code></td>\n-    <td>Routing</td>\n+    <td><code>&lt;h3&gt;</code></td>\n+    <td>###</td>\n     <td>\n \n-      **Fastest :)**\n+      **Third level headers**\n \n     </td>\n   </tr>\n </table>\n+\n ```\n \n ## Images\n \n-<h3 class=\"no-toc\">Image location</h3>\n+Store images in the `content/images/guide` directory in a folder with the **same name** as the guide page.\n+Because Angular documentation generation copies these images to `generated/images/guide/your-guide-directory`, set the image `src` attribute to the runtime location of `generated/images/guide/your-guide-directory`.\n \n-Store images in the `content/images` directory in a folder with the same URL as the guide page.\n-Images for this \"Authors Style Guide\" page belong in the `content/images/guide/docs-style-guide` folder.\n+For example, images for this \"Angular documentation style guide\" are in the `content/images/guide/docs-style-guide` folder, but the `src` attribute specifies the `generated` location.\n \n-Angular doc generation copies these image folders to the _runtime_ location, `generated/images`.\n-Set the image `src` attribute to begin in _that_ directory.\n+The following is the `src` attribute for the \"flying hero\" image belonging to this guide:\n \n-Here's the `src` attribute for the \"flying hero\" image belonging to this page.\n-```\n+```html\n src=\"generated/images/guide/docs-style-guide/flying-hero.png\"\n ```\n \n-<h3 class=\"no-toc\">Use the HTML <i>&lt;img&gt;</i> tag</h3>\n+<div class=\"callout is-important\">\n \n-**Do not use the markdown image syntax, \\!\\[\\.\\.\\.\\]\\(\\.\\.\\.\\).**\n+  <header>Use the HTML <code>&lt;img&gt;</code> tag</header>\n \n-Images should be specified in an `<img>` tag.\n+  Specify images using the `<img>` tag.\n+  **Do not use the Markdown image syntax, \\!\\[\\.\\.\\.\\]\\(\\.\\.\\.\\).**\n \n-For accessibility, always set the `alt` attribute with a meaningful description of the image.\n+  For accessibility, always set the `alt` attribute with a meaningful description of the image.\n \n-You should nest the `<img>` tag within a `<div class=\"lightbox\">` tag, which styles the image within a drop-shadow frame. You'll need the editor's permission to skip the `lightbox` class on its `div` encapsulation.\n+  Nest the `<img>` tag within a `<div class=\"lightbox\">` tag, which styles the image according to the documentation standard.\n \n-Here's a conforming example\n \n-<div class=\"lightbox\">\n-  <img src=\"generated/images/guide/docs-style-guide/flying-hero.png\"\n-    alt=\"flying hero\">\n-</div>\n+  ```html\n+  <div class=\"lightbox\">\n+    <img src=\"generated/images/guide/docs-style-guide/flying-hero.png\" alt=\"flying hero\">\n+  </div>\n+  ```\n+\n+  Note that the HTML `<img>` element does not have a closing tag.\n+\n+  The browser renders the following:\n+\n+  <div class=\"lightbox\">\n+    <img src=\"generated/images/guide/docs-style-guide/flying-hero.png\" alt=\"flying hero\">\n+  </div>\n \n-```html\n-<div class=\"lightbox\">\n-  <img src=\"generated/images/guide/docs-style-guide/flying-hero.png\"\n-    alt=\"flying hero\">\n </div>\n-```\n \n-_Note that the HTML image element does not have a closing tag._\n+### Image captions and figure captions\n+\n+A caption appears underneath the image as a concise and comprehensive summary of the image.\n+Captions are optional unless you are using numbered figures, such as Figure 1, Figure 2, and so on.\n+If you are using numbered figures in a page, follow the guidelines in [Figure captions](https://developers.google.com/style/images#figure-captions) in the Google Developer Documentation Style Guide.\n \n-<h3 class=\"no-toc\">Image dimensions</h3>\n+### Image dimensions\n \n-The doc generator reads the image dimensions from the file and adds width and height attributes to the `img` tag automatically. If you want to control the size of the image, supply your own width and height attributes.\n+The doc generator reads the image dimensions from an image file and adds `width` and `height` attributes to the `<img>` tag automatically.\n \n-Here's the \"flying hero\" at a more reasonable scale.\n+To control the size of the image, supply your own `width` and `height` attributes.\n+\n+Here's the \"flying hero\" markup with a 200px width:\n+\n+```html\n \n <div class=\"lightbox\">\n   <img src=\"generated/images/guide/docs-style-guide/flying-hero.png\"\n     alt=\"flying Angular hero\"\n     width=\"200\">\n </div>\n+```\n \n-```html\n+The browser renders the following:\n \n <div class=\"lightbox\">\n+\n   <img src=\"generated/images/guide/docs-style-guide/flying-hero.png\"\n     alt=\"flying Angular hero\"\n     width=\"200\">\n+\n </div>\n-```\n \n-Wide images can be a problem. Most browsers try to rescale the image but wide images may overflow the document in certain viewports.\n+### Wide images\n+\n+To prevent images overflowing their viewports, **use image widths under 700px**.\n+To display a larger image, provide a link to the actual image that the user can click to see the full size image separately, as in this example of `source-map-explorer` output from the \"Ahead-of-time Compilation\" guide:\n+\n+<a href=\"generated/images/guide/docs-style-guide/toh-pt6-bundle.png\" title=\"Click to view larger image\">\n+  <div class=\"lightbox\">\n+    <img src=\"generated/images/guide/docs-style-guide/toh-pt6-bundle-700w.png\" alt=\"toh-pt6-bundle\" width=\"300px\">\n+  </div>\n+</a>\n \n-**Do not set a width greater than 700px**. If you wish to display a larger image, provide a link to the actual image that the user can click on to see the full size image separately as in this example of `source-map-explorer` output from the \"Ahead-of-time Compilation\" guide:\n+The following is the HTML for creating a link to the image:\n \n+```html\n <a href=\"generated/images/guide/docs-style-guide/toh-pt6-bundle.png\" title=\"Click to view larger image\">\n   <div class=\"lightbox\">\n     <img src=\"generated/images/guide/docs-style-guide/toh-pt6-bundle-700w.png\" alt=\"toh-pt6-bundle\" width=\"300px\">\n   </div>\n </a>\n+```\n \n-<h3 class=\"no-toc\">Image compression</h3>\n+### Image compression\n \n-Large image files can be slow to load, harming the user experience. Always compress the image.\n+For faster load times, always compress images.\n Consider using an image compression web site such as [tinypng](https://tinypng.com/ \"tinypng\").\n \n-<h3 class=\"no-toc\">Floating images</h3>\n+### Floated images\n \n You can float the image to the left or right of text by applying the class=\"left\" or class=\"right\" attributes respectively.\n+For example:\n \n+```html\n <img src=\"generated/images/guide/docs-style-guide/flying-hero.png\"\n    alt=\"flying Angular hero\"\n    width=\"200\"\n    class=\"left\">\n \n This text wraps around to the right of the floating \"flying hero\" image.\n \n-Headings and code-examples automatically clear a floating image. If you need to force a piece of text to clear a floating image, add `<br class=\"clear\">` where the text should break.\n+Headings and code-examples automatically clear a floated image. If you need to force a piece of text to clear a floating image, add `<br class=\"clear\">` where the text should break.\n \n <br class=\"clear\">\n+```\n \n-The markup for the above example is:\n+The browser renders the following:\n \n-```html\n <img src=\"generated/images/guide/docs-style-guide/flying-hero.png\"\n    alt=\"flying Angular hero\"\n    width=\"200\"\n    class=\"left\">\n \n This text wraps around to the right of the floating \"flying hero\" image.\n \n-Headings and code-examples automatically clear a floating image. If you need to force a piece of text to clear a floating image, add `<br class=\"clear\">` where the text should break.\n+Headings and `<code-example>` components automatically clear a floated image.\n+To explicitly clear a floated image, add `<br class=\"clear\">` where the text should break.\n \n <br class=\"clear\">\n-```\n \n-Note that you generally don't wrap a floating image in a `<figure>` element.\n+Generally, you don't wrap a floated image in a `<figure>` element.\n \n-#### Floating within a subsection\n+### Floats within a subsection\n \n-If you have a floating image inside an alert, callout, or a subsection, it is a good idea to apply the `clear-fix` class to the `div` to ensure that the image doesn't overflow its container. For example:\n+If you have a floated image inside an alert, callout, or a subsection, apply the `clear-fix` class to the `<div>` to ensure that the image doesn't overflow its container.\n+For example:\n \n+\n+```html\n <div class=\"alert is-helpful clear-fix\">\n \n   <img src=\"generated/images/guide/docs-style-guide/flying-hero.png\"\n     alt=\"flying Angular hero\"\n     width=\"100\"\n     class=\"right\">\n \n-  A subsection with **markdown** formatted text.\n+  A subsection with **Markdown** formatted text.\n \n </div>\n+```\n+\n+The browser renders the following:\n \n-```html\n <div class=\"alert is-helpful clear-fix\">\n \n   <img src=\"generated/images/guide/docs-style-guide/flying-hero.png\"\n     alt=\"flying Angular hero\"\n     width=\"100\"\n     class=\"right\">\n \n-  A subsection with **markdown** formatted text.\n+  A subsection with **Markdown** formatted text.\n \n </div>\n-```\n+\n+## Help with documentation style\n+\n+For specific language and grammar usage, a word list, style, tone, and formatting recommendations, see the [Google Developer Documentation Style Guide](https://developers.google.com/style).\n+\n+If you have any questions that this style guide doesn't answer or you would like to discuss documentation styles visit the [Angular repo](https://github.com/angular/angular) and [file a documentation issue](https://github.com/angular/angular/issues/new/choose)."
        }
    ],
    "stats": {
        "total": 1137,
        "additions": 594,
        "deletions": 543
    }
}