{
    "author": "jelbourn",
    "message": "ci: change required labels for issue triage (#38932)\n\nIssue triage _currently_ requires a component to be set and one of the following to be true for an issue to be\nconsidered triaged:\n* Marked as a bug _and_ has a severity _and_ has a frequency\n* Mark as a feature\n* Marked as a refactor\n* Marked as a discussion\n* Marked as \"confusing\"\n* Marked as \"use-case\"\n\nThis PR changes the rules so that (in addition to the component), triage\nrequires:\n* A priority label (P0 through P5)\n* Marked as a feature\n* Marked as a discussion\n\nTriage may also apply additional, optional info labels to issues.\n\n[This document outlines the new priority\nscheme](https://docs.google.com/document/d/1mN2zWsr1pxChSTHC7UkOgl4PhhuoFONtG_zcMWeqLwA/preview).\n\nWhile this PR is focused on issue triage and not PR triage, I have\nchanged the PR section triage to remove reference to the \"effort: *\" and\n\"risk: *\" labels. Looking through recent PRs, Kapunahele is the only\nperson applying these, so it's clear that this bit is no longer widely\npracticed.\n\nThis is just one step in the always-ongoing process of managing GitHub\nlabels. More adjustments will come over time. In writing this PR, I have\nalready unearthed a few more areas that can be polished in follow-ups.\n\nPR Close #38932",
    "sha": "fb12c617a496fcf65ca7c800f13eec387a5b66b5",
    "files": [
        {
            "sha": "803740acf09c1844cd910d382b1ffeeae7bd1715",
            "filename": ".github/angular-robot.yml",
            "status": "modified",
            "additions": 12,
            "deletions": 8,
            "changes": 20,
            "blob_url": "https://github.com/angular/angular/blob/fb12c617a496fcf65ca7c800f13eec387a5b66b5/.github%2Fangular-robot.yml",
            "raw_url": "https://github.com/angular/angular/raw/fb12c617a496fcf65ca7c800f13eec387a5b66b5/.github%2Fangular-robot.yml",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/.github%2Fangular-robot.yml?ref=fb12c617a496fcf65ca7c800f13eec387a5b66b5",
            "patch": "@@ -137,24 +137,28 @@ triage:\n   # arrays of labels that determine if an issue has been fully triaged\n   l2TriageLabels:\n     -\n-      - \"type: bug/fix\"\n-      - \"severity*\"\n-      - \"freq*\"\n+      - \"P0\"\n       - \"comp: *\"\n     -\n-      - \"type: feature\"\n+      - \"P1\"\n       - \"comp: *\"\n     -\n-      - \"type: refactor\"\n+      - \"P2\"\n       - \"comp: *\"\n     -\n-      - \"type: RFC / Discussion / question\"\n+      - \"P3\"\n       - \"comp: *\"\n     -\n-      - \"type: confusing\"\n+      - \"P4\"\n       - \"comp: *\"\n     -\n-      - \"type: use-case\"\n+      - \"P5\"\n+      - \"comp: *\"\n+    -\n+      - \"feature\"\n+      - \"comp: *\"\n+    -\n+      - \"discussion\"\n       - \"comp: *\"\n \n # options for the triage PR plugin"
        },
        {
            "sha": "4104b55e33b26cd1a5f9b6033ab3dea698355680",
            "filename": ".ng-dev/caretaker.ts",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/angular/angular/blob/fb12c617a496fcf65ca7c800f13eec387a5b66b5/.ng-dev%2Fcaretaker.ts",
            "raw_url": "https://github.com/angular/angular/raw/fb12c617a496fcf65ca7c800f13eec387a5b66b5/.ng-dev%2Fcaretaker.ts",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/.ng-dev%2Fcaretaker.ts?ref=fb12c617a496fcf65ca7c800f13eec387a5b66b5",
            "patch": "@@ -12,7 +12,7 @@ export const caretaker: CaretakerConfig = {\n       query: `is:pr is:open status:success label:\"action: merge-assistance\"`,\n     },\n     {\n-      name: 'Primary Triage Queue',\n+      name: 'Initial Triage Queue',\n       query: `is:open is:issue no:milestone`,\n     }\n   ]"
        },
        {
            "sha": "c41f469bd2eca1bfe1e6f942bdc0482cf09d90cd",
            "filename": "docs/TRIAGE_AND_LABELS.md",
            "status": "modified",
            "additions": 51,
            "deletions": 54,
            "changes": 105,
            "blob_url": "https://github.com/angular/angular/blob/fb12c617a496fcf65ca7c800f13eec387a5b66b5/docs%2FTRIAGE_AND_LABELS.md",
            "raw_url": "https://github.com/angular/angular/raw/fb12c617a496fcf65ca7c800f13eec387a5b66b5/docs%2FTRIAGE_AND_LABELS.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/docs%2FTRIAGE_AND_LABELS.md?ref=fb12c617a496fcf65ca7c800f13eec387a5b66b5",
            "patch": "@@ -2,15 +2,16 @@\n \n This document describes how the Angular team uses labels and milestones to triage issues on GitHub.\n The basic idea of the process is that caretaker only assigns a component (`comp: *`) label.\n-The owner of the component is then responsible for the secondary / component-level triage.\n+The owner of the component is then responsible for the detailed / component-level triage.\n \n \n ## Label Types\n \n ### Components\n \n The caretaker should be able to determine which component the issue belongs to.\n-The components have a clear piece of source code associated with it within the `/packages/` folder of this repo.\n+The components have a clear piece of source code associated with it within the `/packages/` folder\n+of this repo.\n \n * `comp: animations`\n * `comp: bazel` - @angular/bazel rules\n@@ -48,84 +49,80 @@ We will treat them as a component even thought no specific source tree is associ\n * `comp: performance`\n * `comp: security`\n \n-Sometimes, especially in the case of cross-cutting issues or PRs, these PRs or issues belong to multiple components.\n-In these cases, all applicable component labels should be used to triage the issue or PR.\n+Sometimes, especially in the case of cross-cutting issues or PRs, these PRs or issues belong to\n+multiple components. In these cases, all applicable component labels should be used to triage the\n+issue or PR.\n \n+## Caretaker Triage Process (Initial Triage)\n \n-### Type\n+The caretaker assigns `comp:  *` labels to new issues as they come in.\n+Untriaged issues can be found by selecting the issues with no milestone.\n \n-What kind of problem is this?\n+If an issue or PR obviously relates to a release regression, the caretaker must assign an\n+appropriate priority (`P0` or `P1`) and ensure that someone from the team is actively working to\n+resolve it.\n \n-* `type: RFC / discussion / question`\n-* `type: bug`\n-* `type: docs`\n-* `type: feature`\n-* `type: performance`\n-* `type: refactor`\n-* `type: use-case`\n-* `type: confusing`\n+Initial triage should occur daily so that issues can move into detailed triage.\n \n+Once the initial triage is done, the ng-bot automatically adds the milestone `needs triage`.\n \n-## Caretaker Triage Process (Primary Triage)\n+## Detailed Triage\n \n-It is the caretaker's responsibility to assign `comp:  *` to each new issue as they come in.\n-Issues that haven't been triaged can be found by selecting the issues with no milestone.\n+Detailed triage can be done by anyone familiar with the issue subject matter.\n \n-If it's obvious that the issue or PR is related to a release regression, the caretaker is also responsible for assigning the `severity(5): regression` label to make the issue or PR highly visible.\n+### Step 1: Does the issue have enough information?\n \n-The primary triage should be done on a daily basis so that the issues become available for secondary triage without much of delay.\n+Gauge whether the issue has enough information to act upon. This typically includes a test case\n+via StackBlitz or GitHub and steps to reproduce. If the issue may be legitimate but needs more\n+information, add the \"needs clarification\" label. These labels can be revisted if the author can\n+provide further clarification. If the issue does have enough information, move on to step 2.\n \n-The reason why we limit the responsibility of the caretaker to this one label is that it is likely that without domain knowledge the caretaker could mislabel issues or lack knowledge of duplicate issues.\n+### Step 2: Bug, feature, or discussion?\n \n-Once the primary triage is done, the ng-bot automatically adds the milestone `needsTriage`.\n+By default, all issues are considered bugs. Bug reports require only a priority label.\n \n+If the issue is a feature request, apply the \"feature\" label. Use your judgement to determine\n+whether the feature request is reasonable. If it's clear that the issue requests something\n+infeasible, close the issue with a comment explaining why.\n \n-## Component's owner Triage Process\n+If the issue is an RFC or discussion, apply the \"discussion\" label. Use your judgement to determine\n+whether this discussion belongs on GitHub. Discussions here should pertain to the technical\n+implementation details of Angular. Redirect requests for debugging help or advice to a more\n+appropriate channel unless they're capturing a legitimate bug. \n \n-The component owner is responsible for assigning one of the labels from each of these categories to the issues that have the milestone `needsTriage`:\n+### Step 3: Set a Priority\n \n-- `type: *`\n-- `frequency: *` (only required for `type: bug/fix`)\n-- `severity: *` (only required for `type: bug/fix`)\n+For bug reports, set a priority label.\n \n-We've adopted the issue categorization based on [user pain](http://www.lostgarden.com/2008/05/improving-bug-triage-with-user-pain.html) used by AngularJS. In this system every issue is assigned frequency and severity based on which the total user pain score is calculated.\n+| Label | Description |\n+|----|------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|\n+| P0 | An issue that causes a full outage, breakage, or major function unavailability for everyone, without any known workaround. The issue must be fixed immediately, taking precedence over all other work. Should receive updates at least once per day. |\n+| P1 | An issue that significantly impacts a large percentage of users; if there is a workaround it is partial or overly painful. The issue should be resolved before the next release.                                                                     |\n+| P2 | The issue is important to a large percentage of users, with a workaround. Issues that are significantly ugly or painful (especially first-use or install-time issues). Issues with workarounds that would otherwise be P0 or P1.                     |\n+| P3 | An issue that is relevant to core functions, but does not impede progress. Important, but not urgent.                                                                                                                                                |\n+| P4 | A relatively minor issue that is not relevant to core functions, or relates only to the attractiveness or pleasantness of use of the system. Good to have but not necessary changes/fixes.                                                           |\n+| P5 | The team acknowledges the request but (due to any number of reasons) does not plan to work on or accept contributions for this request. The issue remains open for discussion.                                                                       |\n \n-The issues with type `type: feature`, `type: refactor` and `type: RFC / Discussion / question` do not require a frequency and severity.\n \n-Following is the definition of various frequency and severity levels:\n+Issues marked with \"feature\" or \"discussion\" don't require a priority. \n \n-1. `freq(score): *` – How often does this issue come up? How many developers does this affect?\n-    * low (1) - obscure issue affecting a handful of developers\n-    * moderate (2) - impacts auxiliary usage patterns, only small number of applications are affected\n-    * high (3) - impacts primary usage patterns, affecting most Angular apps\n-    * critical (4) - impacts all Angular apps\n-1. `severity(score): *` - How bad is the issue?\n-    * inconvenience (1) - causes ugly/boilerplate code in apps\n-    * confusing (2) - unexpected or inconsistent behavior; hard-to-debug\n-    * broken expected use (3) - it's hard or impossible for a developer using Angular to accomplish something that Angular should be able to do\n-    * memory leak (4)\n-    * regression (5) - functionality that used to work no longer works in a new release due to an unintentional change\n-    * security issue (6)\n+### Step 4: Apply additional information labels\n \n+Many optional labels provide additional context for issues. Consider adding any of the following if\n+they apply to the issue:\n \n-These criteria are then used to calculate a \"user pain\" score as follows:\n+* Browser or operating system labels (`windows`, `ie11`, etc.)\n+* Labels that inform the severity (`regression`, `has workaround`, `no workaround`)\n+* Labels that categorize the bug (`performance`, `refactoring`, `memory leak`)\n+* Community engagement labels (`good first issue`)\n \n-`pain = severity × frequency`\n-\n-This score can then be used to estimate the impact of the issue which helps with prioritization.\n-\n-Once the component's owner triage is done, the ng-bot automatically changes the milestone from `needsTriage` to `Backlog`.\n+Once this triage is done, the ng-bot automatically changes the milestone from `needs triage` to\n+`Backlog`.\n \n \n ## Triaging PRs\n \n-Triaging PRs is the same as triaging issues, except that the labels `frequency: *` and `severity: *` are replaced by:\n-- `effort*`\n-- `risk: *`\n-\n-PRs also have additional label categories that should be used to signal their state.\n-\n-Every triaged PR must have a `action: *` label assigned to it:\n+PRs labels signal their state. Every triaged PR must have a `action: *` label assigned to it:\n \n * `action: discuss`: Discussion is needed, to be led by the author.\n   * _**Who adds it:** Typically the PR author._"
        }
    ],
    "stats": {
        "total": 127,
        "additions": 64,
        "deletions": 63
    }
}