{
    "author": "sumitarora",
    "message": "docs(devtools): updating documentation",
    "sha": "fec092d764877a02cc54f643d983c65c0276201c",
    "files": [
        {
            "sha": "d3eb12ea4f786ff8ddb83e5f323bf052798742c4",
            "filename": "docs/assets/open-devtools.gif",
            "status": "added",
            "additions": 0,
            "deletions": 0,
            "changes": 0,
            "blob_url": "https://github.com/angular/angular/blob/fec092d764877a02cc54f643d983c65c0276201c/docs%2Fassets%2Fopen-devtools.gif",
            "raw_url": "https://github.com/angular/angular/raw/fec092d764877a02cc54f643d983c65c0276201c/docs%2Fassets%2Fopen-devtools.gif",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/docs%2Fassets%2Fopen-devtools.gif?ref=fec092d764877a02cc54f643d983c65c0276201c"
        },
        {
            "sha": "0f1eb8f54292dba12dc56e9309a79982521d18eb",
            "filename": "docs/overview.md",
            "status": "modified",
            "additions": 30,
            "deletions": 22,
            "changes": 52,
            "blob_url": "https://github.com/angular/angular/blob/fec092d764877a02cc54f643d983c65c0276201c/docs%2Foverview.md",
            "raw_url": "https://github.com/angular/angular/raw/fec092d764877a02cc54f643d983c65c0276201c/docs%2Foverview.md",
            "contents_url": "https://api.github.com/repos/angular/angular/contents/docs%2Foverview.md?ref=fec092d764877a02cc54f643d983c65c0276201c",
            "patch": "@@ -1,9 +1,9 @@\n - [Overview](#overview)\n   - [Bug reports](#bug-reports)\n-  - [Components](#components)\n-    - [Exploring the component tree](#exploring-the-component-tree)\n-    - [Viewing properties of a Component](#viewing-properties-of-a-component)\n-    - [Navigate to DOM node](#navigate-to-dom-node)\n+  - [Debugging your application](#debugging-your-application)\n+    - [Exploring the structure of the application](#exploring-the-structure-of-the-application)\n+    - [Viewing properties](#viewing-properties)\n+    - [Navigate to the host node](#navigate-to-the-host-node)\n     - [Navigate to source](#navigate-to-source)\n     - [Update property value](#update-property-value)\n     - [Access selected component in console](#access-selected-component-in-console)\n@@ -18,53 +18,61 @@\n \n # Overview\n \n-Angular DevTools is a Chrome extension, which provides debugging and profiling experience for **Angular (AngularTS or Angular2) Ivy** projects. To use DevTools, your project must be already compatible with Angular Ivy since the tooling uses Ivy-specific APIs.\n+Angular DevTools is a Chrome extension that provides debugging and profiling capabilities for Angular applications. Angular Devtools supports Angular v9 and above, with Ivy enabled.\n \n You can install devtools from Chrome Webstore by searching \"Angular Devtools\" or can click here.\n \n-Once installed, open Chrome DevTools. You should see an \"Angular\" tab. When you open it, you'll see two additional tabs:\n+Once installed, open Chrome DevTools. You should see an \"Angular\" tab.\n \n-- [Components](#components) - provides a component explorer functionality, which lets you preview and modify the component tree of your application.\n+![component explorer](assets/open-devtools.gif)\n+\n+When you open it, you'll see two additional tabs:\n+\n+- [Components](#components) - allows you to explore the components and directives in your application and preview or edit their state.\n - [Profiler](#profiler) - allows you to profile your application and understand what is the performance bottleneck during change detection execution.\n \n ![devtools](assets/devtools.png)\n \n-You will also see the version of Angular your application is using in the top right corner followed by the commit version of Devtools you are using.\n+At the top-right corner of Angular DevTools you'll find what is the version of Angular running on the page as well as the latest commit hash for the extension.\n \n ## Bug reports\n \n You can **report issues and feature requests [here](https://github.com/rangle/angular-devtools/issues)**.\n \n-If you're reporting issue in the profiler, make sure you export the recording to a JSON file and apply it as an attachment. To help us fix the issue faster, please list the steps which caused it, and share instructions on how to reproduce the problem with your codebase.\n+When opening an issue, please follow the issue template provided.\n \n-## Components\n+If you're reporting an issue with the profiler, export the profiler recording by clicking the \"save profile\" button, and then attach that export as a file in the issue.\n \n-The components tab shows the component tree displaying a hierarchical relationship of the components. You can visualize and inspect the component tree of your application. Additionally, you can also preview and modify the properties of a particular component, view its source, and navigate to the element in Chrome Devtools.\n+> Make sure while exporting profiler recording, it does not contain any proprietary information.\n \n-### Exploring the component tree\n+## Debugging your application\n \n-The component tree displays a hierarchical relationship of the _components_. When a _component_ is selected, Devtools presents additional information about the selected _component_.\n+The component tab allows you to explore the structure of your application. You can visualize and inspect the component and directive instances and preview or modify their state. In the next a couple of sections we'll look into how you can use this tab effectively to debug your application.\n \n-In the screenshot below, you can see the component tree of an application:\n+### Exploring the structure of the application\n+\n+The component tree displays a hierarchical relationship of the _components_ and _directives_ within your application. When you select a component or directive instance, Angular DevTools presents additional information about it.\n \n ![component explorer](assets/component-explorer.png)\n \n-### Viewing properties of a Component\n+In the screenshot above, you can see the component tree of an application.\n+\n+### Viewing properties\n \n-You can click on the individual elements to select them and preview their properties. Component properties will get displayed on the left-hand side of the component tree. To navigate in the component tree, you can use the arrows:\n+You can click on the individual components or directives to select them and preview their properties. Component properties will get displayed on the right-hand side of the component tree. To navigate in the component tree, you can use the arrows:\n \n-- Up & down to select the previous and next nodes.\n-- Left & right to collapse and expand a node.\n+- Up and down to select the previous and next nodes.\n+- Left and right to collapse and expand a node.\n \n-If you have a lot of components and directives, you can look up for a particular element using the search box at the top. It'll perform a case insensitive exact substring match and highlight the found nodes. To navigate to the next search match, just press \"Enter.\" To navigate to the previous search match, press \"Shift + Enter.\"\n+To look up for a component or directive by name use the search box at the top. It'll perform a case insensitive exact substring match and highlight the found nodes. To navigate to the next search match, just press \"Enter.\" To navigate to the previous search match, press \"Shift + Enter.\"\n \n ![search](assets/search.gif)\n \n-### Navigate to DOM node\n+### Navigate to the host node\n \n-To go to the host element of a particular component or directive, just double-click on it. Chrome DevTools will open the Elements tab and select the associated DOM element if available.\n+To go to the host element of a particular component or directive, just double-click on it. Chrome DevTools will open the Elements tab and select the associated DOM node.\n \n-![navigate dom](assets/navigate-dom.gif)\n+![Navigate to DOM](assets/navigate-dom.gif)\n \n ### Navigate to source\n "
        }
    ],
    "stats": {
        "total": 52,
        "additions": 30,
        "deletions": 22
    }
}