{
    "author": "Trott",
    "message": "doc: revise deprecation semverness info in Collaborator Guide\n\nSimplify and clarify deprecation semverness information in the\nCollaborator Guide. Unlike some of the other changes I've made lately,\nthis one is not merely cosmetic. It changes information about how to\nhandle deprecations vis-a-vis SemVer. The revised conventions take\nadvange of `notable change` labels etc. instead of suggesting that\ndoc-deprecations be treated as `semver-minor`. The idea that a\ndeprecation is a new feature seems incorrect from a SemVer perspective,\nbut probably made sense at the time the text was written if we weren't\nyet using `notable change` etc.\n\nPR-URL: https://github.com/nodejs/node/pull/26232\nReviewed-By: Ruben Bridgewater <ruben@bridgewater.de>",
    "sha": "04d5c1b8fde631e82b4b3d025e5532e8d05add39",
    "files": [
        {
            "sha": "9456d64c64ecb72dff5fd50b38b77f7b5aed6518",
            "filename": "COLLABORATOR_GUIDE.md",
            "status": "modified",
            "additions": 6,
            "deletions": 6,
            "changes": 12,
            "blob_url": "https://github.com/nodejs/node/blob/04d5c1b8fde631e82b4b3d025e5532e8d05add39/COLLABORATOR_GUIDE.md",
            "raw_url": "https://github.com/nodejs/node/raw/04d5c1b8fde631e82b4b3d025e5532e8d05add39/COLLABORATOR_GUIDE.md",
            "contents_url": "https://api.github.com/repos/nodejs/node/contents/COLLABORATOR_GUIDE.md?ref=04d5c1b8fde631e82b4b3d025e5532e8d05add39",
            "patch": "@@ -339,13 +339,13 @@ documentation must state the deprecation status.\n   * Backward-incompatible changes including complete removal of such APIs may\n     occur at any time.\n \n-Documentation-Only Deprecations may be handled as semver-minor or semver-major\n-changes. Such deprecations have no impact on the successful operation of running\n-code and therefore should not be viewed as breaking changes.\n+Apply the `notable change` label to all pull requests that introduce\n+Documentation-Only Deprecations. Such deprecations have no impact on code\n+execution. Thus, they are not breaking changes (`semver-major`).\n \n-Runtime Deprecations and End-of-life APIs (internal or public) must be\n-handled as semver-major changes unless there is TSC consensus to land the\n-deprecation as a semver-minor.\n+Runtime Deprecations and End-of-life APIs (internal or public) are breaking\n+changes (`semver-major`). The TSC may make exceptions, deciding that one of\n+these deprecations is not a breaking change.\n \n All Documentation-Only and Runtime deprecations will be assigned a unique\n identifier that can be used to persistently refer to the deprecation in"
        }
    ],
    "stats": {
        "total": 12,
        "additions": 6,
        "deletions": 6
    }
}