{
    "author": "Trott",
    "message": "doc: revise Waiting for Approvals documentation\n\nRevise the Waiting for Approvals section of the Collaborator Guide. Keep\nsentences short and clear. Split long paragraphs into shorter\nparagraphs.\n\nPR-URL: https://github.com/nodejs/node/pull/24845\nReviewed-By: Richard Lau <riclau@uk.ibm.com>\nReviewed-By: Daniel Bevenius <daniel.bevenius@gmail.com>\nReviewed-By: Colin Ihrig <cjihrig@gmail.com>\nReviewed-By: Anto Aravinth <anto.aravinth.cse@gmail.com>\nReviewed-By: Vse Mozhet Byt <vsemozhetbyt@gmail.com>\nReviewed-By: Jeremiah Senkpiel <fishrock123@rocketmail.com>",
    "sha": "07018b7c1a98883d98d9adb4cb4b979553004b89",
    "files": [
        {
            "sha": "48915c4fc4085a2d4cf664d73286bd2fe878caeb",
            "filename": "COLLABORATOR_GUIDE.md",
            "status": "modified",
            "additions": 17,
            "deletions": 15,
            "changes": 32,
            "blob_url": "https://github.com/nodejs/node/blob/07018b7c1a98883d98d9adb4cb4b979553004b89/COLLABORATOR_GUIDE.md",
            "raw_url": "https://github.com/nodejs/node/raw/07018b7c1a98883d98d9adb4cb4b979553004b89/COLLABORATOR_GUIDE.md",
            "contents_url": "https://api.github.com/repos/nodejs/node/contents/COLLABORATOR_GUIDE.md?ref=07018b7c1a98883d98d9adb4cb4b979553004b89",
            "patch": "@@ -147,28 +147,30 @@ the TSC meeting agenda.\n \n ### Waiting for Approvals\n \n-Before landing pull requests, sufficient time should be left for input\n-from other Collaborators. In general, leave at least 48 hours to account for\n-international time differences and work schedules. However, certain types of\n-pull requests can be fast-tracked and may be landed after a shorter delay. For\n-example:\n+Before landing pull requests, allow 48 hours for input from other Collaborators.\n+Certain types of pull requests can be fast-tracked and may land after a shorter\n+delay. For example:\n \n * Focused changes that affect only documentation and/or the test suite:\n-  * `code-and-learn` tasks typically fall into this category.\n+  * `code-and-learn` tasks often fall into this category.\n   * `good-first-issue` pull requests may also be suitable.\n * Changes that fix regressions:\n   * Regressions that break the workflow (red CI or broken compilation).\n   * Regressions that happen right before a release, or reported soon after.\n \n-When a pull request is deemed suitable to be fast-tracked, label it with\n-`fast-track` and add a comment that collaborators may upvote. Please mention any\n-Collaborators that previously approved the pull request. If someone disagrees\n-with the fast-tracking request, remove the label and leave a comment indicating\n-why the pull request should not be fast-tracked. The pull request can be landed\n-once two or more Collaborators approve both the pull request and the\n-fast-tracking request, and the necessary CI testing is done. A request to\n-fast-track a PR made by a different Collaborator than the pull-request author\n-counts as a fast-track approval.\n+To propose fast-tracking a pull request, apply the `fast-track` label. Then add\n+a comment that Collaborators may upvote.\n+\n+If someone disagrees with the fast-tracking request, remove the label. Do not\n+fast-track the pull request in that case.\n+\n+The pull request may be fast-tracked if two Collaborators approve the\n+fast-tracking request. To land, the pull request itself still needs two\n+Collaborator approvals and a passing CI.\n+\n+Collaborators may request fast-tracking of pull requests they did not author.\n+In that case only, the request itself is also one fast-track approval. Upvote\n+the comment anyway to avoid any doubt.\n \n ### Testing and CI\n "
        }
    ],
    "stats": {
        "total": 32,
        "additions": 17,
        "deletions": 15
    }
}