{
    "author": "gireeshpunathil",
    "message": "doc: clarify lifecycle of domain sockets\n\nIn UNIX, the domain sockets once created persists until unlinked.\nClarify which ones are persisted and which ones are cleared manually.\n\nIn Windows, named pipes are cleared based on reference count,\nimplemented by the underlying system. Disambiguate this from\nGarbage collection of the Node.js runtime.\n\nRefs: https://github.com/nodejs/help/issues/1080\n\nPR-URL: https://github.com/nodejs/node/pull/19471\nReviewed-By: Luigi Pinca <luigipinca@gmail.com>\nReviewed-By: Vse Mozhet Byt <vsemozhetbyt@gmail.com>",
    "sha": "53aaa55a3aa0a001179df4692487d830afd3a245",
    "files": [
        {
            "sha": "c3192c84c8ed13d37e75b879e81dbd7245870726",
            "filename": "doc/api/net.md",
            "status": "modified",
            "additions": 16,
            "deletions": 7,
            "changes": 23,
            "blob_url": "https://github.com/nodejs/node/blob/53aaa55a3aa0a001179df4692487d830afd3a245/doc%2Fapi%2Fnet.md",
            "raw_url": "https://github.com/nodejs/node/raw/53aaa55a3aa0a001179df4692487d830afd3a245/doc%2Fapi%2Fnet.md",
            "contents_url": "https://api.github.com/repos/nodejs/node/contents/doc%2Fapi%2Fnet.md?ref=53aaa55a3aa0a001179df4692487d830afd3a245",
            "patch": "@@ -26,20 +26,29 @@ sockets on other operating systems.\n [`socket.connect()`][] take a `path` parameter to identify IPC endpoints.\n \n On UNIX, the local domain is also known as the UNIX domain. The path is a\n-filesystem path name. It gets truncated to `sizeof(sockaddr_un.sun_path) - 1`,\n+filesystem pathname. It gets truncated to `sizeof(sockaddr_un.sun_path) - 1`,\n which varies on different operating system between 91 and 107 bytes.\n The typical values are 107 on Linux and 103 on macOS. The path is\n subject to the same naming conventions and permissions checks as would be done\n-on file creation. It will be visible in the filesystem, and will *persist until\n-unlinked*.\n+on file creation. If the UNIX domain socket (that is visible as a file system\n+path) is created and used in conjunction with one of Node.js' API abstractions\n+such as [`net.createServer()`][], it will be unlinked as part of\n+[`server.close()`][]. On the other hand, if it is created and used outside of\n+these abstractions, the user will need to manually remove it. The same applies\n+when the path was created by a Node.js API but the program crashes abruptly.\n+In short, a UNIX domain socket once successfully created will be visible in the\n+filesystem, and will persist until unlinked.\n \n On Windows, the local domain is implemented using a named pipe. The path *must*\n refer to an entry in `\\\\?\\pipe\\` or `\\\\.\\pipe\\`. Any characters are permitted,\n but the latter may do some processing of pipe names, such as resolving `..`\n-sequences. Despite appearances, the pipe name space is flat. Pipes will *not\n-persist*, they are removed when the last reference to them is closed. Do not\n-forget JavaScript string escaping requires paths to be specified with\n-double-backslashes, such as:\n+sequences. Despite how it might look, the pipe namespace is flat. Pipes will\n+*not persist*. They are removed when the last reference to them is closed.\n+Unlike UNIX domain sockets, Windows will close and remove the pipe when the\n+owning process exits.\n+\n+JavaScript string escaping requires paths to be specified with extra backslash\n+escaping such as:\n \n ```js\n net.createServer().listen("
        }
    ],
    "stats": {
        "total": 23,
        "additions": 16,
        "deletions": 7
    }
}