{
    "author": "unknown",
    "message": "doc: add guide about abi stability\n\nRe: https://github.com/nodejs/abi-stable-node/issues/332#issuecomment-418379903\nPR-URL: https://github.com/nodejs/node/pull/23229\nReviewed-By: Gireesh Punathil <gpunathi@in.ibm.com>\nReviewed-By: Michael Dawson <michael_dawson@ca.ibm.com>",
    "sha": "65366addb29f195f53b700ba0de43381342086d7",
    "files": [
        {
            "sha": "bbb4733c59d83f38fa964cd8bac6d01611512498",
            "filename": "doc/guides/abi-stability.md",
            "status": "added",
            "additions": 113,
            "deletions": 0,
            "changes": 113,
            "blob_url": "https://github.com/nodejs/node/blob/65366addb29f195f53b700ba0de43381342086d7/doc%2Fguides%2Fabi-stability.md",
            "raw_url": "https://github.com/nodejs/node/raw/65366addb29f195f53b700ba0de43381342086d7/doc%2Fguides%2Fabi-stability.md",
            "contents_url": "https://api.github.com/repos/nodejs/node/contents/doc%2Fguides%2Fabi-stability.md?ref=65366addb29f195f53b700ba0de43381342086d7",
            "patch": "@@ -0,0 +1,113 @@\n+# ABI Stability\n+\n+## Introduction\n+An Application Binary Interface (ABI) is a way for programs to call functions\n+and use data structures from other compiled programs. It is the compiled version\n+of an Application Programming Interface (API). In other words, the headers files\n+describing the classes, functions, data structures, enumerations, and constants\n+which enable an application to perform a desired task correspond by way of\n+compilation to a set of addresses and expected parameter values and memory\n+structure sizes and layouts with which the provider of the ABI was compiled.\n+\n+The application using the ABI must be compiled such that the available\n+addresses, expected parameter values, and memory structure sizes and layouts\n+agree with those with which the ABI provider was compiled. This is usually\n+accomplished by compiling against the headers provided by the ABI provider.\n+\n+Since the provider of the ABI and the user of the ABI may be compiled at\n+different times with different versions of the compiler, a portion of the\n+responsibility for ensuring ABI compatibility lies with the compiler. Different\n+versions of the compiler, perhaps provided by different vendors, must all\n+produce the same ABI from a header file with a certain content, and must produce\n+code for the application using the ABI that accesses the API described in a\n+given header according to the conventions of the ABI resulting from the\n+description in the header. Modern compilers have a fairly good track record of\n+not breaking the ABI compatibility of the applications they compile.\n+\n+The remaining responsibility for ensuring ABI compatibility lies with the team\n+maintaining the header files which provide the API that results, upon\n+compilation, in the ABI that is to remain stable. Changes to the header files\n+can be made, but the nature of the changes has to be closely tracked to ensure\n+that, upon compilation, the ABI does not change in a way that will render\n+existing users of the ABI incompatible with the new version.\n+\n+## ABI Stability in Node.js\n+Node.js provides header files maintained by several independent teams. For\n+example, header files such as `node.h` and `node_buffer.h` are maintained by\n+the Node.js team. `v8.h` is maintained by the V8 team, which, although in close\n+co-operation with the Node.js team, is independent, and with its own schedule\n+and priorities. Thus, the Node.js team has only partial control over the\n+changes that are introduced in the headers the project provides. As a result,\n+the Node.js project has adopted [semantic versioning](https://semver.org/).\n+This ensures that the APIs provided by the project will result in a stable ABI\n+for all minor and patch versions of Node.js released within one major version.\n+In practice, this means that the Node.js project has committed itself to\n+ensuring that a Node.js native addon compiled against a given major version of\n+Node.js will load successfully when loaded by any Node.js minor or patch version\n+within the major version against which it was compiled.\n+\n+## N-API\n+Demand has arisen for equipping Node.js with an API that results in an ABI that\n+remains stable across multiple Node.js major versions. The motivation for\n+creating such an API is as follows:\n+* The JavaScript language has remained compatible with itself since its very\n+early days, whereas the ABI of the engine executing the JavaScript code changes\n+with every major version of Node.js. This means that applications consisting of\n+Node.js packages written entirely in JavaScript need not be recompiled,\n+reinstalled, or redeployed as a new major version of Node.js is dropped into\n+the production environment in which such applications run. In contrast, if an\n+application depends on a package that contains a native addon, the application\n+has to be recompiled, reinstalled, and redeployed whenever a new major version\n+of Node.js is introduced into the production environment. This disparity\n+between Node.js packages containing native addons and those that are written\n+entirely in JavaScript has added to the maintenance burden of production\n+systems which rely on native addons.\n+\n+* Other projects have started to produce JavaScript interfaces that are\n+essentially alternative implementations of Node.js. Since these projects are\n+usually built on a different JavaScript engine than V8, their native addons\n+necessarily take on a different structure and use a different API. Nevertheless,\n+using a single API for a native addon across different implementations of the\n+Node.js JavaScript API would allow these projects to take advantage of the\n+ecosystem of JavaScript packages that has accrued around Node.js.\n+\n+* Node.js may contain a different JavaScript engine in the future. This means\n+that, externally, all Node.js interfaces would remain the same, but the V8\n+header file would be absent. Such a step would cause the disruption of the\n+Node.js ecosystem in general, and that of the native addons in particular, if\n+an API that is JavaScript engine agnostic is not first provided by Node.js and\n+adopted by native addons.\n+\n+To these ends Node.js has introduced N-API in version 8.6.0 and marked it as a\n+stable component of the project as of Node.js 8.12.0. The API is defined in the\n+headers [`node_api.h`][] and [`node_api_types.h`][], and provides a forward-\n+compatibility guarantee that crosses the Node.js major version boundary. The\n+guarantee can be stated as follows:\n+\n+**A given version *n* of N-API will be available in the major version of\n+Node.js in which it was published, and in all subsequent versions of Node.js,\n+including subsequent major versions.**\n+\n+A native addon author can take advantage of the N-API forward compatibility\n+guarantee by ensuring that the addon makes use only of APIs defined in\n+`node_api.h` and data structures and constants defined in `node_api_types.h`.\n+By doing so, the author facilitates adoption of their addon by indicating to\n+production users that the maintenance burden for their application will increase\n+no more by the addition of the native addon to their project than it would by\n+the addition of a package written purely in JavaScript.\n+\n+N-API is versioned because new APIs are added from time to time. Unlike\n+semantic versioning, N-API versioning is cumulative. That is, each version of\n+N-API conveys the same meaning as a minor version in the semver system, meaning\n+that all changes made to N-API will be backwards compatible. Additionally, new\n+N-APIs are added under an experimental flag to give the community an opportunity\n+to vet them in a production environment. Experimental status means that,\n+although care has been taken to ensure that the new API will not have to be\n+modified in an ABI-incompatible way in the future, it has not yet been\n+sufficiently proven in production to be correct and useful as designed and, as\n+such, may undergo ABI-incompatible changes before it is finally incorporated\n+into a forthcoming version of N-API. That is, an experimental N-API is not yet\n+covered by the forward compatibility guarantee.\n+\n+[`node_api.h`]: ../../src/node_api.h\n+[`node_api_types.h`]: ../..src/node_api_types.h"
        }
    ],
    "stats": {
        "total": 113,
        "additions": 113,
        "deletions": 0
    }
}