{
    "author": "Trott",
    "message": "doc: revise code review guidelines\n\nRevise the Code Reviews section of the Collaborator Guide to remove\nredundant statements, simplify text and structure for easier\ncomprehension, and remove material that does not reflect current\npractices.\n\nPR-URL: https://github.com/nodejs/node/pull/24790\nReviewed-By: Colin Ihrig <cjihrig@gmail.com>\nReviewed-By: Luigi Pinca <luigipinca@gmail.com>\nReviewed-By: Michaël Zasso <targos@protonmail.com>\nReviewed-By: Anto Aravinth <anto.aravinth.cse@gmail.com>",
    "sha": "83ee137c4565112177f22f2c735b266b22262220",
    "files": [
        {
            "sha": "742ed846ea199cb0f64575ef0410c9a61b230a6f",
            "filename": "COLLABORATOR_GUIDE.md",
            "status": "modified",
            "additions": 9,
            "deletions": 16,
            "changes": 25,
            "blob_url": "https://github.com/nodejs/node/blob/83ee137c4565112177f22f2c735b266b22262220/COLLABORATOR_GUIDE.md",
            "raw_url": "https://github.com/nodejs/node/raw/83ee137c4565112177f22f2c735b266b22262220/COLLABORATOR_GUIDE.md",
            "contents_url": "https://api.github.com/repos/nodejs/node/contents/COLLABORATOR_GUIDE.md?ref=83ee137c4565112177f22f2c735b266b22262220",
            "patch": "@@ -100,28 +100,21 @@ request must pass code review and CI before landing into the codebase.\n ### Code Reviews\n \n At least two Collaborators must approve a pull request before the pull request\n-lands. (One Collaborator approval is enough if the pull request has been open\n-for more than 7 days.) Approving a pull request indicates that the Collaborator\n-accepts responsibility for the change. Approval must be from Collaborators who\n-are not authors of the change.\n+lands. One Collaborator approval is enough if the pull request has been open\n+for more than seven days.\n+\n+Approving a pull request indicates that the Collaborator accepts responsibility\n+for the change.\n+\n+Approval must be from Collaborators who are not authors of the change.\n \n In some cases, it may be necessary to summon a GitHub team to a pull request for\n review by @-mention.\n See [Who to CC in the issue tracker](#who-to-cc-in-the-issue-tracker).\n \n-If you are unsure about the modification and are not prepared to take\n-full responsibility for the change, defer to another Collaborator.\n-\n If you are the first Collaborator to approve a pull request that has no CI yet,\n-please start one (see [testing and CI](#testing-and-ci) for further information\n-on how to do that) and post the link to the CI in the PR. Please also start a\n-new CI in case the PR creator pushed new code since the last CI run (due to\n-e.g., an addressed review comment or a rebase).\n-\n-In case there are already enough approvals (`LGTM`), a CI run, and the PR is\n-open longer than the minimum waiting time without any open comments, please do\n-not (only) add another approval. Instead go ahead and land the PR after checking\n-the CI outcome.\n+please [start one](#testing-and-ci). Post the link to the CI in the PR. Please\n+also start a new CI if the PR creator pushed new code since the last CI run.\n \n ### Consensus Seeking\n "
        }
    ],
    "stats": {
        "total": 25,
        "additions": 9,
        "deletions": 16
    }
}