{
    "author": "Trott",
    "message": "doc: remove 72-hour mentions in pull-requests.md\n\nvsemozhetbyt noted that there were two mentions of the now-defunct\n72-hour-rule in pull-requests.md. This change updates the text to\nreflect current wait-time rules.\n\nPR-URL: https://github.com/nodejs/node/pull/23309\nReviewed-By: Sakthipriyan Vairamani <thechargingvolcano@gmail.com>\nReviewed-By: Vse Mozhet Byt <vsemozhetbyt@gmail.com>\nReviewed-By: Colin Ihrig <cjihrig@gmail.com>\nReviewed-By: Luigi Pinca <luigipinca@gmail.com>\nReviewed-By: Trivikram Kamat <trivikr.dev@gmail.com>",
    "sha": "b155358235df5b4158607787dc18d82e05ceea02",
    "files": [
        {
            "sha": "b83624ac5febbba028000dfe9f88be457116d2d3",
            "filename": "doc/guides/contributing/pull-requests.md",
            "status": "modified",
            "additions": 10,
            "deletions": 12,
            "changes": 22,
            "blob_url": "https://github.com/nodejs/node/blob/b155358235df5b4158607787dc18d82e05ceea02/doc%2Fguides%2Fcontributing%2Fpull-requests.md",
            "raw_url": "https://github.com/nodejs/node/raw/b155358235df5b4158607787dc18d82e05ceea02/doc%2Fguides%2Fcontributing%2Fpull-requests.md",
            "contents_url": "https://api.github.com/repos/nodejs/node/contents/doc%2Fguides%2Fcontributing%2Fpull-requests.md?ref=b155358235df5b4158607787dc18d82e05ceea02",
            "patch": "@@ -496,12 +496,11 @@ There is a minimum waiting time which we try to respect for non-trivial\n changes, so that people who may have important input in such a distributed\n project are able to respond.\n \n-For non-trivial changes, Pull Requests must be left open for *at least* 48\n-hours during the week, and 72 hours on a weekend. In most cases, when the\n-PR is relatively small and focused on a narrow set of changes, these periods\n-provide more than enough time to adequately review. Sometimes changes take far\n-longer to review, or need more specialized review from subject matter experts.\n-When in doubt, do not rush.\n+For non-trivial changes, Pull Requests must be left open for at least 48 hours.\n+In most cases, when the PR is relatively small and focused on a narrow set of\n+changes, that will provide more than enough time to adequately review. Sometimes\n+changes take far longer to review, or need more specialized review from subject\n+matter experts. When in doubt, do not rush.\n \n Trivial changes, typically limited to small formatting changes or fixes to\n documentation, may be landed within the minimum 48 hour window.\n@@ -643,12 +642,11 @@ If not, you can ask a Collaborator to start a CI run.\n \n ### Waiting Until the Pull Request Gets Landed\n \n-A Pull Request needs to stay open for at least 48 hours (72 hours on a\n-weekend) from when it is submitted, even after it gets approved and\n-passes the CI. This is to make sure that everyone has a chance to\n-weigh in. If the changes are trivial, collaborators may decide it\n-doesn't need to wait. A Pull Request may well take longer to be\n-merged in. All these precautions are important because Node.js is\n+A Pull Request needs to stay open for at least 48 hours from when it is\n+submitted, even after it gets approved and passes the CI. This is to make sure\n+that everyone has a chance to weigh in. If the changes are trivial,\n+collaborators may decide it doesn't need to wait. A Pull Request may well take\n+longer to be merged in. All these precautions are important because Node.js is\n widely used, so don't be discouraged!\n \n ### Check Out the Collaborator Guide"
        }
    ],
    "stats": {
        "total": 22,
        "additions": 10,
        "deletions": 12
    }
}