{
    "author": "Trott",
    "message": "doc: make minor improvements to collab guide\n\nPR-URL: https://github.com/nodejs/node/pull/21862\nReviewed-By: Vse Mozhet Byt <vsemozhetbyt@gmail.com>\nReviewed-By: Gus Caplan <me@gus.host>\nReviewed-By: Michaël Zasso <targos@protonmail.com>\nReviewed-By: Trivikram Kamat <trivikr.dev@gmail.com>\nReviewed-By: James M Snell <jasnell@gmail.com>\nReviewed-By: Ruben Bridgewater <ruben@bridgewater.de>",
    "sha": "e406cca5c3eb768dd66301fcac5429223e200955",
    "files": [
        {
            "sha": "818fd7cc96744309071a3a7cf7c1ece5ff6b7ba0",
            "filename": "COLLABORATOR_GUIDE.md",
            "status": "modified",
            "additions": 16,
            "deletions": 17,
            "changes": 33,
            "blob_url": "https://github.com/nodejs/node/blob/e406cca5c3eb768dd66301fcac5429223e200955/COLLABORATOR_GUIDE.md",
            "raw_url": "https://github.com/nodejs/node/raw/e406cca5c3eb768dd66301fcac5429223e200955/COLLABORATOR_GUIDE.md",
            "contents_url": "https://api.github.com/repos/nodejs/node/contents/COLLABORATOR_GUIDE.md?ref=e406cca5c3eb768dd66301fcac5429223e200955",
            "patch": "@@ -67,7 +67,7 @@ For first-time contributors, check if the commit author is the same as the\n pull request author, and ask if they have configured their git\n username and email to their liking as per [this guide][git-username].\n This is to make sure they would be promoted to \"contributor\" once\n-their pull request gets landed.\n+their pull request lands.\n \n ### Closing Issues and Pull Requests\n \n@@ -82,32 +82,31 @@ necessary.\n ### Author ready pull requests\n \n A pull request that is still awaiting the minimum review time is considered\n-`author-ready` as soon as the CI has been started, it has at least one approval,\n+_author ready_ as soon as the CI has been started, it has at least one approval,\n and it has no outstanding review comments. Please always make sure to add the\n-appropriate `author-ready` label to the PR in that case and remove it again as\n-soon as that condition is not met anymore.\n+`author ready` label to the PR in that case and remove it again as soon as that\n+condition is not met anymore.\n \n ### Handling own pull requests\n \n-If you as a Collaborator open a pull request, it is recommended to start a CI\n-right after (see [testing and CI](#testing-and-ci) for further information on\n-how to do that) and to post the link to it as well. Starting a new CI after each\n-update is also recommended (due to e.g., a change request in a review or due to\n-rebasing).\n+When you open a pull request, it is recommended to start a CI right away (see\n+[testing and CI](#testing-and-ci) for instructions) and to post the link to it\n+in a comment in the pull request. Starting a new CI after each update is also\n+recommended (for example, after an additional code change or after rebasing).\n \n-As soon as the PR is ready to land, please go ahead and do so on your own.\n-Landing your own pull requests distributes the work load for each Collaborator\n-equally. If it is still awaiting the\n-[minimum time to land](#waiting-for-approvals), please add the `author-ready`\n-label to it so it is obvious that the PR can land as soon as the time ends.\n+As soon as the PR is ready to land, please do so. Landing your own pull requests\n+allows other Collaborators to focus on other pull requests. If your pull request\n+is still awaiting the [minimum time to land](#waiting-for-approvals), add the\n+`author ready` label so other Collaborators know it can land as soon as the time\n+ends.\n \n ## Accepting Modifications\n \n All modifications to the Node.js code and documentation should be performed via\n GitHub pull requests, including modifications by Collaborators and TSC members.\n A pull request must be reviewed, and must also be tested with CI, before being\n-landed into the codebase. There may be exception to the latter (the changed code\n-can not be tested with a CI or similar). If that is the case, please leave a\n+landed into the codebase. There may be exceptions to the latter (the changed\n+code cannot be tested with a CI or similar). If that is the case, please leave a\n comment that explains why the PR does not require a CI run.\n \n ### Code Reviews\n@@ -140,7 +139,7 @@ the CI outcome.\n If there is no disagreement amongst Collaborators, a pull request should be\n landed given appropriate review, a green CI, and the minimum\n [waiting time](#waiting-for-approvals) for a PR. If it is still awaiting the\n-[minimum time to land](#waiting-for-approvals), please add the `author-ready`\n+[minimum time to land](#waiting-for-approvals), please add the `author ready`\n label to it so it is obvious that the PR can land as soon as the time ends.\n \n Where there is discussion amongst Collaborators, consensus should be sought if"
        }
    ],
    "stats": {
        "total": 33,
        "additions": 16,
        "deletions": 17
    }
}