{
    "author": "jihanurrahman33",
    "message": "fix(curriculum): fix typo in Local Storage review (poses, not posses) (#62037)",
    "sha": "00cc06f49c695295cbf29614840214f2e58ef1ea",
    "files": [
        {
            "sha": "8396a8fcd0b1477dbaf4646ba1dd12e5c351144d",
            "filename": "curriculum/challenges/english/blocks/review-local-storage-and-crud/6723d0ac516099c902394e8b.md",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/00cc06f49c695295cbf29614840214f2e58ef1ea/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Freview-local-storage-and-crud%2F6723d0ac516099c902394e8b.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/00cc06f49c695295cbf29614840214f2e58ef1ea/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Freview-local-storage-and-crud%2F6723d0ac516099c902394e8b.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Freview-local-storage-and-crud%2F6723d0ac516099c902394e8b.md?ref=00cc06f49c695295cbf29614840214f2e58ef1ea",
            "patch": "@@ -117,7 +117,7 @@ The Cache API is a storage mechanism that stores Request and Response objects. W\n \n - **Excessive Tracking**: This refers to the practice of collecting and storing an overabundance of user data in client-side storage (such as cookies, local storage, or session storage) without clear, informed consent or a legitimate need. This often involves tracking user behavior, preferences, and interactions across multiple sites or sessions, which can infringe on user privacy. \n - **Browser Fingerprinting**: A technique used to track and identify individual users based on unique characteristics of their device and browser, rather than relying on cookies or other traditional tracking methods. Unlike cookies, which are stored locally on a user's device, fingerprinting involves collecting a range of information that can be used to create a distinctive \"fingerprint\" of a user's browser session. \n-- **Setting Passwords in LocalStorage**: This might seem like a more obvious negative pattern, but setting any sensitive data like passwords in local storage posses a security risk. Local Storage is not encrypted and can be accessed easily. So you should never store any type of sensitive data in there.\n+- **Setting Passwords in LocalStorage**: This might seem like a more obvious negative pattern, but setting any sensitive data like passwords in local storage poses a security risk. Local Storage is not encrypted and can be accessed easily. So you should never store any type of sensitive data in there.\n \n ## IndexedDB\n "
        }
    ],
    "stats": {
        "total": 2,
        "additions": 1,
        "deletions": 1
    }
}