{
    "author": "camperbot",
    "message": "chore(i18n,client): processed translations (#58960)",
    "sha": "01e3180ac730e75a584c3625c1e54ad1ab7ca57e",
    "files": [
        {
            "sha": "4c1dab4db6d4227409968ee661035aabdf2ba696",
            "filename": "client/i18n/locales/chinese-traditional/intro.json",
            "status": "modified",
            "additions": 2,
            "deletions": 2,
            "changes": 4,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fchinese-traditional%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fchinese-traditional%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fchinese-traditional%2Fintro.json?ref=01e3180ac730e75a584c3625c1e54ad1ab7ca57e",
            "patch": "@@ -2910,7 +2910,7 @@\n       \"workshop-library-manager\": {\n         \"title\": \"Build a Library Manager\",\n         \"intro\": [\n-          \"In this workshop, you will learn higher order array methods by building a library manager\"\n+          \"In this workshop, you will learn higher order array methods by building a library manager.\"\n         ]\n       },\n       \"lab-book-organizer\": {\n@@ -3160,7 +3160,7 @@\n       \"lecture-working-with-maps-and-sets\": {\n         \"title\": \"Working with Maps and Sets\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>\"\n+          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>.\"\n         ]\n       },\n       \"workshop-plant-nursery-catalog\": {"
        },
        {
            "sha": "9dfa8f9eaa17eac9c4e6f1be26047208d051099e",
            "filename": "client/i18n/locales/chinese/intro.json",
            "status": "modified",
            "additions": 2,
            "deletions": 2,
            "changes": 4,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fchinese%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fchinese%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fchinese%2Fintro.json?ref=01e3180ac730e75a584c3625c1e54ad1ab7ca57e",
            "patch": "@@ -2910,7 +2910,7 @@\n       \"workshop-library-manager\": {\n         \"title\": \"Build a Library Manager\",\n         \"intro\": [\n-          \"In this workshop, you will learn higher order array methods by building a library manager\"\n+          \"In this workshop, you will learn higher order array methods by building a library manager.\"\n         ]\n       },\n       \"lab-book-organizer\": {\n@@ -3160,7 +3160,7 @@\n       \"lecture-working-with-maps-and-sets\": {\n         \"title\": \"Working with Maps and Sets\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>\"\n+          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>.\"\n         ]\n       },\n       \"workshop-plant-nursery-catalog\": {"
        },
        {
            "sha": "f7223b7b9d44e06debe27c9e98146d281a7e2d63",
            "filename": "client/i18n/locales/espanol/intro.json",
            "status": "modified",
            "additions": 48,
            "deletions": 50,
            "changes": 98,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fespanol%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fespanol%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fespanol%2Fintro.json?ref=01e3180ac730e75a584c3625c1e54ad1ab7ca57e",
            "patch": "@@ -300,7 +300,7 @@\n     }\n   },\n   \"javascript-algorithms-and-data-structures-v8\": {\n-    \"title\": \"JavaScript Algorithms and Data Structures\",\n+    \"title\": \"Algoritmos y estructuras de datos de JavaScript\",\n     \"intro\": [\n       \"Los desarrolladores usan HTML y CSS para controlar el contenido y estilo de una página. También usan JavaScript para hacer interactiva la página.\",\n       \"En esta certificación de Algoritmos de JavaScript y Estructura de Datos, aprenderas los fundamentos de JavaScript, como variables, arreglos, objetos, bucles, funciones, DOM y mucho más.\",\n@@ -614,7 +614,7 @@\n         \"title\": \"Base de datos de la Tabla Periódica\",\n         \"intro\": [\n           \"Este es uno de los proyectos necesarios para obtener su certificación.\",\n-          \"For this project, you will create a Bash script to get information about chemical elements from a periodic table database.\"\n+          \"Para este proyecto, crearás un script Bash para obtener información sobre elementos químicos desde una base de datos de la tabla periódica.\"\n         ]\n       },\n       \"build-a-salon-appointment-scheduler-project\": {\n@@ -772,9 +772,9 @@\n     }\n   },\n   \"scientific-computing-with-python\": {\n-    \"title\": \"Scientific Computing with Python\",\n+    \"title\": \"Computación científica con Python\",\n     \"intro\": [\n-      \"The Scientific Computing with Python curriculum will equip you with the skills to analyze and manipulate data using Python, a powerful and versatile programming language. You'll learn key concepts like data structures, algorithm, Object Oriented Programming, and how to perform complex calculations using a variety of tools.\",\n+      \"El programa de computación científica con Python te brindará las habilidades para analizar y manipular datos utilizando Python, un lenguaje de programación potente y versátil. Aprenderás conceptos clave como estructuras de datos, algoritmos, programación orientada a objetos y cómo realizar cálculos complejos utilizando una variedad de herramientas.\",\n       \"Este curso guia te guiará hacia los fundamentos de la computación cientifica, incluyendo las estructuras de datos y algoritmos.\"\n     ],\n     \"note\": \"\",\n@@ -1158,8 +1158,8 @@\n     \"title\": \"Preparación de Entrevistas de Programación\",\n     \"intro\": [\n       \"Si está buscando ejercicios gratuitos de programación para prepararse para tu próxima entrevista de trabajo, aquí los tenemos.\",\n-      \"This section contains dozens of coding challenges that test your knowledge of algorithms, data structures, and mathematics. It also has a number of take-home projects you can use to strengthen your skills, or add to your portfolio.\",\n-      \"This work incorporates material from <a href=\\\"https://www.wikipedia.org/\\\" target=\\\"_blank\\\">Wikipedia</a>, which is licensed under the <a href=\\\"https://creativecommons.org/licenses/by-sa/4.0/\\\" target=\\\"_blank\\\">Creative Commons Attribution-ShareAlike License 4.0</a>. The original content might have been modified and adapted. For the unaltered version and additional details, see the original page on <a href=\\\"https://www.wikipedia.org/\\\" target\\\"_blank\\\">Wikipedia</a>.\"\n+      \"Esta sección contiene docenas de desafíos de codificación que ponen a prueba tus conocimientos de algoritmos, estructuras de datos y matemáticas. También incluye una serie de proyectos para llevar a casa que puedes utilizar para fortalecer tus habilidades o agregar a tu portafolio.\",\n+      \"Este trabajo incorpora material de <a href=\\\"https://www.wikipedia.org/\\\" target=\\\"_blank\\\">Wikipedia</a>, que se encuentra bajo la licencia <a href=\\\"https://creativecommons.org/licenses/by-sa/4.0/\\\" target=\\\"_blank\\\">Creative Commons Attribution-ShareAlike License \\\"4,0\\\"</a>. El contenido original puede haber sido modificado y adaptado. Para ver la versión inalterada y obtener más detalles, consulte la página original en <a href=\\\"https://www.wikipedia.org/\\\" target\\\"_blank\\\">Wikipedia</a>.\"\n     ],\n     \"note\": \"El Proyecto Euler y el Proyecto Roseta de Codigo han sido trasladados a sus propio cursos. Volviendo al plan de estudio podemos ver la lista de cursos que nosotros ofrecemos.\",\n     \"blocks\": {\n@@ -1187,7 +1187,7 @@\n     }\n   },\n   \"the-odin-project\": {\n-    \"title\": \"The Odin Project - freeCodeCamp Remix\",\n+    \"title\": \"El Proyecto Odin: Remix de freeCodeCamp\",\n     \"intro\": [\n       \"El Proyecto Odin fue creado en 2013 por un solitario desarrollador, Erik Trautman. A través de los años, ha surgido una comunidad de código abierto para mantener y ampliar el proyecto.\",\n       \"freeCodeCamp ha ampliado el plan de estudios para el código abierto y hacer que se ejecute de forma interactiva en el navegador, con pruebas para evaluar tu código y garantizar que hayas comprendido los conceptos clave.\",\n@@ -1561,74 +1561,72 @@\n         ]\n       },\n       \"a2-english-for-developers-certification-exam\": {\n-        \"title\": \"A2 English for Developers Certification Exam\",\n+        \"title\": \"Examen de certificación de inglés A2 para desarrolladores\",\n         \"intro\": [\n-          \"This exam is required to claim the A2 English for Developers Certification.\"\n+          \"Este examen es necesario para obtener la Certificación A2 de Inglés para Desarrolladores.\"\n         ]\n       }\n     }\n   },\n   \"b1-english-for-developers\": {\n     \"title\": \"B1 Inglés para desarrolladores (Beta)\",\n     \"intro\": [\n-      \"In this English for Developers Curriculum, you'll learn the essentials of English communication. This will follow the B1 level of the Common European Framework of Reference (CEFR). And we've focused on vocabulary that is particularly useful for developers.\",\n-      \"It will help you strengthen your foundational skills while introducing more complex grammar and usage. You'll learn how to describe places and things, share past experiences, and confidently use tenses like Present Perfect and Future. Practical communication strategies are included as well, such as managing conversations, expressing opinions, and building agreement or disagreement in discussions.\",\n-      \"You'll also focus on applying these skills in professional and technical settings. You'll practice vocabulary and phrases essential for developers, such as describing code, participating in stand-up meetings, and discussing tech trends. Advanced topics include conditionals, comparative structures, and conversation management, so you can prepare for real-world interactions in the tech industry.\",\n-      \"This entire B1-level curriculum includes 73 different dialogues. Each is designed to build your vocabulary and boost your confidence when speaking in a professional tech setting.\"\n+      \"En este programa de inglés para desarrolladores, aprenderás los conceptos básicos de la comunicación en inglés. Seguirás el nivel B1 del Marco Común Europeo de Referencia (MCER). Y nos hemos centrado en el vocabulario que resulta especialmente útil para los desarrolladores.\",\n+      \"Te ayudará a fortalecer tus habilidades básicas mientras introduces gramática y usos más complejos. Aprenderás a describir lugares y cosas, compartir experiencias pasadas y usar con confianza tiempos verbales como presente perfecto y futuro. También se incluyen estrategias prácticas de comunicación, como gestionar conversaciones, expresar opiniones y generar acuerdos o desacuerdos en discusiones.\",\n+      \"También te concentrarás en aplicar estas habilidades en entornos profesionales y técnicos. Practicarás vocabulario y frases esenciales para los desarrolladores, como describir códigos, participar en reuniones de pie y analizar tendencias tecnológicas. Los temas avanzados incluyen condicionales, estructuras comparativas y gestión de conversaciones, para que puedas prepararte para interacciones del mundo real en la industria tecnológica.\",\n+      \"Este programa completo de nivel B1 incluye 73 diálogos diferentes. Cada uno está diseñado para ampliar tu vocabulario y aumentar tu confianza al hablar en un entorno tecnológico profesional.\"\n     ],\n     \"blocks\": {\n       \"learn-how-to-describe-places-and-events\": {\n         \"title\": \"Aprende a describir lugares y acontecimientos\",\n         \"intro\": [\n-          \"This course will show you ways of talking about places and events conversationally.\"\n+          \"Este curso le mostrará formas de hablar sobre lugares y eventos de manera conversacional.\"\n         ]\n       },\n       \"learn-how-to-talk-about-past-experiences\": {\n         \"title\": \"Aprende a hablar de experiencias pasadas\",\n         \"intro\": [\n-          \"In this course, you will learn how to share experiences that you had in the past.\"\n+          \"En este curso aprenderás a compartir experiencias que tuviste en el pasado.\"\n         ]\n       },\n       \"learn-how-to-talk-about-past-activities\": {\n         \"title\": \"Aprende a hablar de actividades pasadas\",\n-        \"intro\": [\n-          \"In this course, you will learn how talk about things that you did.\"\n-        ]\n+        \"intro\": [\"En este curso aprenderás a hablar sobre cosas que hiciste.\"]\n       },\n       \"learn-present-perfect-while-talking-about-accessibility\": {\n         \"title\": \"Aprende el presente perfecto hablando de accesibilidad\",\n         \"intro\": [\n-          \"In this course, you will learn to use the Present Perfect structure and learn a bit more about accessibility.\"\n+          \"En este curso aprenderás a utilizar la estructura presente perfecto y aprenderás un poco más sobre accesibilidad.\"\n         ]\n       },\n       \"learn-how-to-plan-future-events\": {\n         \"title\": \"Aprende a planificar eventos futuros\",\n         \"intro\": [\n-          \"In this course, you will learn to use the different forms of the future to plan for upcoming events.\"\n+          \"En este curso aprenderás a utilizar las diferentes formas del futuro para planificar los próximos eventos.\"\n         ]\n       },\n       \"learn-future-continuous-while-describing-actions\": {\n         \"title\": \"Aprende el futuro continuo describiendo acciones\",\n         \"intro\": [\n-          \"In this course, you will learn to use the Future Continuous tense, and how to describe actions to be performed.\"\n+          \"En este curso aprenderás a utilizar el tiempo futuro continuo y cómo describir acciones a realizar.\"\n         ]\n       },\n       \"learn-how-to-use-conditionals\": {\n         \"title\": \"Aprende a utilizar los condicionales\",\n         \"intro\": [\n-          \"In this course, you will learn to use the conditional sentences to describe hypothetical outcomes depending on the fact that certain conditions are met.\"\n+          \"En este curso, aprenderás a usar los condicionales para describir resultados hipotéticos dependiendo si ciertas condiciones se cumplen.\"\n         ]\n       },\n       \"learn-how-to-share-feedback\": {\n         \"title\": \"Aprende a compartir opiniones\",\n         \"intro\": [\n-          \"In this course, you will see ways of telling other people how you feel about their work, highlighting both their strengths and points for improvement.\"\n+          \"En este curso, aprenderás formas de expresar tu opinión sobre el trabajo de otras personas, resaltando tanto sus fortalezas como sus puntos a mejorar.\"\n         ]\n       },\n       \"learn-how-to-share-your-opinion\": {\n         \"title\": \"Aprende a compartir tu opinión\",\n         \"intro\": [\n-          \"This course will show you how to express your ideas and feeling towards topics in a discussion.\"\n+          \"Este curso le mostrará como puede expresar sus ideas y sentimientos hacía temas una discusión.\"\n         ]\n       },\n       \"learn-how-to-express-agreement\": {\n@@ -1708,39 +1706,39 @@\n     }\n   },\n   \"full-stack-developer\": {\n-    \"title\": \"Certified Full Stack Developer Curriculum\",\n+    \"title\": \"Plan de estudio de desarrollador certificado Full Stack\",\n     \"intro\": [\n-      \"This course provides a comprehensive pathway to becoming a Certified Full Stack Developer, covering all the essential technologies required to build modern, scalable web applications from start to finish.\",\n-      \"Through a blend of interactive lessons, coding exercises, and real-world projects, you will master both frontend and backend development. You'll work with HTML, CSS, and JavaScript to build responsive user interfaces, explore React and TypeScript for advanced web applications, and learn to manage data with relational databases - and on the backend, you'll use Git, Npm, Node.js, and Python to create powerful server-side solutions.\",\n-      \"By the end of this course, you'll have the practical skills and experience to confidently develop complete web applications, preparing you for a successful career as a Full Stack Developer.\"\n+      \"Este curso ofrece un camino integral para convertirse en un desarrollador Full Stack certificado, cubriendo todas las tecnologías esenciales necesarias para crear aplicaciones web modernas y escalables de principio a fin.\",\n+      \"A través de una combinación de lecciones interactivas, ejercicios de codificación y proyectos del mundo real, dominarás el desarrollo frontend y backend. Trabajarás con HTML, CSS y JavaScript para crear interfaces de usuario responsivas, explorarás React y TypeScript para aplicaciones web avanzadas y aprenderás a administrar datos con bases de datos relacionales. Y en el backend, usarás Git, Npm, Node.js y Python para crear soluciones potentes del lado del servidor.\",\n+      \"Al finalizar este curso, tendrás las habilidades prácticas y la experiencia para desarrollar con confianza aplicaciones web completas, preparándote para una carrera exitosa como desarrollador Full Stack.\"\n     ],\n     \"chapters\": {\n-      \"freecodecamp\": \"Welcome\",\n+      \"freecodecamp\": \"Bienvenido\",\n       \"html\": \"HTML\",\n       \"css\": \"CSS\",\n       \"javascript\": \"JavaScript\",\n-      \"frontend-libraries\": \"Front End Libraries\",\n-      \"relational-databases\": \"Relational Databases\",\n-      \"backend-javascript\": \"Backend JavaScript\",\n+      \"frontend-libraries\": \"Librerias Front End\",\n+      \"relational-databases\": \"Bases de datos relacionales\",\n+      \"backend-javascript\": \"JavaScript de back-end\",\n       \"python\": \"Python\",\n-      \"exam-certified-full-stack-developer\": \"Certified Full Stack Developer Exam\"\n+      \"exam-certified-full-stack-developer\": \"Examen de desarrollador certificado Full Stack\"\n     },\n     \"modules\": {\n-      \"getting-started-with-freecodecamp\": \"Getting Started with freeCodeCamp\",\n-      \"basic-html\": \"Basic HTML\",\n-      \"semantic-html\": \"Semantic HTML\",\n-      \"html-forms-and-tables\": \"Forms and Tables\",\n-      \"html-and-accessibility\": \"Accessibility\",\n-      \"review-html\": \"HTML Review\",\n-      \"exam-html\": \"HTML Exam\",\n-      \"computer-basics\": \"Computer Basics\",\n-      \"basic-css\": \"Basic CSS\",\n-      \"design-for-developers\": \"Design\",\n-      \"absolute-and-relative-units\": \"Absolute and Relative Units\",\n-      \"pseudo-classes-and-elements\": \"Pseudo Classes and Elements\",\n-      \"css-colors\": \"Colors\",\n-      \"styling-forms\": \"Styling Forms\",\n-      \"css-box-model\": \"The Box Model\",\n+      \"getting-started-with-freecodecamp\": \"Empezar a utilizar freeCodeCamp\",\n+      \"basic-html\": \"HTML básico\",\n+      \"semantic-html\": \"Semántica de HTML\",\n+      \"html-forms-and-tables\": \"Formularios y tablas\",\n+      \"html-and-accessibility\": \"Accesibilidad\",\n+      \"review-html\": \"Revisión de HTML\",\n+      \"exam-html\": \"Examen de HTML\",\n+      \"computer-basics\": \"Conceptos básicos de informática\",\n+      \"basic-css\": \"CSS básico\",\n+      \"design-for-developers\": \"Diseño\",\n+      \"absolute-and-relative-units\": \"Unidades absolutas y relativas\",\n+      \"pseudo-classes-and-elements\": \"Pseudoclases y elementos\",\n+      \"css-colors\": \"Colores\",\n+      \"styling-forms\": \"Formas de estilo\",\n+      \"css-box-model\": \"El modelo de caja\",\n       \"css-flexbox\": \"Flexbox\",\n       \"css-typography\": \"Typography\",\n       \"css-and-accessibility\": \"Accessibility\",\n@@ -2926,7 +2924,7 @@\n       \"workshop-library-manager\": {\n         \"title\": \"Build a Library Manager\",\n         \"intro\": [\n-          \"In this workshop, you will learn higher order array methods by building a library manager\"\n+          \"In this workshop, you will learn higher order array methods by building a library manager.\"\n         ]\n       },\n       \"lab-book-organizer\": {\n@@ -3176,7 +3174,7 @@\n       \"lecture-working-with-maps-and-sets\": {\n         \"title\": \"Working with Maps and Sets\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>\"\n+          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>.\"\n         ]\n       },\n       \"workshop-plant-nursery-catalog\": {"
        },
        {
            "sha": "7d4b54a16e295864a75f90edf077815b85cfa739",
            "filename": "client/i18n/locales/german/intro.json",
            "status": "modified",
            "additions": 2,
            "deletions": 2,
            "changes": 4,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fgerman%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fgerman%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fgerman%2Fintro.json?ref=01e3180ac730e75a584c3625c1e54ad1ab7ca57e",
            "patch": "@@ -2924,7 +2924,7 @@\n       \"workshop-library-manager\": {\n         \"title\": \"Build a Library Manager\",\n         \"intro\": [\n-          \"In this workshop, you will learn higher order array methods by building a library manager\"\n+          \"In this workshop, you will learn higher order array methods by building a library manager.\"\n         ]\n       },\n       \"lab-book-organizer\": {\n@@ -3174,7 +3174,7 @@\n       \"lecture-working-with-maps-and-sets\": {\n         \"title\": \"Working with Maps and Sets\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>\"\n+          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>.\"\n         ]\n       },\n       \"workshop-plant-nursery-catalog\": {"
        },
        {
            "sha": "296123ed69f53f217690f29326979d94f9dfd466",
            "filename": "client/i18n/locales/italian/intro.json",
            "status": "modified",
            "additions": 2,
            "deletions": 2,
            "changes": 4,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fitalian%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fitalian%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fitalian%2Fintro.json?ref=01e3180ac730e75a584c3625c1e54ad1ab7ca57e",
            "patch": "@@ -2924,7 +2924,7 @@\n       \"workshop-library-manager\": {\n         \"title\": \"Build a Library Manager\",\n         \"intro\": [\n-          \"In this workshop, you will learn higher order array methods by building a library manager\"\n+          \"In this workshop, you will learn higher order array methods by building a library manager.\"\n         ]\n       },\n       \"lab-book-organizer\": {\n@@ -3174,7 +3174,7 @@\n       \"lecture-working-with-maps-and-sets\": {\n         \"title\": \"Working with Maps and Sets\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>\"\n+          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>.\"\n         ]\n       },\n       \"workshop-plant-nursery-catalog\": {"
        },
        {
            "sha": "1387b794b02fc766dafb36af436520f0f572f2d1",
            "filename": "client/i18n/locales/japanese/intro.json",
            "status": "modified",
            "additions": 2,
            "deletions": 2,
            "changes": 4,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fjapanese%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fjapanese%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fjapanese%2Fintro.json?ref=01e3180ac730e75a584c3625c1e54ad1ab7ca57e",
            "patch": "@@ -2924,7 +2924,7 @@\n       \"workshop-library-manager\": {\n         \"title\": \"Build a Library Manager\",\n         \"intro\": [\n-          \"In this workshop, you will learn higher order array methods by building a library manager\"\n+          \"In this workshop, you will learn higher order array methods by building a library manager.\"\n         ]\n       },\n       \"lab-book-organizer\": {\n@@ -3174,7 +3174,7 @@\n       \"lecture-working-with-maps-and-sets\": {\n         \"title\": \"Working with Maps and Sets\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>\"\n+          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>.\"\n         ]\n       },\n       \"workshop-plant-nursery-catalog\": {"
        },
        {
            "sha": "21c87a8f1a7dd78d352b8c3a4e68a101852ac975",
            "filename": "client/i18n/locales/korean/intro.json",
            "status": "modified",
            "additions": 2,
            "deletions": 2,
            "changes": 4,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fkorean%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fkorean%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fkorean%2Fintro.json?ref=01e3180ac730e75a584c3625c1e54ad1ab7ca57e",
            "patch": "@@ -2924,7 +2924,7 @@\n       \"workshop-library-manager\": {\n         \"title\": \"Build a Library Manager\",\n         \"intro\": [\n-          \"In this workshop, you will learn higher order array methods by building a library manager\"\n+          \"In this workshop, you will learn higher order array methods by building a library manager.\"\n         ]\n       },\n       \"lab-book-organizer\": {\n@@ -3174,7 +3174,7 @@\n       \"lecture-working-with-maps-and-sets\": {\n         \"title\": \"Working with Maps and Sets\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>\"\n+          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>.\"\n         ]\n       },\n       \"workshop-plant-nursery-catalog\": {"
        },
        {
            "sha": "37e7f05682568faeca5e22ea71a5727484553666",
            "filename": "client/i18n/locales/portuguese/intro.json",
            "status": "modified",
            "additions": 2,
            "deletions": 2,
            "changes": 4,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fportuguese%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fportuguese%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fportuguese%2Fintro.json?ref=01e3180ac730e75a584c3625c1e54ad1ab7ca57e",
            "patch": "@@ -2924,7 +2924,7 @@\n       \"workshop-library-manager\": {\n         \"title\": \"Build a Library Manager\",\n         \"intro\": [\n-          \"In this workshop, you will learn higher order array methods by building a library manager\"\n+          \"In this workshop, you will learn higher order array methods by building a library manager.\"\n         ]\n       },\n       \"lab-book-organizer\": {\n@@ -3174,7 +3174,7 @@\n       \"lecture-working-with-maps-and-sets\": {\n         \"title\": \"Working with Maps and Sets\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>\"\n+          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>.\"\n         ]\n       },\n       \"workshop-plant-nursery-catalog\": {"
        },
        {
            "sha": "d7b6edaedc2fa8deae6ed25e2f5f757e1fbc591c",
            "filename": "client/i18n/locales/swahili/intro.json",
            "status": "modified",
            "additions": 2,
            "deletions": 2,
            "changes": 4,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fswahili%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fswahili%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fswahili%2Fintro.json?ref=01e3180ac730e75a584c3625c1e54ad1ab7ca57e",
            "patch": "@@ -2924,7 +2924,7 @@\n       \"workshop-library-manager\": {\n         \"title\": \"Build a Library Manager\",\n         \"intro\": [\n-          \"In this workshop, you will learn higher order array methods by building a library manager\"\n+          \"In this workshop, you will learn higher order array methods by building a library manager.\"\n         ]\n       },\n       \"lab-book-organizer\": {\n@@ -3174,7 +3174,7 @@\n       \"lecture-working-with-maps-and-sets\": {\n         \"title\": \"Working with Maps and Sets\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>\"\n+          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>.\"\n         ]\n       },\n       \"workshop-plant-nursery-catalog\": {"
        },
        {
            "sha": "e3474c5b060bc17e21414310e53f6eb92f0a9f5f",
            "filename": "client/i18n/locales/ukrainian/intro.json",
            "status": "modified",
            "additions": 6,
            "deletions": 6,
            "changes": 12,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fukrainian%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/01e3180ac730e75a584c3625c1e54ad1ab7ca57e/client%2Fi18n%2Flocales%2Fukrainian%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fukrainian%2Fintro.json?ref=01e3180ac730e75a584c3625c1e54ad1ab7ca57e",
            "patch": "@@ -1606,13 +1606,13 @@\n       \"learn-how-to-share-feedback\": {\n         \"title\": \"Дізнайтесь, як ділитись фідбеком\",\n         \"intro\": [\n-          \"In this course, you will see ways of telling other people how you feel about their work, highlighting both their strengths and points for improvement.\"\n+          \"У цьому курсі ви дізнаєтесь, як ділитись зворотним зв’язком щодо роботи, підкреслюючи сильні сторони і моменти для покращення.\"\n         ]\n       },\n       \"learn-how-to-share-your-opinion\": {\n         \"title\": \"Дізнайтесь, як ділитись своєю думкою\",\n         \"intro\": [\n-          \"This course will show you how to express your ideas and feeling towards topics in a discussion.\"\n+          \"У цьому курсі ви дізнаєтесь, як ділитись своїми ідеями і емоціями під час дискусії.\"\n         ]\n       },\n       \"learn-how-to-express-agreement\": {\n@@ -2597,7 +2597,7 @@\n       \"lab-sentence-maker\": {\n         \"title\": \"Створіть творця речень\",\n         \"intro\": [\n-          \"In this lab, you will continue practicing with strings and concatenation by creating and customizing various stories.\"\n+          \"У цій лабораторній роботі ви продовжите працювати з рядками і конкатенацією, створюючи та налаштовуючи різні історії.\"\n         ]\n       },\n       \"lecture-working-with-data-types\": {\n@@ -2922,7 +2922,7 @@\n       \"workshop-library-manager\": {\n         \"title\": \"Створіть менеджера бібліотеки\",\n         \"intro\": [\n-          \"У цьому практичному занятті ви дізнаєтесь про методи вищого порядку для роботи з масивами, створивши менеджера бібліотеки.\"\n+          \"In this workshop, you will learn higher order array methods by building a library manager.\"\n         ]\n       },\n       \"lab-book-organizer\": {\n@@ -3170,7 +3170,7 @@\n       \"lecture-working-with-maps-and-sets\": {\n         \"title\": \"Робота з map та set\",\n         \"intro\": [\n-          \"У цих відеолекціях ви дізнаєтесь про <code>Map</code> та <code>Set</code> в JavaScript. Ви також дізнаєтесь, як вони відрізняються від <code>WeakSets</code> та <code>WeakMaps</code>.\"\n+          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>.\"\n         ]\n       },\n       \"workshop-plant-nursery-catalog\": {\n@@ -3332,7 +3332,7 @@\n       \"lecture-understanding-asynchronous-programming\": {\n         \"title\": \"Знайомство з асинхронним програмуванням\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about asynchronous programming in JavaScript. You will learn about the differences between synchronous and asynchronous programming, how the <code>async</code> keyword works, the <code>Fetch</code> API, promises, <code>async/await</code>, the <code>Geolocation</code> API, and much more.\"\n+          \"У цих відеолекціях ви дізнаєтесь про асинхронне програмування в JavaScript. Ви дізнаєтесь про відмінності між синхронним і асинхронним програмуванням, як працює ключове слово <code>async</code>, <code>Fetch</code> API, проміси, <code>async/await</code>, <code>Geolocation</code> API та багато іншого.\"\n         ]\n       },\n       \"workshop-fcc-authors-page\": {"
        }
    ],
    "stats": {
        "total": 142,
        "additions": 70,
        "deletions": 72
    }
}