{
    "author": "zairahira",
    "message": "chore(curriculum): add understanding computer, internet and tooling basics transcript (#58222)\n\nCo-authored-by: Dario-DC <105294544+Dario-DC@users.noreply.github.com>",
    "sha": "026ee1dde833d0071516d0052310a9c3e8771935",
    "files": [
        {
            "sha": "f15185c843f490245ee32a26112238c603e1afba",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-understanding-computer-internet-and-tooling-basics/672aa578a2129554d4675049.md",
            "status": "modified",
            "additions": 38,
            "deletions": 0,
            "changes": 38,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/026ee1dde833d0071516d0052310a9c3e8771935/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672aa578a2129554d4675049.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/026ee1dde833d0071516d0052310a9c3e8771935/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672aa578a2129554d4675049.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672aa578a2129554d4675049.md?ref=026ee1dde833d0071516d0052310a9c3e8771935",
            "patch": "@@ -10,6 +10,44 @@ dashedName: what-are-the-basic-parts-of-a-computer\n \n Watch the video lecture and answer the questions below.\n \n+# --transcript--\n+\n+What are the basic parts of a computer?\n+\n+Computers are very powerful machines that perform a variety of tasks like writing documents, playing games, and browsing the internet.\n+\n+As a developer, it is important to understand the basic inner workings of a computer.\n+\n+The first major component of a computer would be the motherboard. The motherboard holds all of the memory, connectors, and hard drives that are needed to run the computer. It serves as the main circuit board for the computer. \n+\n+Inside the computer case of the motherboard, you will find the CPU which stands for Central Processing Unit. The CPU is a processor that is responsible for executing instructions and performing calculations. It is often referred to as the brain of the computer.\n+\n+The CPU is a small square with a chip that goes into the motherboard's CPU socket. A socket is a place where the CPU is inserted. The CPU processor speed is measured in gigahertz (GHz) and mega-hertz (MHz). Gigahertz is a billion cycles per second and mega-hertz is a million cycles per second.\n+\n+The next critical component of a computer would be the system's short term memory. This is known as RAM or Random Access Memory. RAM is a temporary storage location for the computer's CPU. Anytime the computer needs to access data quickly, it will use RAM.\n+\n+The more RAM you have on your computer, the faster it will run and the more programs you can run at the same time. If you are running low on RAM, your computer will run slower and you will notice the difference in performance.\n+\n+It is important to note that RAM is volatile memory. This means that it is lost when the computer is turned off. This is why it is important to save your work on your computer.\n+\n+When you do save your files, they are stored on the hard drive. The hard disk drive, or HDD, is a permanent storage location that is used to store data even when the computer is turned off. This is where all of your files and software are stored.\n+\n+The hard drive is made up of a spinning platter and an arm. The platter is where the data is stored and the arm is used to read and write data to the platter. When you have a faster hard drive, your computer will boot up faster and your programs will run faster.\n+\n+Another type of data storage would be the Solid State Drive, or SSD for short. SSD is non volatile flash memory and can be used in place of a hard drive. SSDs are faster and smaller than hard drives but hard drives are cheaper and have more storage capacity.\n+\n+Another key component of a computer is the power supply unit, or PSU. The PSU is responsible for converting the electricity from the wall outlet into a form that the computer can use. It sends the power from the outlet to the motherboard, CPU, and other components of the computer.\n+\n+Another key component would be the expansion cards. These are cards that are inserted into the motherboard to add additional functionality to the computer. Examples of expansion cards would be the video card, sound card, and network card.\n+\n+The video card, also known as the Graphics Processing Unit or GPU, is responsible for rendering visuals on the computer screen.\n+\n+The sound card is responsible for playing sound on the computer speakers.\n+\n+The network card is responsible for connecting the computer to the internet.\n+\n+Even though there are many more parts to the computer, these are some basic parts that you should familiarize yourself with.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "d70561820e09f0ad8eaf4e55eaa01473af9c1eeb",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-understanding-computer-internet-and-tooling-basics/672ab82c1a9bbd0e3aabc39d.md",
            "status": "modified",
            "additions": 24,
            "deletions": 0,
            "changes": 24,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/026ee1dde833d0071516d0052310a9c3e8771935/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672ab82c1a9bbd0e3aabc39d.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/026ee1dde833d0071516d0052310a9c3e8771935/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672ab82c1a9bbd0e3aabc39d.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672ab82c1a9bbd0e3aabc39d.md?ref=026ee1dde833d0071516d0052310a9c3e8771935",
            "patch": "@@ -10,6 +10,30 @@ dashedName: how-to-effectively-work-with-your-keyboard-mouse-and-other-pointing-\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+How can you effectively work with your keyboard, mouse, and other pointing devices?\n+\n+Many of you have been used to working with your keyboard and mouse for years on end for a variety of activities like gaming, performing tasks for work, or surfing the web.\n+\n+But prolonged misuse of these devices can lead to serious health problems down the road.\n+\n+In this lecture video, we will cover ways to work with your computer’s keyboard and mouse in healthy ways.\n+\n+The first tip is to be mindful of the mouse grip. When working on serious tasks for work or during intense gaming moments, you may tend to grip the mouse too hard. However, this can lead to serious hand and wrist issues. To prevent this, you want to make sure to hold the mouse gently and keep your fingers nice and relaxed.\n+\n+The second tip is to consider using an ergonomic keyboard and mouse. These tools are designed to reduce wrist strain by keeping your hands in a more natural position.\n+\n+While prices for these devices can vary and may be a costly purchase for your current budget, they can be a good investment in your overall long-term health. So, you might consider starting to research an ergonomic keyboard and mouse to use.\n+\n+Another tip is to keep your mouse the same height as your keyboard. You don't want to have to reach up or down to use the mouse, as this can strain your wrist and arm muscles over time.\n+\n+You also want to be mindful of your overall posture when sitting at the computer for hours on end. Being slouched over your computer and putting your wrist in an unnatural position at the keyboard will lead to long-term health issues. So, you want to make sure to sit up straight when working at your computer and maintain a healthy and natural wrist position.\n+\n+The last tip would be to use keyboard shortcuts whenever possible to help minimize typing. There are dozens of shortcuts available for tasks such as navigating the web, navigating around your operating system, working within a code editor, and more. So, it’s best to research some of these keyboard shortcuts and and start incorporating them into your daily computer usage.\n+\n+As you continue using your mouse and keyboard for upcoming coding projects and other activities, remember to keep these health tips in mind.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "d79affa6b0204a627ee202921e5ee9a42abdd4e7",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-understanding-computer-internet-and-tooling-basics/672ab83c4297910eade53c2e.md",
            "status": "modified",
            "additions": 26,
            "deletions": 0,
            "changes": 26,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/026ee1dde833d0071516d0052310a9c3e8771935/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672ab83c4297910eade53c2e.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/026ee1dde833d0071516d0052310a9c3e8771935/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672ab83c4297910eade53c2e.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672ab83c4297910eade53c2e.md?ref=026ee1dde833d0071516d0052310a9c3e8771935",
            "patch": "@@ -10,6 +10,32 @@ dashedName: what-are-the-different-types-of-internet-service-providers\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are the different types of internet service providers?\n+\n+First, what is an internet service provider, or ISP? It’s a company that sells access to the global internet network, essentially. And they come in three different tiers.\n+\n+The first tier are the giant conglomerate companies, which have the infrastructure to handle most (if not all) of their network traffic independently.\n+\n+The second tier are the country-wide providers, which sometimes rent access to tier 1 networks but can stand fairly well on their own.\n+\n+The third tier are the small companies that primarily focus on providing internet to local markets, and rely on larger ISPs to provide their infrastructure.\n+\n+These providers will offer different types of connections as well.\n+\n+Fibre optic connections rely on glass or plastic fibres to transmit data via light, resulting in very high connection speeds and data exchange.\n+\n+Cable connections use the same infrastructure as a cable television provider, which often makes them readily available in many regions.\n+\n+DSL connections use the infrastructure that landline phone services use. Because of the prevalence of this infrastructure, DSL is available in areas where cable might not be. But it is also frequently a slower option.\n+\n+Dial-up also uses the phone lines, but requires exclusive connection (disabling the use of the line for phone purposes when connected to the internet). This is a much older technology that has fallen into disuse.\n+\n+Satellite connections use an array of satellites orbiting the earth to connect various devices across the world. And finally, similar to that, a 5G home internet provider uses the cell tower infrastructure to keep you online.\n+\n+And that should give you a basic rundown of what types of internet service providers and internet connections are out there!\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "085ff16bd63d39af577f073c2572011043af5009",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-understanding-computer-internet-and-tooling-basics/672ab849aa1ef70eefd29364.md",
            "status": "modified",
            "additions": 30,
            "deletions": 0,
            "changes": 30,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/026ee1dde833d0071516d0052310a9c3e8771935/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672ab849aa1ef70eefd29364.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/026ee1dde833d0071516d0052310a9c3e8771935/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672ab849aa1ef70eefd29364.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672ab849aa1ef70eefd29364.md?ref=026ee1dde833d0071516d0052310a9c3e8771935",
            "patch": "@@ -10,6 +10,36 @@ dashedName: what-are-safe-ways-to-sign-into-your-computer\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are safe ways to sign into your computer?\n+\n+Many of you have being using computers for a while. But you might not have thought about the safest or most secure ways to sign into your computer.\n+\n+Whether you are using a Mac or PC, there are many ways to safely sign into your computer.\n+\n+The first thing you should do is to make sure that your computer is password protected.\n+\n+For Windows users, start by opening the Start menu and selecting Settings. From there, go to Accounts and then Sign-in options. You can then set up a password for your computer.\n+\n+*Note: If you encounter any difficulties or are using a different version of Windows, refer to the official Microsoft documentation or support resources for detailed instructions tailored to your specific version.*\n+\n+When creating your password, make sure it is a long and complex password. You can use a combination of letters, numbers and special characters to make it more secure.\n+\n+Choosing an easy password like `12345` or `password` is not a good idea. These are easy to guess and can be easily hacked.\n+\n+Also, do not use passwords based on personal information like your name, birthday, or address. Those are also easy for hackers to guess.\n+\n+When you create your password, it is also a good idea to setup two-factor authentication (2FA). 2FA serves as an extra layer of security and requires a second form of verification to ensure that the person trying to access the account is indeed the authorized user.\n+\n+If you are a Mac user, you can click on the Apple menu and then go to system settings. From there you can go to Users & Groups and set up a password for your computer.\n+\n+Some Mac computers come with a touch ID feature, which is often considered more secure than regular passwords. This feature allows you to sign into your computer using your fingerprint.\n+\n+For Windows users, the Windows Hello feature offers a more secure way to sign in. It uses biometric methods such as facial recognition or fingerprints for authentication, providing an alternative to traditional passwords.\n+\n+After you finish watching these set of lecture videos, I urge you to look into these additional security features and set them up on your computer so that you can keep your computer safe and secure.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "22988e04c5966e1bc3eec66576a337f2a5765403",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-understanding-computer-internet-and-tooling-basics/672ab8573f32480f192aaae1.md",
            "status": "modified",
            "additions": 48,
            "deletions": 0,
            "changes": 48,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/026ee1dde833d0071516d0052310a9c3e8771935/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672ab8573f32480f192aaae1.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/026ee1dde833d0071516d0052310a9c3e8771935/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672ab8573f32480f192aaae1.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672ab8573f32480f192aaae1.md?ref=026ee1dde833d0071516d0052310a9c3e8771935",
            "patch": "@@ -10,6 +10,54 @@ dashedName: what-are-the-different-types-of-tools-professional-developers-use\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are the different types of tools professional developers use?\n+\n+Professional developers rely on a variety of tools to increase productivity and code quality. Let's learn about those tools, including the ones that seem very obvious.\n+\n+The first among the tools is computers. A computer is the primary development environment. It could be a heavy desktop or a portable laptop with either Windows, macOS, or Linux as the operating system.\n+\n+Professional developers often go for computers with fast processing power and plenty of RAM to handle resource-intensive tasks.\n+\n+After the computer is a program for writing and editing code right on that computer. That's a code editor or integrated development environment (IDE).\n+\n+IDEs like Visual Studio, IntelliJ IDEA, JetBrains, and PyCharm provide powerful features like code completion, debugging, and integrated terminal support.\n+\n+Visual Studio Code (VS Code) is essentially a code editor, but it also provides these functionalities with its rich extension library.\n+\n+Other code editors are Sublime Text, Atom, Notepad++, and Brackets.\n+\n+When you write code with code editors and IDEs, you need to track the changes you make to them. The tool that lets you track those changes is a version control system.\n+\n+Git is the most widely used version control system in the development community.\n+\n+Platforms like GitHub, GitLab, and Bitbucket provide cloud-based hosting services for your Git repositories. These platforms enable collaboration with other developers, allow you to work on multiple branches, and facilitate the merging of code changes.\n+\n+Package managers are another critical tool. They help developers simplify the process of adding, updating, and removing libraries and project dependencies.\n+\n+Examples of popular package managers are:\n+\n+* NPM, Yarn, and PNPM for JavaScript\n+* PIP for Python\n+* Composer for PHP\n+* Maven for Java\n+\n+After writing code with different tools, developers test that code to make sure it's working as expected.\n+\n+For this, developers use testing frameworks like Cypress, Playwright, Selenium, and others. There are also language-specific testing frameworks. Examples are:\n+\n+* Jest for JavaScript\n+* pytest for Python\n+* JUnit for Java\n+* PHPUnit for PHP\n+\n+You don't only need to test the code to make sure it's working as expected. You also need to test what the code looks like visually to the end users. Developers use web browsers for this.\n+\n+Modern browsers like Chrome, Firefox, Edge, and Safari offer developer tools for inspecting HTML, CSS, and JavaScript code. There are also tools for debugging and performance profiling.\n+\n+These tools help developers test and optimize their web applications across different browsers for the end users.\n+\n # --questions--\n \n ## --text--"
        }
    ],
    "stats": {
        "total": 166,
        "additions": 166,
        "deletions": 0
    }
}