{
    "author": "Ksound22",
    "message": "chore: update JavaScript and React lectures descriptions (#57614)\n\nCo-authored-by: Zaira <33151350+zairahira@users.noreply.github.com>",
    "sha": "05cf6ea39c7e341c57683bbbafbba73118b590c9",
    "files": [
        {
            "sha": "4ed4cd6437ff3a7e55d951f4d92c6587996522c5",
            "filename": "client/i18n/locales/english/intro.json",
            "status": "modified",
            "additions": 33,
            "deletions": 33,
            "changes": 66,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/05cf6ea39c7e341c57683bbbafbba73118b590c9/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/05cf6ea39c7e341c57683bbbafbba73118b590c9/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json?ref=05cf6ea39c7e341c57683bbbafbba73118b590c9",
            "patch": "@@ -2585,15 +2585,15 @@\n       },\n       \"wvjx\": { \"title\": \"127\", \"intro\": [] },\n       \"lecture-working-with-code-editors-and-ides\": {\n-        \"title\": \"Working with Code Editors and IDE's\",\n+        \"title\": \"Working with Code Editors and IDEs\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with code editors and IDE's.\"\n+          \"In these lecture videos, you will learn how to work with code editors and IDEs. You will learn various concepts about the most popular code editor, VS Code such as its installation, how to create a project in it, keyboard shortcuts, and extensions.\"\n         ]\n       },\n       \"lecture-introduction-to-javascript\": {\n         \"title\": \"Introduction to JavaScript\",\n         \"intro\": [\n-          \"In these lecture videos, you will get a basic introduction to JavaScript.\"\n+          \"In these lecture videos, you will learn the fundamentals of JavaScript. Topics covered include, but are not limited to, variables, data types, how JavaScript interacts with HTML and CSS, strings, and much more.\"\n         ]\n       },\n       \"workshop-greeting-bot\": {\n@@ -2613,7 +2613,7 @@\n       \"lecture-working-with-data-types\": {\n         \"title\": \"Working with Data Types\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about data types in JavaScript.\"\n+          \"In the following lecture videos, you will learn how to work with data types in JavaScript. You will also learn how dynamic typing differs from static typing, the <code>typeof</code> operator, and the <code>typeof null</code> bug.\"\n         ]\n       },\n       \"review-javascript-variables-and-data-types\": {\n@@ -2632,7 +2632,7 @@\n       \"lecture-working-with-strings-in-javascript\": {\n         \"title\": \"Working with Strings in JavaScript\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with strings in JavaScript.\"\n+          \"In these lecture videos, you will learn how to work with strings in JavaScript. You will learn how to access characters from a string, how to use template literals and interpolation, how to create a new line in strings, and much more.\"\n         ]\n       },\n       \"workshop-teacher-chatbot\": {\n@@ -2645,7 +2645,7 @@\n       \"lecture-working-with-common-string-methods\": {\n         \"title\": \"Working with Common String Methods\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about common String methods.\"\n+          \"In these lecture videos, you will learn about the common string methods available in JavaScript. The string methods will let you do things like extracting a part of a string, changing the casing for a string, replacing a part of a string, trimming whitespace from a string, and much more.\"\n         ]\n       },\n       \"review-javascript-strings\": {\n@@ -2664,7 +2664,7 @@\n       \"lecture-working-with-numbers-booleans-and-the-math-object\": {\n         \"title\": \"Working with Numbers, Booleans, and the Math Object\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about numbers, booleans, and the <code>Math</code> object.\"\n+          \"In these lecture videos, you will dive into the fundamentals of JavaScript. These include numbers, booleans, and the <code>Math</code> object. You will learn about different types of numbers, how arithmetic and comparison operators work, how JavaScript behaves when you combine strings and numbers in calculations, and much more.\"\n         ]\n       },\n       \"workshop-mathbot\": {\n@@ -2683,7 +2683,7 @@\n       \"lecture-working-with-numbers-and-common-number-methods\": {\n         \"title\": \"Working with Numbers and Common Number Methods\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about numbers and common Number methods.\"\n+          \"In these lecture videos, you will learn about numbers and common number methods. These include <code>isNaN()</code>, <code>parseInt()</code>, <code>parseFloat()</code>, and <code>toFixed()</code>.\"\n         ]\n       },\n       \"review-javascript-math\": {\n@@ -2700,7 +2700,7 @@\n       \"lecture-understanding-comparisons-and-conditionals\": {\n         \"title\": \"Understanding Comparisons and Conditionals\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about comparisons and conditionals.\"\n+          \"In these lecture videos, you will learn about comparison operators and conditionals. You will learn how the various conditionals differ from one another, and how comparisons work with <code>null</code> and <code>undefined</code>.\"\n         ]\n       },\n       \"review-javascript-comparisons-and-conditionals\": {\n@@ -2719,7 +2719,7 @@\n       \"lecture-working-with-functions\": {\n         \"title\": \"Working with Functions\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with functions.\"\n+          \"In these lecture videos, you will learn how to reuse a block of code with functions. You will learn what the purpose of a function is and how they work, and how scope works in programming. \"\n         ]\n       },\n       \"workshop-calculator\": {\n@@ -2770,7 +2770,7 @@\n       \"lecture-working-with-arrays\": {\n         \"title\": \"Working with Arrays\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with JavaScript arrays.\"\n+          \"In these lecture videos, you will learn how to work with JavaScript arrays. You will learn about what makes an array, one-dimensional and two-dimensional arrays, how to access and update the elements in an array, and much more.\"\n         ]\n       },\n       \"workshop-shopping-list\": {\n@@ -2789,7 +2789,7 @@\n       \"lecture-working-with-common-array-methods\": {\n         \"title\": \"Working with Common Array Methods\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about common array methods.\"\n+          \"In these lecture videos, you will learn about the array methods for performing more advanced operations like getting the position of an item in an array, checking if an array contains a certain element, copying an array, and lots more.\"\n         ]\n       },\n       \"review-javascript-arrays\": {\n@@ -2806,7 +2806,7 @@\n       \"lecture-working-with-objects\": {\n         \"title\": \"Working with Objects\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with objects in JavaScript.\"\n+          \"In these lecture videos, you will learn how to work with JavaScript objects. The concepts you will learn include how to access properties from an object, check if an object has a property, how object methods differ from functions, object destructuring, and much more.\"\n         ]\n       },\n       \"workshop-recipe-tracker\": {\n@@ -2838,7 +2838,7 @@\n       \"lecture-working-with-loops\": {\n         \"title\": \"Working with Loops\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with loops in JavaScript.\"\n+          \"Loops are an essential part of JavaScript. That's why the following lecture videos have been prepared for you to learn about the different types of loops and how they work, and also how iteration works.\"\n         ]\n       },\n       \"workshop-sentence-analyzer\": {\n@@ -2868,7 +2868,7 @@\n       \"lecture-understanding-core-javascript-fundamentals\": {\n         \"title\": \"Understanding Core JavaScript Fundamentals\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn more about core JavaScript fundamentals.\"\n+          \"In these lecture videos, you will learn more about the core JavaScript fundamentals. You will learn how a string object differs from a primitive string, the <code>toString()</code> method, conventions and common practices for naming variables, linters and formatters, closures, and much more.\"\n         ]\n       },\n       \"lab-pyramid-generator\": {\n@@ -2888,7 +2888,7 @@\n       \"lecture-the-var-keyword-and-hoisting\": {\n         \"title\": \"The var Keyword and Hoisting\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about the var keyword and hoisting in JavaScript.\"\n+          \"In these lecture videos, you will learn about the <code>var</code> keyword and why it is not recommended for use anymore. You will also learn about hoisting in JavaScript so you can avoid subtle bugs in your code.\"\n         ]\n       },\n       \"lab-inventory-management-program\": {\n@@ -2901,7 +2901,7 @@\n       \"lecture-understanding-modules-imports-and-exports\": {\n         \"title\": \"Understanding Modules, Imports, and Exports\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about modules, imports, and exports in JavaScript.\"\n+          \"In this lecture video, you will learn about modules, imports, and exports in JavaScript.\"\n         ]\n       },\n       \"lab-password-generator\": {\n@@ -2926,7 +2926,7 @@\n       \"lecture-working-with-higher-order-functions-and-callbacks\": {\n         \"title\": \"Working with Higher Order Functions and Callbacks\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with higher order functions and callbacks.\"\n+          \"In these lecture videos, you will learn how to work with higher order functions and callbacks. The higher order functions you will learn include <code>map()</code>, <code>filter()</code>, <code>reduce()</code>, <code>sort()</code>, <code>every()</code>, and <code>some()</code>. You will also learn how to chain these methods together to achieve your desired results.\"\n         ]\n       },\n       \"workshop-library-manager\": {\n@@ -2957,7 +2957,7 @@\n       \"lecture-working-with-the-dom-click-events-and-web-apis\": {\n         \"title\": \"Working with the DOM, Click Events, and Web APIs\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn how to work with the DOM, click events, and web APIs, using JavaScript.\"\n+          \"In these lecture videos, you will learn how to work with the Document Object Model (DOM), the `addEventListener()` method and events, and web APIs.\"\n         ]\n       },\n       \"workshop-storytelling-app\": {\n@@ -2988,7 +2988,7 @@\n       \"lecture-understanding-the-event-object-and-event-delegation\": {\n         \"title\": \"Understanding the Event Object and Event Delegation\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about the event object and event delegation.\"\n+          \"In these lecture videos, you will learn about the event object, the change event, event bubbling, and event delegation.\"\n         ]\n       },\n       \"workshop-music-instrument-filter\": {\n@@ -3043,7 +3043,7 @@\n       \"lecture-debugging-techniques\": {\n         \"title\": \"Debugging Techniques\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn debugging techniques.\"\n+          \"In these lecture videos, you will learn about the common errors in JavaScript and the techniques you can use to fix them – a process called debugging.\"\n         ]\n       },\n       \"lab-random-background-color-changer\": {\n@@ -3068,7 +3068,7 @@\n       \"lecture-working-with-regular-expressions\": {\n         \"title\": \"Working with Regular Expressions\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about regular expressions in JavaScript.\"\n+          \"In these lecture videos, you will learn about regular expressions in JavaScript. You will learn about the methods for working with regular expressions, modifiers, character classes, lookaheads, lookbehinds, back-references, quantifiers, and more.\"\n         ]\n       },\n       \"workshop-spam-filter\": {\n@@ -3105,7 +3105,7 @@\n       \"lecture-understanding-form-validation\": {\n         \"title\": \"Understanding Form Validation\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about form validation in JavaScript.\"\n+          \"In these lecture videos, you will learn about form validation in JavaScript. You will learn about the various ways to validate forms, how the <code>preventDefault()</code> method works, and how the submit event works.\"\n         ]\n       },\n       \"workshop-calorie-counter\": {\n@@ -3138,7 +3138,7 @@\n       \"lecture-working-with-dates\": {\n         \"title\": \"Working with Dates\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with JavaScript dates.\"\n+          \"In these lecture videos, you will learn about the JavaScript date object. You will learn about the methods for working with dates and how to format dates.\"\n         ]\n       },\n       \"lab-date-conversion\": {\n@@ -3161,7 +3161,7 @@\n       \"lecture-working-with-audio-and-video\": {\n         \"title\": \"Working with Audio and Video\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with audio and video using JavaScript.\"\n+          \"In these lecture videos, you will learn how to work with audio and video files using JavaScript. You will learn about the <code>Audio</code> and <code>Video</code> constructors, their methods and properties, audio and video formats, codecs, the <code>HTMLMediaElement</code> API, and much more.\"\n         ]\n       },\n       \"workshop-music-player\": {\n@@ -3193,7 +3193,7 @@\n       \"lecture-working-with-maps-and-sets\": {\n         \"title\": \"Working with Maps and Sets\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about JavaScript Maps and Sets.\"\n+          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>\"\n         ]\n       },\n       \"workshop-plant-nursery-catalog\": {\n@@ -3225,7 +3225,7 @@\n       \"lecture-working-with-client-side-storage-and-crud-operations\": {\n         \"title\": \"Working with Client-Side Storage and CRUD Operations\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about client-side storage and CRUD operations with JavaScript.\"\n+          \"In these lecture videos, you will learn about client-side storage and CRUD operations in JavaScript. You will learn about <code>localStorage</code> and <code>sessionStorage</code> alongside their methods and properties, cookies, the Cache API, IndexDB, and much more.\"\n         ]\n       },\n       \"workshop-todo-app\": {\n@@ -3258,7 +3258,7 @@\n       \"lecture-understanding-how-to-work-with-classes-in-javascript\": {\n         \"title\": \"Understanding How to Work with Classes in JavaScript\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with classes in JavaScript.\"\n+          \"In these lecture videos, you will learn about classes in JavaScript. You will learn about inheritance, the <code>this</code> keyword, static properties and methods, and more.\"\n         ]\n       },\n       \"workshop-shopping-cart\": {\n@@ -3297,7 +3297,7 @@\n       \"lecture-understanding-recursion-and-the-call-stack\": {\n         \"title\": \"Understanding Recursion and the Call Stack\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about recursion and the call stack.\"\n+          \"In this lecture video, you will learn about recursion and the call stack.\"\n         ]\n       },\n       \"workshop-decimal-to-binary-converter\": {\n@@ -3327,7 +3327,7 @@\n       \"lecture-understanding-functional-programming\": {\n         \"title\": \"Understanding Functional Programming\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about functional programming.\"\n+          \"In these lecture videos, you will learn about functional programming and how to nest functions using a technique called currying.\"\n         ]\n       },\n       \"workshop-recipe-ingredient-converter\": {\n@@ -3359,7 +3359,7 @@\n       \"lecture-understanding-asynchronous-programming\": {\n         \"title\": \"Understanding Asynchronous Programming\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about asynchronous programming.\"\n+          \"In these lecture videos, you will learn about asynchronous programming in JavaScript. You will learn about the differences between synchronous and asynchronous programming, how the <code>asnyc</code> keyword works, the <code>Fetch</code> API, promises, async/await, the <code>Geolocation</code> API, and much more.\"\n         ]\n       },\n       \"workshop-fcc-authors-page\": {\n@@ -3398,7 +3398,7 @@\n       \"lecture-introduction-to-javascript-libraries-and-frameworks\": {\n         \"title\": \"Introduction to JavaScript Libraries and Frameworks\",\n         \"intro\": [\n-          \"In these lecture videos, you will get an introduction to JavaScript libraries and frameworks.\"\n+          \"In these lecture videos, you will get an introduction to JavaScript libraries and frameworks. You will learn about the roles of JavaScript libraries and frameworks, single page applications (SPAs) and the issue surrounding them, and React, the most popular frontend JavaScript library.\"\n         ]\n       },\n       \"workshop-reusable-mega-navbar\": {\n@@ -3415,7 +3415,7 @@\n       \"lecture-working-with-data-in-react\": {\n         \"title\": \"Working with Data in React\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with data in React.\"\n+          \"In these lecture videos, you will learn how to work with data in React. You will learn about <code>props</code> and how to pass them around, conditional rendering, how to render lists, and how to use inline styles.\"\n         ]\n       },\n       \"workshop-reusable-profile-card-component\": {"
        }
    ],
    "stats": {
        "total": 66,
        "additions": 33,
        "deletions": 33
    }
}