{
    "author": "DanielRosa74",
    "message": "feat(curriculum): add B1 intro to intro.json (#57521)",
    "sha": "075b84a041c2189a6ced9900827339c9237a83b3",
    "files": [
        {
            "sha": "e512466588d783353e9fdb27e571900012d15633",
            "filename": "client/i18n/locales/english/intro.json",
            "status": "modified",
            "additions": 6,
            "deletions": 1,
            "changes": 7,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/075b84a041c2189a6ced9900827339c9237a83b3/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/075b84a041c2189a6ced9900827339c9237a83b3/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json?ref=075b84a041c2189a6ced9900827339c9237a83b3",
            "patch": "@@ -1568,7 +1568,12 @@\n   },\n   \"b1-english-for-developers\": {\n     \"title\": \"B1 English for Developers (Beta)\",\n-    \"intro\": [\"Placeholder intro\"],\n+    \"intro\": [\n+      \"In this English for Developers Curriculum, you'll learn the essentials of English communication. This will follow the B1 level of the Common European Framework of Reference (CEFR). And we've focused on vocabulary that is particularly useful for developers.\",\n+      \"It will help you strengthen your foundational skills while introducing more complex grammar and usage. You'll learn how to describe places and things, share past experiences, and confidently use tenses like Present Perfect and Future. Practical communication strategies are included as well, such as managing conversations, expressing opinions, and building agreement or disagreement in discussions.\",\n+      \"You'll also focus on applying these skills in professional and technical settings. You'll practice vocabulary and phrases essential for developers, such as describing code, participating in stand-up meetings, and discussing tech trends. Advanced topics include conditionals, comparative structures, and conversation management, so you can prepare for real-world interactions in the tech industry.\",\n+      \"This entire B1-level curriculum includes 73 different dialogues. Each is designed to build your vocabulary and boost your confidence when speaking in a professional tech setting.\"\n+    ],\n     \"blocks\": {\n       \"learn-how-to-describe-places-and-events\": {\n         \"title\": \"Learn How to Describe Places and Events\","
        }
    ],
    "stats": {
        "total": 7,
        "additions": 6,
        "deletions": 1
    }
}