{
    "author": "jdwilkin4",
    "message": "feat(curriculum): adding content to computer basic review page (#57024)",
    "sha": "08464641c7d28d58eaaa4db6bbc85d11e3d39b14",
    "files": [
        {
            "sha": "f206009b1d4a4f6ad637aee10d9933801b9e0af6",
            "filename": "client/i18n/locales/english/intro.json",
            "status": "modified",
            "additions": 2,
            "deletions": 1,
            "changes": 3,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/08464641c7d28d58eaaa4db6bbc85d11e3d39b14/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/08464641c7d28d58eaaa4db6bbc85d11e3d39b14/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json?ref=08464641c7d28d58eaaa4db6bbc85d11e3d39b14",
            "patch": "@@ -1862,7 +1862,8 @@\n       \"review-computer-basics\": {\n         \"title\": \"Computer Basics Review\",\n         \"intro\": [\n-          \"Review the Computer Basics concepts to prepare for the upcoming quiz.\"\n+          \"Before you are quizzed on basic computer and internet concepts, you first need to review.\",\n+          \"Open up this page to review concepts like RAM, Internet service providers, common web browsers, search engines and more.\"\n         ]\n       },\n       \"quiz-computer-basics\": {"
        },
        {
            "sha": "65953e0a160f80def528aef56b09f7991d97773a",
            "filename": "curriculum/challenges/english/25-front-end-development/review-computer-basics/671a87e6dcef5b5bd765e5ed.md",
            "status": "modified",
            "additions": 37,
            "deletions": 0,
            "changes": 37,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/08464641c7d28d58eaaa4db6bbc85d11e3d39b14/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-computer-basics%2F671a87e6dcef5b5bd765e5ed.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/08464641c7d28d58eaaa4db6bbc85d11e3d39b14/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-computer-basics%2F671a87e6dcef5b5bd765e5ed.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-computer-basics%2F671a87e6dcef5b5bd765e5ed.md?ref=08464641c7d28d58eaaa4db6bbc85d11e3d39b14",
            "patch": "@@ -9,7 +9,44 @@ dashedName: review-computer-basics\n \n Review the concepts below to prepare for the upcoming quiz.\n \n+## Understanding Computer, Internet and Developer Tooling Basics\n \n+- **Motherboard**: holds all of the memory, connectors, and hard drives that are needed to run the computer. It serves as the main circuit board for the computer.\n+- **Central Processing Unit(CPU)**: a processor that is responsible for executing instructions and performing calculations. \n+- **Random Access Memory(RAM)**: a temporary storage location for the computer's CPU.\n+- **Hard Disk Drive(HDD)**: a permanent storage location that is used to store data even when the computer is turned off.\n+- **Solid State Drive(SSD)**: non volatile flash memory and can be used in place of a hard drive.\n+- **Power Supply Unit(PSU)**: responsible for converting the electricity from the wall outlet into a form that the computer can use.\n+- **Graphics Processing Unit(GPU)**: responsible for rendering visuals on the computer screen.\n+- **Different Types of Internet Service Providers**: An Internet Service Provider (ISP) is a company that provides access to the internet. There are different types of ISPs, including dial-up, DSL, cable, fiber-optic, and satellite.\n+- **Safe Ways to Sign Into Your Computer**: Examples of safe ways to sign into your computer include using a strong password, enabling two-factor authentication, and using a password manager.\n+- **Integrated Development Environment (IDE)**: a tool that helps developer write, test and debug code in an efficient manner. \n+- **Code Editor**: a tool that developers use to write and debug code. \n+- **Git**: a popular version control system that allows developers to track changes in their code and collaborate with others.\n+- **Cloud-based Hosting Services for repositories**: A repository is a storage location for project files and version history. Popular cloud-based hosting services for repositories include GitHub, GitLab, and Bitbucket.\n+- **Package Managers**: tools that help developers simplify the process of adding, updating, and removing libraries and project dependencies. Examples include npm, pip, and Maven.\n+- **Testing Libraries and Frameworks**: Testing is done in software to ensure that the code works as expected. Examples of testing libraries and frameworks include Jest, PHPUnit, and JUnit.\n+\n+## Working With Files, File Systems and Media Formats\n+\n+- **Best practices for naming files**: You will want to name your files in a way that is easy to understand and maintain. For example, `about-us.html` is a more descriptive name than `page1.html`.\n+- **root directory**: top-level directory in a file system. Directory is another name for a folder.\n+- **Markdown**: a markup language commonly used for documentation and `README` files. A `README` file is a file that contains information about a project, such as how to install and use it.\n+- **`index.html`**: represents the default page that is displayed when a user visits a website.\n+- **Create, Move, and Delete files and folders using Explorer/Finder**: Explorer is the file manager in Windows, and Finder is the file manager in macOS. You can use these tools to create, move, and delete files and folders.\n+- **Searching for files and folders**: You can use the search functionality in Explorer or Finder to find files and folders on your computer.\n+- **HTML, CSS and JS File Types**: `.html` file extension is used for HTML files, `.css` for CSS files, and `.js` for JavaScript files.\n+- **Common Image and Graphic Formats**: `JPEG` and `PNG` are common image file formats. `GIF` is another common image file format that supports animation. `SVG` is a file format for vector graphics.\n+- **Common Audio and Video Formats**: The `MP3` format is commonly used for audio files. The `MP4` format is commonly used for video files. The `MOV` format was developed by Apple and is commonly used for video files.\n+- **Common Font Formats**: The `TTF` format is commonly used for TrueType fonts. The `WOFF` format is commonly used for web fonts. The successor to WOFF is `WOFF2`, which provides better compression.\n+- **ZIP**: a file format that is used to compress files and folders. \n+\n+## Browsing the Web Effectively\n+\n+- **What is a Web browser?**: a software application that allows users to access and view websites on the internet.\n+- **What is a Search Engine**: a tool that allows users to search for information on the internet. Examples include Google, Bing, and Yahoo.\n+- **Common web browsers**: A few examples of common web browsers include Google Chrome, Mozilla Firefox, and Microsoft Edge.\n+- **Common Search Strategies**: You can use `site:` followed by the URL of a website to search for content on that website. You can use `filetype:` followed by a file extension to search for files of that type. You can prefix a search term with a minus sign to exclude results containing that term. You can prefix a search term with a plus sign to include results containing that term.\n \n # --assignment--\n "
        }
    ],
    "stats": {
        "total": 40,
        "additions": 39,
        "deletions": 1
    }
}