{
    "author": "Giftea",
    "message": "feat(curriculum): Add interactive examples to form validation lesson (#62711)\n\nCo-authored-by: Huyen Nguyen <25715018+huyenltnguyen@users.noreply.github.com>",
    "sha": "16b9528fd7d7d9d342c79aa6cb2f4a524ebec4d9",
    "files": [
        {
            "sha": "6edfa837ffe302dcf05a1596ae9d62b7348f8ac6",
            "filename": "curriculum/challenges/english/blocks/lecture-working-with-forms/672a4ce6dab9eb735828b48b.md",
            "status": "modified",
            "additions": 33,
            "deletions": 5,
            "changes": 38,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/16b9528fd7d7d9d342c79aa6cb2f4a524ebec4d9/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-forms%2F672a4ce6dab9eb735828b48b.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/16b9528fd7d7d9d342c79aa6cb2f4a524ebec4d9/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-forms%2F672a4ce6dab9eb735828b48b.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-forms%2F672a4ce6dab9eb735828b48b.md?ref=16b9528fd7d7d9d342c79aa6cb2f4a524ebec4d9",
            "patch": "@@ -5,7 +5,7 @@ challengeType: 19\n dashedName: what-is-client-side-form-validation-in-html-forms\n ---\n \n-# --description--\n+# --interactive--\n \n When a user fills out a form on your website, it is important that they fill out all of the necessary information in the correct format. HTML form controls, like inputs, have a lot of built-in validation that you can use to check for invalid data. This will help ensure that the user fixes these mistakes before the information is submitted and processed by the server.\n \n@@ -15,7 +15,29 @@ The term \"server-side\" refers to everything that happens on the server, the comp\n \n While client-side validation is important, you also need server-side validation for added security. Malicious users can bypass client-side checks, so robust server-side measures are essential. You'll learn more about this in a later module. For now, let's take a look at some examples of client-side form validation.\n \n-One common example of built-in form validation is to use the `required` attribute in inputs. The `required` attribute specifies that the user needs to fill out that portion of the form before it gets submitted. Here is an example of using the `required` attribute in an email input:\n+One common example of built-in form validation is to use the `required` attribute in inputs. The `required` attribute specifies that the user needs to fill out that portion of the form before it gets submitted. Here is an example of using the `required` attribute in an email input.\n+\n+Click on the `Submit Form` button without providing an email address and you will see a message pop up telling you to fill out the field.\n+\n+:::interactive_editor\n+\n+```html\n+<form action=\"\">\n+  <label for=\"email\">Email Address (Required field):</label>\n+  <input required type=\"email\" name=\"email\" id=\"email\" />\n+  <button type=\"submit\">Submit Form</button>\n+</form>\n+```\n+\n+:::\n+\n+Each browser will have its own set of styles for showing this alert message.\n+\n+Another advantage of using the email input is that email inputs have some basic validation to ensure correctly formatted email addresses. For example, if you type in random words and click submit, then the browser will show an alert that an `@` sign is missing. \n+\n+Type `abc` into the email field and click on the submit button. You should see a message pop up because it is not a valid email address.\n+\n+:::interactive_editor\n \n ```html\n <form action=\"\">\n@@ -25,11 +47,15 @@ One common example of built-in form validation is to use the `required` attribut\n </form>\n ```\n \n-When the user clicks on the `Submit Form` button without supplying an email address, they will be alerted that the field is required and the form will not be submitted. Each browser will have its own set of styles for showing this alert message.\n+:::\n+\n+It is important to note that browsers only check for basic validation for standard email addresses. It is up to you to add additional layers of validation, which you will learn about in later modules.\n \n-Another advantage of using the email input, is that email inputs have some basic validation to ensure correctly formatted email addresses. For example, if you type in random words and click submit, then the browser will show an alert that an `@` sign is missing. It is important to note that browsers only check for basic validation for standard email addresses. It is up to you to add additional layers of validation, which you will learn about in later modules.\n+Other forms of validation for email inputs are to use the `minlength` and `maxlength` attributes. Here is an example using the extra validation.\n \n-Other forms of validation for email inputs are to use the `minlength` and `maxlength` attributes. Here is an example using the extra validation:\n+Type `b@m` in the field and click on the submit button. You will see a message pop up because it doesn't meet the minimum required length.\n+\n+:::interactive_editor\n \n ```html\n <form action=\"\">\n@@ -46,6 +72,8 @@ Other forms of validation for email inputs are to use the `minlength` and `maxle\n </form>\n ```\n \n+:::\n+\n The `minlength` and `maxlength` attributes are used to set the minimum and maximum length in characters for the email input. If you don't include the minimum length or exceed the max length of characters, the browser will show an alert message.\n \n # --questions--"
        }
    ],
    "stats": {
        "total": 38,
        "additions": 33,
        "deletions": 5
    }
}