{
    "author": "ojeytonwilliams",
    "message": "fix(curriculum): update design quiz and review (#58398)",
    "sha": "1d6a0554a0b2dc8ea2dd9e5bec7addf71d2e2b3d",
    "files": [
        {
            "sha": "b8a47fb0a10bbaf668a5f517fd4fe0427b05289f",
            "filename": "curriculum/challenges/english/25-front-end-development/quiz-design-fundamentals/66ed901ff45ce3ece4053eba.md",
            "status": "modified",
            "additions": 38,
            "deletions": 38,
            "changes": 76,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/1d6a0554a0b2dc8ea2dd9e5bec7addf71d2e2b3d/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Fquiz-design-fundamentals%2F66ed901ff45ce3ece4053eba.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/1d6a0554a0b2dc8ea2dd9e5bec7addf71d2e2b3d/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Fquiz-design-fundamentals%2F66ed901ff45ce3ece4053eba.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Fquiz-design-fundamentals%2F66ed901ff45ce3ece4053eba.md?ref=1d6a0554a0b2dc8ea2dd9e5bec7addf71d2e2b3d",
            "patch": "@@ -39,7 +39,7 @@ Creates visual hierarchy, improves readability, focuses the viewer's attention o\n \n #### --text--\n \n-What is the design principle of carefully choosing the size of elements in relation to each other and the layout?\n+What is the design principle of carefully choosing the size of elements in relation to each other?\n \n #### --distractors--\n \n@@ -65,25 +65,25 @@ Which of the following sites would most likely benefit from using breadcrumbs?\n \n #### --distractors--\n \n-A single-page portfolio site.\n+A single-page portfolio site\n \n ---\n \n-An infinite scroll gallery site.\n+An infinite scroll gallery site\n \n ---\n \n-A simple blog with only a few posts.\n+A simple blog with only a few posts\n \n #### --answer--\n \n-A complex e-commerce site with multiple categories and subcategories.\n+A complex e-commerce site with multiple categories and subcategories\n \n ### --question--\n \n #### --text--\n \n-What design pattern allows users to access and interact with specific elements and content on a website without or while deferring registration?\n+Which design pattern allows users to access and interact with elements and content on a website without requiring immediate registration?\n \n #### --distractors--\n \n@@ -105,19 +105,19 @@ Deferred/lazy registration\n \n #### --text--\n \n-What are the three main types of text alignment?\n+What are three types of text alignment?\n \n #### --distractors--\n \n-Vertical, center, horizontal\n+Top, center, horizontal\n \n ---\n \n-Left, right, justified\n+Left, right, middle\n \n ---\n \n-Vertical, horizontal, justified\n+Vertical, horizontal, equal\n \n #### --answer--\n \n@@ -171,7 +171,7 @@ Elements that are strikingly different from each other visually\n \n #### --text--\n \n-In the examples below, which one is an example of visual hierarchy in design?\n+Which of the following is an example of visual hierarchy in design?\n \n #### --distractors--\n \n@@ -197,19 +197,19 @@ What is a common goal of conducting exit interviews in user research?\n \n #### --distractors--\n \n-To increase the number of new users.\n+To increase the number of new users\n \n ---\n \n To test new features with existing users\n \n ---\n \n-To gather data for A/B testing.\n+To gather data for A/B testing\n \n #### --answer--\n \n-To understand the factors causing user churn.\n+To understand the factors causing user churn\n \n ### --question--\n \n@@ -285,19 +285,19 @@ How can user research impact user requirements?\n \n #### --distractors--\n \n-It has no impact on user requirements.\n+It has no impact on user requirements\n \n ---\n \n-It only affects non-functional requirements.\n+It only affects non-functional requirements\n \n ---\n \n-It only affects functional requirements.\n+It only affects functional requirements\n \n #### --answer--\n \n-It can help define and refine user requirements based on user feedback.\n+It can help define and refine user requirements based on user feedback\n \n ### --question--\n \n@@ -307,63 +307,63 @@ Why is it important for a design brief to be reviewed and approved by all stakeh\n \n #### --distractors--\n \n-To ensure everyone is aware of the project's social media strategy.\n+To ensure everyone is aware of the project's social media strategy\n \n ---\n \n-To finalize the color palette and design elements.\n+To finalize the color palette and design elements\n \n ---\n \n-To determine the project's marketing budget.\n+To determine the project's marketing budget\n \n #### --answer--\n \n-To confirm that all stakeholders agree on the project's objectives and requirements.\n+To confirm that all stakeholders agree on the project's objectives and requirements\n \n ### --question--\n \n #### --text--\n \n-What is one bad practice method for implementing infinite scroll?\n+What is considered bad practice when implementing infinite scroll?\n \n #### --distractors--\n \n-Allow users to jump to a page or section through the navbar or a pagination drop down menu\n+Allowing users to jump to a page or section through the navbar or a pagination drop down menu\n \n ---\n \n-Add a load more indicator or symbol after a certain point in the page along with the infinite scroll\n+Adding a load more indicator or symbol after a certain point in the page along with the infinite scroll\n \n ---\n \n-Integrate a footer reveal at the bottom\n+Integrating a footer reveal at the bottom\n \n #### --answer--\n \n-No back to top button, alternative methods of navigating the page, and very long inefficient scrolling\n+Not adding alternative methods of navigating the page\n \n ### --question--\n \n #### --text--\n \n-What is one bad practice for working with images?\n+Which of the following is a best practice when designing progress indicators for forms?\n \n #### --distractors--\n \n-Make important images stand out by being larger in size\n+Requiring users to restart the form if they navigate away from the page\n \n ---\n \n-Separate text and images into columns or rows\n+Keeping the progress indicator small and discreet\n \n ---\n \n-Put images outside the layout and important ones on their own or full screen\n+Making sure the progress is just displayed visually without any text\n \n #### --answer--\n \n-Images placed in the middle of text paragraphs with very little margin space for separation\n+Breaking the progress indicator into labeled sections\n \n ### --question--\n \n@@ -381,7 +381,7 @@ Do not allow users to add or remove items from the cart\n \n ---\n \n-Include a checkout summary on another page\n+Automatically add products to the cart without user interaction\n \n #### --answer--\n \n@@ -391,7 +391,7 @@ Include thumbnail images of products in the cart\n \n #### --text--\n \n-Dark mode doesn't mean pure black. What are some colors and good techniques to create a good dark mode color scheme?\n+Dark mode doesn't mean pure black. What is a good technique to create an effective dark mode color scheme?\n \n #### --distractors--\n \n@@ -439,17 +439,17 @@ What is a design brief?\n \n #### --distractors--\n \n-A design brief is a document outlining the programming and design standards of the project\n+A document outlining the programming and design standards of the project\n \n ---\n \n-A design brief is a document explaining how to replicate a design\n+A document explaining how to replicate a design\n \n ---\n \n-A design brief is a document with detailed information of icons, colors, and assets the designer should use\n+A document with detailed information of icons, colors, and assets the designer should use\n \n #### --answer--\n \n-A design brief states the goals and project scope, budget, design requirements, and other important details of the project\n+A document stating the goals and project scope, budget and design requirements\n "
        },
        {
            "sha": "23e2d4a554e2a2d9267ca6539bbc3f3fbf421ac3",
            "filename": "curriculum/challenges/english/25-front-end-development/review-design-fundamentals/671a892927fdba60db05edfe.md",
            "status": "modified",
            "additions": 1,
            "deletions": 0,
            "changes": 1,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/1d6a0554a0b2dc8ea2dd9e5bec7addf71d2e2b3d/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-design-fundamentals%2F671a892927fdba60db05edfe.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/1d6a0554a0b2dc8ea2dd9e5bec7addf71d2e2b3d/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-design-fundamentals%2F671a892927fdba60db05edfe.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-design-fundamentals%2F671a892927fdba60db05edfe.md?ref=1d6a0554a0b2dc8ea2dd9e5bec7addf71d2e2b3d",
            "patch": "@@ -33,6 +33,7 @@ Review the concepts below to prepare for the upcoming quiz.\n - **Progressive Enhancement**: This is a design approach that ensures all users, regardless of browser or device, can access the essential content and functionality of an application. \n - **User-centered Design**: This is an approach that prioritizes the end user, from their needs to their preferences and limitations. The goal of user-centered design is to craft a web page that is intuitive, efficient to use, and pleasing for your users to interact with.\n - **User Research**: This is the systematic study of the people who use your product. The goal is to measure user needs, behaviors, and pain points.\n+- **Exit Interviews**: This is a survey you can give to users when they cancel their accounts. It can help you understand why users are leaving and what you can do to reduce churn.\n - **User Testing**: This refers to the practice of capturing data from users as they interface with your application.\n - **A/B Testing**: This is the process of shipping a new feature to a randomly selected subset of your user base. You can then leverage analytics data to determine if the feature is beneficial.\n - **User Requirements**: This refers to the stories or rubric that your application needs to follow. User requirements might be defined by user research or industry standards. They can even be defined by stakeholder input."
        }
    ],
    "stats": {
        "total": 77,
        "additions": 39,
        "deletions": 38
    }
}