{
    "author": "larymak",
    "message": "chore (curriculum) add var and hoisting transcripts (#58978)",
    "sha": "1f268fc23d635b3a4a452458e69e13ceb4913c6a",
    "files": [
        {
            "sha": "7e7979ae74c7f815400771b7aa0942341aecb107",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-the-var-keyword-and-hoisting/67329fbcfaf5ff5cdaa38a42.md",
            "status": "modified",
            "additions": 35,
            "deletions": 1,
            "changes": 36,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/1f268fc23d635b3a4a452458e69e13ceb4913c6a/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-the-var-keyword-and-hoisting%2F67329fbcfaf5ff5cdaa38a42.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/1f268fc23d635b3a4a452458e69e13ceb4913c6a/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-the-var-keyword-and-hoisting%2F67329fbcfaf5ff5cdaa38a42.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-the-var-keyword-and-hoisting%2F67329fbcfaf5ff5cdaa38a42.md?ref=1f268fc23d635b3a4a452458e69e13ceb4913c6a",
            "patch": "@@ -8,7 +8,41 @@ dashedName: what-is-the-var-keyword-and-why-is-it-no-longer-suggested-to-use-it\n \n # --description--\n \n-Watch the video lecture and answer the questions below.\n+Watch the video or read the transcript and answer the questions below.\n+\n+# --transcript--\n+\n+What is the `var` keyword and why is it no longer suggested to use it?\n+\n+The `var` keyword in JavaScript is one of the original ways to declare variables. It has been part of the language since its inception and for many years it remained the primary method for creating variables. However as JavaScript evolved and developers gained more experience with the language, certain drawbacks of using `var` became apparent leading to the introduction of `let` and `const` in 2015.\n+\n+When you declare a variable with `var`, it becomes function-scoped or globally-scoped. This means that if you declare a variable inside a function using `var` it's only accessible within that function. However if you declare it outside any function, it becomes a global variable accessible throughout your entire script. This behavior can sometimes lead to unexpected results and make your code harder to reason about.\n+\n+A problem with `var` is that it allows you to redeclare the same variable multiple times without throwing an error. This can lead to accidental overwrites and make debugging more difficult.\n+\n+```js\n+var num = 5;\n+\n+// This is allowed and doesn't throw an error\n+var num = 10;\n+```\n+\n+The most significant issue with `var` is its lack of block scoping. Variables declared with `var` inside a block like an `if` statement or a `for` loop are still accessible outside that block. \n+\n+```js\n+if (true){\n+  var num = 5;\n+}\n+console.log(num); // 5\n+```\n+\n+This behaviour can lead to unintended variable leaks and make your code more prone to bugs.\n+\n+Due to this issues, modern JavaScript development has largely moved away from `var` in favor of `let` and `const`. These keywords provide block scoping which aligns more closely with how scoping works in many other programming languages.\n+\n+They also don't allow redeclaration within the same scope helping to prevent accidental overrides.\n+\n+While `var` is still part of JavaScript and works in all browsers, it's generally recommended to use `let` and `const` in modern JavaScript development. They provide clear scoping rules help prevent common pitfalls and make your code's behavior more predictable.\n \n # --questions--\n "
        },
        {
            "sha": "a26348c978af20f3eab7c11043efd2cba6a0d914",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-the-var-keyword-and-hoisting/67335f45489c5a11b71d0ed5.md",
            "status": "modified",
            "additions": 49,
            "deletions": 1,
            "changes": 50,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/1f268fc23d635b3a4a452458e69e13ceb4913c6a/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-the-var-keyword-and-hoisting%2F67335f45489c5a11b71d0ed5.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/1f268fc23d635b3a4a452458e69e13ceb4913c6a/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-the-var-keyword-and-hoisting%2F67335f45489c5a11b71d0ed5.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-the-var-keyword-and-hoisting%2F67335f45489c5a11b71d0ed5.md?ref=1f268fc23d635b3a4a452458e69e13ceb4913c6a",
            "patch": "@@ -8,7 +8,55 @@ dashedName: what-is-hoisting\n \n # --description--\n \n-Watch the lecture video and answer the questions below.\n+Watch the video or read the transcript and answer the questions below.\n+\n+# --transcript--\n+\n+What is hoisting?\n+\n+Hoisting is a behavior in JavaScript that often confuses beginners, but understanding it can help you avoid subtle bugs in your code. In simple terms hoisting is JavaScript's default behavior of moving declarations to the top of their respective scopes during the compilation phase before the code is executed.\n+\n+To understand hoisting, it's important to know that JavaScript runs in two phases: the compilation phase and the execution phase. During the compilation phase, the JavaScript engine goes through your code and sets up memory space for variables and functions. This is where hoisting comes into play.\n+\n+Let's start with variables hoisting, when you declare a variable using the `var` keyword, JavaScript hoists the declaration to the top of its scope. However it's crucial to note that only the declaration is hoisted, not the initialization. This means you can use a variable in your code before you have declared it, but its value will be `undefined` until you actually assign a value to it.\n+\n+```js\n+console.log(x); // undefined\n+var x = 5;\n+console.log(5); // 5\n+```\n+\n+In this code even though we use `x` before declaring it we don't get an error, instead we get `undefined`. This is because JavaScript hoists the declaration `var x` to the top of its scope but not the inialization `x = 5`. It's as if the code were rewritten like this:\n+\n+```js\n+var x;\n+console.log(x); // undefined\n+x = 5;\n+console.log(x); // 5\n+```\n+\n+Function hoisting works a bit differently. When you declare a function using the `function` declaration syntax both the function name and the function body are hoisted. This means you can a function before you've declared it in your code. Here's an example of function hoisting:\n+\n+```js\n+sayHello(); // \"Hello, World!\"\n+\n+function sayHello(){\n+  console.log(\"Hello, World!\");\n+}\n+```\n+\n+In this case, we can call `sayHello()` before its declaration because the entire function is hoisted to the top of its scope.\n+\n+It's important to note that hoisting works differently with `let` and `const` declarations introduced in ES6. \n+\n+```js\n+console.log(y); // Throws a ReferenceError\n+let y = 10;\n+```\n+\n+These declarations are hoisted but they are not initialized and you can't access them before the actual declaration in your code. This is often referred to as the temporal dead zone.\n+\n+Understanding hoisting can help you write cleaner, more predictable code. However, relying on hosting can make your code harder to read and maintain. As a best practice, it's recommended to declare your variables at the top of their scope and your functions before you use them regardless of hoisting. This make your code's behavior more explicit and easier for other including your future self to understand.\n \n # --questions--\n "
        }
    ],
    "stats": {
        "total": 86,
        "additions": 84,
        "deletions": 2
    }
}