{
    "author": "DeveloperViraj",
    "message": "fix(curriculum): update examples formatting in review-html block (#64476)",
    "sha": "2874cd85abaf2ad375dfce10eb1def3159c254f6",
    "files": [
        {
            "sha": "08a1de007803ed3924efc137d2f8826aee08647b",
            "filename": "curriculum/challenges/english/blocks/review-html/671a883163d5ab5d47145880.md",
            "status": "modified",
            "additions": 4,
            "deletions": 4,
            "changes": 8,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/2874cd85abaf2ad375dfce10eb1def3159c254f6/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Freview-html%2F671a883163d5ab5d47145880.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/2874cd85abaf2ad375dfce10eb1def3159c254f6/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Freview-html%2F671a883163d5ab5d47145880.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Freview-html%2F671a883163d5ab5d47145880.md?ref=2874cd85abaf2ad375dfce10eb1def3159c254f6",
            "patch": "@@ -63,7 +63,7 @@ Review the concepts below to prepare for the upcoming prep exam.\n ## Importance of Semantic HTML\n \n - **Structural hierarchy for heading elements**: It is important to use the correct heading element to maintain the structural hierarchy of the content. The `h1` element is the highest level of heading and the `h6` element is the lowest level of heading.\n-- **Presentational HTML elements**: Elements that define the appearance of content. Ex. the deprecated `center`, `big`, and `font` elements.\n+- **Presentational HTML elements**: Elements that define the appearance of content, e.g., the deprecated `center`, `big`, and `font` elements.\n - **Semantic HTML elements**: These elements provide meaning to the structure of the content. Examples include:\n   - `<header>`: Represents introductory content.\n   - `<nav>`: Contains navigation links.\n@@ -110,7 +110,7 @@ Review the concepts below to prepare for the upcoming prep exam.\n ```\n \n - **`input` element**: used to create an input field for user input.\n-- **`type` attribute**: used to specify the type of input field. Ex. `text`, `email`, `number`, `radio`, `checkbox`, etc.\n+- **`type` attribute**: used to specify the type of input field, e.g., `text`, `email`, `number`, `radio`, `checkbox`.\n - **`placeholder` attribute**: used to show a hint to the user to show them what to enter in the input field.\n - **`value` attribute**: used to specify the value of the input. If the input has a `button` type, the `value` attribute can be used to set the button text.\n - **`name` attribute**: used to assign a name to an input field, which serves as the key when form data is submitted. For radio buttons, giving them the same `name` groups them together, so only one option in the group can be selected at a time.\n@@ -172,7 +172,7 @@ Review the concepts below to prepare for the upcoming prep exam.\n </form>\n ```\n \n-- **`button` element**: used to create a clickable button. A button can also have a `type` attribute, which is used to control the behavior of the button when it is activated. Ex. `submit`, `reset`, `button`.\n+- **`button` element**: used to create a clickable button. A button can also have a `type` attribute, which controls the behavior of the button when it is activated, e.g., `submit`, `reset`, `button`.\n \n ```html\n <button type=\"button\">Show Form</button>\n@@ -292,7 +292,7 @@ Review the concepts below to prepare for the upcoming prep exam.\n - **Accessibility and Tables**: When using tables, you should use the `th` element to define header cells and the `td` element to define data cells. This helps assistive technologies understand the structure of the table.\n - **Importance for inputs to have an associated label**: You should use the `label` element to associate labels with form inputs. This helps assistive technologies understand the purpose of the input.\n - **Importance of good `alt` text**: You should use the `alt` attribute to provide a text alternative for images. This helps assistive technologies understand the content of the image.\n-- **Importance of good link text**: You should use descriptive link text to help users understand the purpose of the link. This helps assistive technologies understand the purpose of the link.\n+- **Importance of good link text**: You should use descriptive link text to help users understand the purpose of the link.\n - **Best practices for making audio and video content accessible**: You should provide captions and transcripts for audio and video content to make it accessible to people with hearing impairments. You should also provide audio descriptions for video content to make it accessible to people with visual impairments.\n - **`tabindex` attribute**: Used to make elements focusable and define the relative order in which they should be navigated using the keyboard. It is important to never use the `tabindex` attribute with a value greater than 0. Instead, you should either use a value of 0 or -1.\n - **`accesskey` attribute**: Used to define a keyboard shortcut for an element. This can help users with mobility impairments navigate the website more easily."
        }
    ],
    "stats": {
        "total": 8,
        "additions": 4,
        "deletions": 4
    }
}