{
    "author": "StuartMosquera",
    "message": "fix(curriculum): remove all instances of lecture videos from English intro.json file (#61551)",
    "sha": "3bd06fe458a93c773591f64e09cd0221c5dfbf45",
    "files": [
        {
            "sha": "228dcb0ccd821665129066e2c2693197cf5bbb09",
            "filename": "client/i18n/locales/english/intro.json",
            "status": "modified",
            "additions": 80,
            "deletions": 80,
            "changes": 160,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/3bd06fe458a93c773591f64e09cd0221c5dfbf45/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/3bd06fe458a93c773591f64e09cd0221c5dfbf45/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json?ref=3bd06fe458a93c773591f64e09cd0221c5dfbf45",
            "patch": "@@ -2086,7 +2086,7 @@\n       \"lecture-understanding-html-attributes\": {\n         \"title\": \"Understanding HTML Attributes\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn more about HTML (HyperText Markup Language), a markup language for creating web pages.\",\n+          \"In these lectures, you will learn more about HTML (HyperText Markup Language), a markup language for creating web pages.\",\n           \"You will learn about HTML's role on the web, and what HTML attributes are.\"\n         ]\n       },\n@@ -2119,7 +2119,7 @@\n       \"lecture-html-fundamentals\": {\n         \"title\": \"HTML Fundamentals\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about HTML fundamentals like the <code>div</code> element, the <code>id</code> and <code>class</code> attributes, the HTML boilerplate, HTML entities, and more.\"\n+          \"In these lectures, you will learn about HTML fundamentals like the <code>div</code> element, the <code>id</code> and <code>class</code> attributes, the HTML boilerplate, HTML entities, and more.\"\n         ]\n       },\n       \"lab-travel-agency-page\": {\n@@ -2155,7 +2155,7 @@\n       \"lecture-working-with-links\": {\n         \"title\": \"Working with Links\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about links, the <code>target</code> attribute, different link states, absolute, and relative paths, and more.\"\n+          \"In these lectures, you will learn about links, the <code>target</code> attribute, different link states, absolute, and relative paths, and more.\"\n         ]\n       },\n       \"review-basic-html\": {\n@@ -2175,7 +2175,7 @@\n       \"lecture-importance-of-semantic-html\": {\n         \"title\": \"Importance of Semantic HTML\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about semantic HTML and why you should care about it, semantic elements, how semantic HTML differs from presentational HTML, and more.\"\n+          \"In these lectures, you will learn about semantic HTML and why you should care about it, semantic elements, how semantic HTML differs from presentational HTML, and more.\"\n         ]\n       },\n       \"lecture-understanding-nuanced-semantic-elements\": {\n@@ -2225,7 +2225,7 @@\n       \"lecture-working-with-forms\": {\n         \"title\": \"Working with Forms\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about forms, the role of labels, inputs and buttons in creating forms, client-side form validation, and form states.\"\n+          \"In these lectures, you will learn about forms, the role of labels, inputs and buttons in creating forms, client-side form validation, and form states.\"\n         ]\n       },\n       \"workshop-hotel-feedback-form\": {\n@@ -2245,7 +2245,7 @@\n       \"lecture-working-with-tables\": {\n         \"title\": \"Working with Tables\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about HTML tables, how to create them, and when to use them.\"\n+          \"In these lectures, you will learn about HTML tables, how to create them, and when to use them.\"\n         ]\n       },\n       \"workshop-final-exams-table\": {\n@@ -2264,7 +2264,7 @@\n       \"lecture-working-with-html-tools\": {\n         \"title\": \"Working with HTML Tools\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about HTML tools and how they let you write better code. These tools include HTML validators, DOM Inspector, and the browser developer tools.\"\n+          \"In these lectures, you will learn about HTML tools and how they let you write better code. These tools include HTML validators, DOM Inspector, and the browser developer tools.\"\n         ]\n       },\n       \"review-html-tables-and-forms\": {\n@@ -2284,25 +2284,25 @@\n       \"lecture-importance-of-accessibility-and-good-html-structure\": {\n         \"title\": \"Importance of Accessibility and Good HTML Structure\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about accessibility and its importance, assistive tools for people with disabilities, HTML attributes that let you create inclusive websites, accessibility best practices, and much more.\"\n+          \"In these lectures, you will learn about accessibility and its importance, assistive tools for people with disabilities, HTML attributes that let you create inclusive websites, accessibility best practices, and much more.\"\n         ]\n       },\n       \"lecture-accessible-tables-forms\": {\n         \"title\": \"Working with Accessible Tables and Forms\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about how to create accessible tables and forms.\"\n+          \"In these lectures, you will learn about how to create accessible tables and forms.\"\n         ]\n       },\n       \"lecture-introduction-to-aria\": {\n         \"title\": \"Introduction to ARIA\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with ARIA roles.\"\n+          \"In these lectures, you will learn about working with ARIA roles.\"\n         ]\n       },\n       \"lecture-accessible-media-elements\": {\n         \"title\": \"Working with Accessible Media Elements\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about how to create accessible links, audio and video content.\"\n+          \"In these lectures, you will learn about how to create accessible links, audio and video content.\"\n         ]\n       },\n       \"lab-checkout-page\": {\n@@ -2351,19 +2351,19 @@\n       \"lecture-understanding-computer-internet-and-tooling-basics\": {\n         \"title\": \"Understanding Computer, Internet, and Tooling Basics\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about the computer, its different parts, internet service providers (ISPs), and the tools professional developers use.\"\n+          \"In these lectures, you will learn about the computer, its different parts, internet service providers (ISPs), and the tools professional developers use.\"\n         ]\n       },\n       \"lecture-working-with-file-systems\": {\n         \"title\": \"Working with File Systems\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn how to work with file and folder systems on your computers. You will learn how to create, move, and delete files and folders, the best practices for naming and organizing files and folders, and more.\"\n+          \"In these lectures, you will learn how to work with file and folder systems on your computers. You will learn how to create, move, and delete files and folders, the best practices for naming and organizing files and folders, and more.\"\n         ]\n       },\n       \"lecture-browsing-the-web-effectively\": {\n         \"title\": \"Browsing the Web Effectively\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about what websites, search engine, and web browsers are, the different browsers available, and how to get the best out of a search engine.\"\n+          \"In these lectures, you will learn about what websites, search engine, and web browsers are, the different browsers available, and how to get the best out of a search engine.\"\n         ]\n       },\n       \"review-computer-basics\": {\n@@ -2382,7 +2382,7 @@\n       \"lecture-what-is-css\": {\n         \"title\": \"What Is CSS?\",\n         \"intro\": [\n-          \"The following lecture videos are all about CSS. You will learn what CSS is and its role on the web, a CSS rule and its anatomy, the three ways to write CSS and when to use each, inline and block elements, and many more.\"\n+          \"The following lectures are all about CSS. You will learn what CSS is and its role on the web, a CSS rule and its anatomy, the three ways to write CSS and when to use each, inline and block elements, and many more.\"\n         ]\n       },\n       \"workshop-cafe-menu\": {\n@@ -2402,7 +2402,7 @@\n       \"lecture-css-specificity-the-cascade-algorithm-and-inheritance\": {\n         \"title\": \"CSS Specificity, the Cascade Algorithm, and Inheritance\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about CSS specificity, the common selectors and their specificities, the cascade algorithm, inheritance, and more.\"\n+          \"In these lectures, you will learn about CSS specificity, the common selectors and their specificities, the cascade algorithm, inheritance, and more.\"\n         ]\n       },\n       \"review-basic-css\": {\n@@ -2421,7 +2421,7 @@\n       \"lecture-styling-lists-and-links\": {\n         \"title\": \"Styling Lists and Links\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn the properties you need to know to effectively style lists and links, including link states like <code>link</code>, <code>visited</code>, <code>hover</code>, and <code>active</code>.\"\n+          \"In these lectures, you will learn the properties you need to know to effectively style lists and links, including link states like <code>link</code>, <code>visited</code>, <code>hover</code>, and <code>active</code>.\"\n         ]\n       },\n       \"lab-stylized-to-do-list\": {\n@@ -2434,7 +2434,7 @@\n       \"lecture-working-with-backgrounds-and-borders\": {\n         \"title\": \"Working with Backgrounds and Borders\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about the properties and values you need to know to style backgrounds and borders of elements, alongside the accessibility considerations for backgrounds.\"\n+          \"In these lectures, you will learn about the properties and values you need to know to style backgrounds and borders of elements, alongside the accessibility considerations for backgrounds.\"\n         ]\n       },\n       \"lab-blog-post-card\": {\n@@ -2460,19 +2460,19 @@\n       \"lecture-user-interface-design-fundamentals\": {\n         \"title\": \"User Interface Design Fundamentals\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about the fundamentals of user interface (UI) design. You will learn about the terms you need to know to communicate with designers, visual hierarchy, scaling, alignment, whitespace, and much more.\"\n+          \"In these lectures, you will learn about the fundamentals of user interface (UI) design. You will learn about the terms you need to know to communicate with designers, visual hierarchy, scaling, alignment, whitespace, and much more.\"\n         ]\n       },\n       \"lecture-user-centered-design\": {\n         \"title\": \"User-Centered Design\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about best practices for designing user-facing features like dark mode, breadcrumbs, modal dialogs, and much more. You will also learn how to conduct user research, user requirements and testing.\"\n+          \"In these lectures, you will learn about best practices for designing user-facing features like dark mode, breadcrumbs, modal dialogs, and much more. You will also learn how to conduct user research, user requirements and testing.\"\n         ]\n       },\n       \"lecture-common-design-tools\": {\n         \"title\": \"Common Design Tools\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about the common design tools developers should know. You will also learn about design briefs and how developers work with them.\"\n+          \"In these lectures, you will learn about the common design tools developers should know. You will also learn about design briefs and how developers work with them.\"\n         ]\n       },\n       \"review-design-fundamentals\": {\n@@ -2491,7 +2491,7 @@\n       \"lecture-working-with-relative-and-absolute-units\": {\n         \"title\": \"Working with Relative and Absolute Units\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about relative and absolute units, and how they both impact what you see in the browser.\"\n+          \"In these lectures, you will learn about relative and absolute units, and how they both impact what you see in the browser.\"\n         ]\n       },\n       \"lab-event-flyer-page\": {\n@@ -2517,13 +2517,13 @@\n       \"lecture-working-with-pseudo-classes-and-pseudo-elements-in-css\": {\n         \"title\": \"Working with Pseudo-Classes and Pseudo-Elements in CSS\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about pseudo-classes and pseudo-elements, alongside their examples and how they work.\"\n+          \"In these lectures, you will learn about pseudo-classes and pseudo-elements, alongside their examples and how they work.\"\n         ]\n       },\n       \"workshop-greeting-card\": {\n         \"title\": \"Design a Greeting Card\",\n         \"intro\": [\n-          \"In the previous lecture videos, you learned how to work with the different types of pseudo-classes.\",\n+          \"In the previous lectures, you learned how to work with the different types of pseudo-classes.\",\n           \"In this workshop, you will have a chance to practice what you have learned by designing a greeting card.\"\n         ]\n       },\n@@ -2548,7 +2548,7 @@\n       \"lecture-working-with-colors-in-css\": {\n         \"title\": \"Working with Colors in CSS\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about linear and radial gradients, the color theory, different kinds of colors like named, RGB, Hex, and HSL colors. You will learn how these colors work, and which to use in specific cases.\"\n+          \"In these lectures, you will learn about linear and radial gradients, the color theory, different kinds of colors like named, RGB, Hex, and HSL colors. You will learn how these colors work, and which to use in specific cases.\"\n         ]\n       },\n       \"workshop-colored-markers\": {\n@@ -2577,7 +2577,7 @@\n       \"lecture-best-practices-for-styling-forms\": {\n         \"title\": \"Best Practices for Styling Forms\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about the best practices for styling forms and issues you can encounter while styling special inputs like <code>color</code> and <code>datetime-local</code>.\"\n+          \"In these lectures, you will learn about the best practices for styling forms and issues you can encounter while styling special inputs like <code>color</code> and <code>datetime-local</code>.\"\n         ]\n       },\n       \"workshop-registration-form\": {\n@@ -2608,7 +2608,7 @@\n       \"lecture-working-with-css-transforms-overflow-and-filters\": {\n         \"title\": \"Working with CSS Transforms, Overflow, and Filters\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with CSS transforms, overflow, and filters. You will also learn about the box model and how it works.\"\n+          \"In these lectures, you will learn about working with CSS transforms, overflow, and filters. You will also learn about the box model and how it works.\"\n         ]\n       },\n       \"workshop-rothko-painting\": {\n@@ -2640,7 +2640,7 @@\n       \"lecture-working-with-css-flexbox\": {\n         \"title\": \"Working with CSS Flexbox\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn how CSS flexbox works, its properties, and when you should use it.\"\n+          \"In these lectures, you will learn how CSS flexbox works, its properties, and when you should use it.\"\n         ]\n       },\n       \"workshop-flexbox-photo-gallery\": {\n@@ -2670,7 +2670,7 @@\n       \"lecture-working-with-css-fonts\": {\n         \"title\": \"Working with CSS Fonts\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about typography and its best practices, fonts, and the <code>text-shadow</code> property.\"\n+          \"In these lectures, you will learn about typography and its best practices, fonts, and the <code>text-shadow</code> property.\"\n         ]\n       },\n       \"workshop-nutritional-label\": {\n@@ -2701,7 +2701,7 @@\n       \"lecture-best-practices-for-accessibility-and-css\": {\n         \"title\": \"Best Practices for Accessibility and CSS\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about best practices for accessibility in CSS, and the tools for checking good color contrast on websites.\"\n+          \"In these lectures, you will learn about best practices for accessibility in CSS, and the tools for checking good color contrast on websites.\"\n         ]\n       },\n       \"workshop-accessibility-quiz\": {\n@@ -2733,7 +2733,7 @@\n       \"lecture-working-with-attribute-selectors\": {\n         \"title\": \"Working with Attribute Selectors\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about attribute selectors and how to use them to target elements like links and lists.\"\n+          \"In these lectures, you will learn about attribute selectors and how to use them to target elements like links and lists.\"\n         ]\n       },\n       \"workshop-balance-sheet\": {\n@@ -2765,7 +2765,7 @@\n       \"lecture-understanding-how-to-work-with-floats-and-positioning-in-css\": {\n         \"title\": \"Understanding How to Work with Floats and Positioning in CSS\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn how to use CSS positioning and floats. You will learn about <code>absolute</code>, <code>relative</code>, <code>fixed</code>, and <code>sticky</code> positioning. You will also use the <code>z-index</code> property.\"\n+          \"In these lectures, you will learn how to use CSS positioning and floats. You will learn about <code>absolute</code>, <code>relative</code>, <code>fixed</code>, and <code>sticky</code> positioning. You will also use the <code>z-index</code> property.\"\n         ]\n       },\n       \"workshop-cat-painting\": {\n@@ -2796,7 +2796,7 @@\n       \"lecture-best-practices-for-responsive-web-design\": {\n         \"title\": \"Best Practices for Responsive Web Design\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about the best practices for responsive web design, the roles concepts like grid, flexbox, media queries, and media breakpoints play in responsive design, and more.\"\n+          \"In these lectures, you will learn about the best practices for responsive web design, the roles concepts like grid, flexbox, media queries, and media breakpoints play in responsive design, and more.\"\n         ]\n       },\n       \"workshop-piano\": {\n@@ -2829,7 +2829,7 @@\n       \"lecture-working-with-css-variables\": {\n         \"title\": \"Working with CSS Variables\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn how to define and use custom properties (also known as CSS variables). You will also learn about the <code>@property</code> rule and how it works.\"\n+          \"In these lectures, you will learn how to define and use custom properties (also known as CSS variables). You will also learn about the <code>@property</code> rule and how it works.\"\n         ]\n       },\n       \"workshop-city-skyline\": {\n@@ -2860,7 +2860,7 @@\n       \"lecture-working-with-css-grid\": {\n         \"title\": \"Working with CSS Grid\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about CSS grid, its several properties and how to use them, and how CSS grid differs from flexbox.\"\n+          \"In these lectures, you will learn about CSS grid, its several properties and how to use them, and how CSS grid differs from flexbox.\"\n         ]\n       },\n       \"workshop-magazine\": {\n@@ -2879,7 +2879,7 @@\n       \"lecture-debugging-css\": {\n         \"title\": \"Debugging CSS\",\n         \"intro\": [\n-          \"In this lecture video, you'll learn how to debug CSS using your browser's developer tools and CSS validators.\"\n+          \"In this lecture, you'll learn how to debug CSS using your browser's developer tools and CSS validators.\"\n         ]\n       },\n       \"lab-product-landing-page\": {\n@@ -2908,7 +2908,7 @@\n       \"lecture-animations-and-accessibility\": {\n         \"title\": \"Animations and Accessibility\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about CSS animations and their accessibility concerns. You will also learn how <code>prefers-reduced-motion</code> can help address those accessibility concerns.\"\n+          \"In these lectures, you will learn about CSS animations and their accessibility concerns. You will also learn how <code>prefers-reduced-motion</code> can help address those accessibility concerns.\"\n         ]\n       },\n       \"workshop-ferris-wheel\": {\n@@ -2959,13 +2959,13 @@\n       \"lecture-working-with-code-editors-and-ides\": {\n         \"title\": \"Working with Code Editors and IDEs\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn how to work with code editors and IDEs. You will learn various concepts about the most popular code editor, VS Code such as its installation, how to create a project in it, keyboard shortcuts, and extensions.\"\n+          \"In these lectures, you will learn how to work with code editors and IDEs. You will learn various concepts about the most popular code editor, VS Code such as its installation, how to create a project in it, keyboard shortcuts, and extensions.\"\n         ]\n       },\n       \"lecture-introduction-to-javascript\": {\n         \"title\": \"Introduction to JavaScript\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn the fundamentals of JavaScript. Topics covered include, but are not limited to, variables, data types, how JavaScript interacts with HTML and CSS, strings, and much more.\"\n+          \"In these lectures, you will learn the fundamentals of JavaScript. Topics covered include, but are not limited to, variables, data types, how JavaScript interacts with HTML and CSS, strings, and much more.\"\n         ]\n       },\n       \"workshop-greeting-bot\": {\n@@ -2990,7 +2990,7 @@\n       \"lecture-working-with-data-types\": {\n         \"title\": \"Working with Data Types\",\n         \"intro\": [\n-          \"In the following lecture videos, you will learn how to work with data types in JavaScript. You will also learn how dynamic typing differs from static typing, the <code>typeof</code> operator, and the <code>typeof null</code> bug.\"\n+          \"In the following lectures, you will learn how to work with data types in JavaScript. You will also learn how dynamic typing differs from static typing, the <code>typeof</code> operator, and the <code>typeof null</code> bug.\"\n         ]\n       },\n       \"review-javascript-variables-and-data-types\": {\n@@ -3009,7 +3009,7 @@\n       \"lecture-working-with-strings-in-javascript\": {\n         \"title\": \"Working with Strings in JavaScript\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn how to work with strings in JavaScript. You will learn how to access characters from a string, how to use template literals and interpolation, how to create a new line in strings, and much more.\"\n+          \"In these lectures, you will learn how to work with strings in JavaScript. You will learn how to access characters from a string, how to use template literals and interpolation, how to create a new line in strings, and much more.\"\n         ]\n       },\n       \"workshop-teacher-chatbot\": {\n@@ -3022,7 +3022,7 @@\n       \"lecture-working-with-common-string-methods\": {\n         \"title\": \"Working with Common String Methods\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about the common string methods available in JavaScript. The string methods will let you do things like extracting a part of a string, changing the casing for a string, replacing a part of a string, trimming whitespace from a string, and much more.\"\n+          \"In these lectures, you will learn about the common string methods available in JavaScript. The string methods will let you do things like extracting a part of a string, changing the casing for a string, replacing a part of a string, trimming whitespace from a string, and much more.\"\n         ]\n       },\n       \"review-javascript-strings\": {\n@@ -3082,7 +3082,7 @@\n       \"lecture-working-with-numbers-and-common-number-methods\": {\n         \"title\": \"Working with Numbers and Common Number Methods\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about numbers and common number methods. These include <code>isNaN()</code>, <code>parseInt()</code>, <code>parseFloat()</code>, and <code>toFixed()</code>.\"\n+          \"In these lectures, you will learn about numbers and common number methods. These include <code>isNaN()</code>, <code>parseInt()</code>, <code>parseFloat()</code>, and <code>toFixed()</code>.\"\n         ]\n       },\n       \"review-javascript-math\": {\n@@ -3101,7 +3101,7 @@\n       \"lecture-understanding-comparisons-and-conditionals\": {\n         \"title\": \"Understanding Comparisons and Conditionals\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about comparison operators and conditionals. You will learn how the various conditionals differ from one another, and how comparisons work with <code>null</code> and <code>undefined</code>.\"\n+          \"In these lectures, you will learn about comparison operators and conditionals. You will learn how the various conditionals differ from one another, and how comparisons work with <code>null</code> and <code>undefined</code>.\"\n         ]\n       },\n       \"review-javascript-comparisons-and-conditionals\": {\n@@ -3120,7 +3120,7 @@\n       \"lecture-working-with-functions\": {\n         \"title\": \"Working with Functions\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn how to reuse a block of code with functions. You will learn what the purpose of a function is and how they work, and how scope works in programming. \"\n+          \"In these lectures, you will learn how to reuse a block of code with functions. You will learn what the purpose of a function is and how they work, and how scope works in programming. \"\n         ]\n       },\n       \"workshop-calculator\": {\n@@ -3187,7 +3187,7 @@\n       \"lecture-working-with-arrays\": {\n         \"title\": \"Working with Arrays\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn how to work with JavaScript arrays. You will learn about what makes an array, one-dimensional and two-dimensional arrays, how to access and update the elements in an array, and much more.\"\n+          \"In these lectures, you will learn how to work with JavaScript arrays. You will learn about what makes an array, one-dimensional and two-dimensional arrays, how to access and update the elements in an array, and much more.\"\n         ]\n       },\n       \"workshop-shopping-list\": {\n@@ -3212,7 +3212,7 @@\n       \"lecture-working-with-common-array-methods\": {\n         \"title\": \"Working with Common Array Methods\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about the array methods for performing more advanced operations like getting the position of an item in an array, checking if an array contains a certain element, copying an array, and lots more.\"\n+          \"In these lectures, you will learn about the array methods for performing more advanced operations like getting the position of an item in an array, checking if an array contains a certain element, copying an array, and lots more.\"\n         ]\n       },\n       \"review-javascript-arrays\": {\n@@ -3229,7 +3229,7 @@\n       \"lecture-working-with-objects\": {\n         \"title\": \"Working with Objects\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn how to work with JavaScript objects. The concepts you will learn include how to access properties from an object, check if an object has a property, how object methods differ from functions, object destructuring, and much more.\"\n+          \"In these lectures, you will learn how to work with JavaScript objects. The concepts you will learn include how to access properties from an object, check if an object has a property, how object methods differ from functions, object destructuring, and much more.\"\n         ]\n       },\n       \"workshop-recipe-tracker\": {\n@@ -3259,7 +3259,7 @@\n       \"lecture-working-with-loops\": {\n         \"title\": \"Working with Loops\",\n         \"intro\": [\n-          \"Loops are an essential part of JavaScript. That's why the following lecture videos have been prepared for you to learn about the different types of loops and how they work, and also how iteration works.\"\n+          \"Loops are an essential part of JavaScript. That's why the following lectures have been prepared for you to learn about the different types of loops and how they work, and also how iteration works.\"\n         ]\n       },\n       \"workshop-sentence-analyzer\": {\n@@ -3363,7 +3363,7 @@\n       \"lecture-the-var-keyword-and-hoisting\": {\n         \"title\": \"The var Keyword and Hoisting\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about the <code>var</code> keyword and why it is not recommended for use anymore. You will also learn about hoisting in JavaScript so you can avoid subtle bugs in your code.\"\n+          \"In these lectures, you will learn about the <code>var</code> keyword and why it is not recommended for use anymore. You will also learn about hoisting in JavaScript so you can avoid subtle bugs in your code.\"\n         ]\n       },\n       \"lab-inventory-management-program\": {\n@@ -3376,7 +3376,7 @@\n       \"lecture-understanding-modules-imports-and-exports\": {\n         \"title\": \"Understanding Modules, Imports, and Exports\",\n         \"intro\": [\n-          \"In this lecture video, you will learn about modules, imports, and exports in JavaScript.\"\n+          \"In this lecture, you will learn about modules, imports, and exports in JavaScript.\"\n         ]\n       },\n       \"lab-password-generator\": {\n@@ -3407,7 +3407,7 @@\n       \"lecture-working-with-higher-order-functions-and-callbacks\": {\n         \"title\": \"Working with Higher Order Functions and Callbacks\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn how to work with higher order functions and callbacks. The higher order functions you will learn include <code>map()</code>, <code>filter()</code>, <code>reduce()</code>, <code>sort()</code>, <code>every()</code>, and <code>some()</code>. You will also learn how to chain these methods together to achieve your desired results.\"\n+          \"In these lectures, you will learn how to work with higher order functions and callbacks. The higher order functions you will learn include <code>map()</code>, <code>filter()</code>, <code>reduce()</code>, <code>sort()</code>, <code>every()</code>, and <code>some()</code>. You will also learn how to chain these methods together to achieve your desired results.\"\n         ]\n       },\n       \"workshop-library-manager\": {\n@@ -3438,7 +3438,7 @@\n       \"lecture-working-with-the-dom-click-events-and-web-apis\": {\n         \"title\": \"Working with the DOM, Click Events, and Web APIs\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn how to work with the Document Object Model (DOM), the <code>addEventListener()</code> method and events, and web APIs.\"\n+          \"In these lectures, you will learn how to work with the Document Object Model (DOM), the <code>addEventListener()</code> method and events, and web APIs.\"\n         ]\n       },\n       \"workshop-storytelling-app\": {\n@@ -3456,7 +3456,7 @@\n       \"lecture-understanding-the-event-object-and-event-delegation\": {\n         \"title\": \"Understanding the Event Object and Event Delegation\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about the event object, the change event, event bubbling, and event delegation.\"\n+          \"In these lectures, you will learn about the event object, the change event, event bubbling, and event delegation.\"\n         ]\n       },\n       \"workshop-music-instrument-filter\": {\n@@ -3539,7 +3539,7 @@\n       \"lecture-debugging-techniques\": {\n         \"title\": \"Debugging Techniques\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about the common errors in JavaScript and the techniques you can use to fix them – a process called debugging.\"\n+          \"In these lectures, you will learn about the common errors in JavaScript and the techniques you can use to fix them – a process called debugging.\"\n         ]\n       },\n       \"lab-random-background-color-changer\": {\n@@ -3562,7 +3562,7 @@\n       \"lecture-working-with-regular-expressions\": {\n         \"title\": \"Working with Regular Expressions\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about regular expressions in JavaScript. You will learn about the methods for working with regular expressions, modifiers, character classes, lookaheads, lookbehinds, back-references, quantifiers, and more.\"\n+          \"In these lectures, you will learn about regular expressions in JavaScript. You will learn about the methods for working with regular expressions, modifiers, character classes, lookaheads, lookbehinds, back-references, quantifiers, and more.\"\n         ]\n       },\n       \"workshop-spam-filter\": {\n@@ -3599,7 +3599,7 @@\n       \"lecture-understanding-form-validation\": {\n         \"title\": \"Understanding Form Validation\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about form validation in JavaScript. You will learn about the various ways to validate forms, how the <code>preventDefault()</code> method works, and how the submit event works.\"\n+          \"In these lectures, you will learn about form validation in JavaScript. You will learn about the various ways to validate forms, how the <code>preventDefault()</code> method works, and how the submit event works.\"\n         ]\n       },\n       \"workshop-calorie-counter\": {\n@@ -3632,7 +3632,7 @@\n       \"lecture-working-with-dates\": {\n         \"title\": \"Working with Dates\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about the JavaScript date object. You will learn about the methods for working with dates and how to format dates.\"\n+          \"In these lectures, you will learn about the JavaScript date object. You will learn about the methods for working with dates and how to format dates.\"\n         ]\n       },\n       \"lab-date-conversion\": {\n@@ -3657,7 +3657,7 @@\n       \"lecture-working-with-audio-and-video\": {\n         \"title\": \"Working with Audio and Video\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn how to work with audio and video files using JavaScript. You will learn about the <code>Audio</code> and <code>Video</code> constructors, their methods and properties, audio and video formats, codecs, the <code>HTMLMediaElement</code> API, and much more.\"\n+          \"In these lectures, you will learn how to work with audio and video files using JavaScript. You will learn about the <code>Audio</code> and <code>Video</code> constructors, their methods and properties, audio and video formats, codecs, the <code>HTMLMediaElement</code> API, and much more.\"\n         ]\n       },\n       \"workshop-music-player\": {\n@@ -3689,7 +3689,7 @@\n       \"lecture-working-with-maps-and-sets\": {\n         \"title\": \"Working with Maps and Sets\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>.\"\n+          \"In these lectures, you will learn about JavaScript <code>Map</code> and <code>Set</code>. You will also learn how they both differ from <code>WeakSets</code> and <code>WeakMaps</code>.\"\n         ]\n       },\n       \"workshop-plant-nursery-catalog\": {\n@@ -3721,7 +3721,7 @@\n       \"lecture-working-with-client-side-storage-and-crud-operations\": {\n         \"title\": \"Working with Client-Side Storage and CRUD Operations\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about client-side storage and CRUD operations in JavaScript. You will learn about <code>localStorage</code> and <code>sessionStorage</code> alongside their methods and properties, cookies, the Cache API, IndexDB, and much more.\"\n+          \"In these lectures, you will learn about client-side storage and CRUD operations in JavaScript. You will learn about <code>localStorage</code> and <code>sessionStorage</code> alongside their methods and properties, cookies, the Cache API, IndexDB, and much more.\"\n         ]\n       },\n       \"workshop-todo-app\": {\n@@ -3754,7 +3754,7 @@\n       \"lecture-understanding-how-to-work-with-classes-in-javascript\": {\n         \"title\": \"Understanding How to Work with Classes in JavaScript\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about classes in JavaScript. You will learn about inheritance, the <code>this</code> keyword, static properties and methods, and more.\"\n+          \"In these lectures, you will learn about classes in JavaScript. You will learn about inheritance, the <code>this</code> keyword, static properties and methods, and more.\"\n         ]\n       },\n       \"workshop-shopping-cart\": {\n@@ -3793,7 +3793,7 @@\n       \"lecture-understanding-recursion-and-the-call-stack\": {\n         \"title\": \"Understanding Recursion and the Call Stack\",\n         \"intro\": [\n-          \"In this lecture video, you will learn about recursion and the call stack.\"\n+          \"In this lecture, you will learn about recursion and the call stack.\"\n         ]\n       },\n       \"workshop-decimal-to-binary-converter\": {\n@@ -3823,13 +3823,13 @@\n       \"lecture-understanding-functional-programming\": {\n         \"title\": \"Understanding Functional Programming\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about functional programming and how to nest functions using a technique called currying.\"\n+          \"In these lectures, you will learn about functional programming and how to nest functions using a technique called currying.\"\n         ]\n       },\n       \"workshop-recipe-ingredient-converter\": {\n         \"title\": \"Build a Recipe Ingredient Converter\",\n         \"intro\": [\n-          \"In the previous lecture videos, you learned the core concepts behind functional programming and currying.\",\n+          \"In the previous lectures, you learned the core concepts behind functional programming and currying.\",\n           \"Now you will be able to apply what you have learned about currying and functional programming by building a recipe ingredient converter application.\"\n         ]\n       },\n@@ -3855,7 +3855,7 @@\n       \"lecture-understanding-asynchronous-programming\": {\n         \"title\": \"Understanding Asynchronous Programming\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about asynchronous programming in JavaScript. You will learn about the differences between synchronous and asynchronous programming, how the <code>async</code> keyword works, the <code>Fetch</code> API, promises, <code>async/await</code>, the <code>Geolocation</code> API, and much more.\"\n+          \"In these lectures, you will learn about asynchronous programming in JavaScript. You will learn about the differences between synchronous and asynchronous programming, how the <code>async</code> keyword works, the <code>Fetch</code> API, promises, <code>async/await</code>, the <code>Geolocation</code> API, and much more.\"\n         ]\n       },\n       \"workshop-fcc-authors-page\": {\n@@ -3901,13 +3901,13 @@\n       \"lecture-introduction-to-javascript-libraries-and-frameworks\": {\n         \"title\": \"Introduction to JavaScript Libraries and Frameworks\",\n         \"intro\": [\n-          \"In these lecture videos, you will get an introduction to JavaScript libraries and frameworks. You will learn about the roles of JavaScript libraries and frameworks, single page applications (SPAs) and the issue surrounding them, and React, the most popular frontend JavaScript library.\"\n+          \"In these lectures, you will get an introduction to JavaScript libraries and frameworks. You will learn about the roles of JavaScript libraries and frameworks, single page applications (SPAs) and the issue surrounding them, and React, the most popular frontend JavaScript library.\"\n         ]\n       },\n       \"workshop-reusable-mega-navbar\": {\n         \"title\": \"Build a Reusable Mega Navbar\",\n         \"intro\": [\n-          \"In the previous lecture videos, you learned how to work with components in React.\",\n+          \"In the previous lectures, you learned how to work with components in React.\",\n           \"In this workshop, you will build a reusable Navbar component using React.\"\n         ]\n       },\n@@ -3918,7 +3918,7 @@\n       \"lecture-working-with-data-in-react\": {\n         \"title\": \"Working with Data in React\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn how to work with data in React. You will learn about <code>props</code> and how to pass them around, conditional rendering, how to render lists, and how to use inline styles.\"\n+          \"In these lectures, you will learn how to work with data in React. You will learn about <code>props</code> and how to pass them around, conditional rendering, how to render lists, and how to use inline styles.\"\n         ]\n       },\n       \"workshop-reusable-profile-card-component\": {\n@@ -3947,7 +3947,7 @@\n       \"lecture-working-with-state-and-responding-to-events-in-react\": {\n         \"title\": \"Working with State and Responding to Events in React\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with state and responding to events with React.\"\n+          \"In these lectures, you will learn about working with state and responding to events with React.\"\n         ]\n       },\n       \"workshop-toggle-text-app\": {\n@@ -3966,7 +3966,7 @@\n       \"lecture-understanding-effects-and-referencing-values-in-react\": {\n         \"title\": \"Understanding Effects and Referencing Values in React\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about effects and referencing values with React.\"\n+          \"In these lectures, you will learn about effects and referencing values with React.\"\n         ]\n       },\n       \"workshop-fruit-search-app\": {\n@@ -3998,7 +3998,7 @@\n       \"lecture-working-with-forms-in-react\": {\n         \"title\": \"Working with Forms in React\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with forms in React.\"\n+          \"In these lectures, you will learn about working with forms in React.\"\n         ]\n       },\n       \"workshop-superhero-application-form\": {\n@@ -4017,7 +4017,7 @@\n       \"lecture-working-with-data-fetching-and-memoization-in-react\": {\n         \"title\": \"Working with Data Fetching and Memoization in React\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about data fetching and memoization in React.\"\n+          \"In these lectures, you will learn about data fetching and memoization in React.\"\n         ]\n       },\n       \"workshop-shopping-list-app\": {\n@@ -4036,7 +4036,7 @@\n       \"lecture-routing-react-frameworks-and-dependency-management-tools\": {\n         \"title\": \"Routing, React Frameworks, and Dependency Management Tools\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about routing in React, React frameworks, and dependency management tools.\"\n+          \"In these lectures, you will learn about routing in React, React frameworks, and dependency management tools.\"\n         ]\n       },\n       \"lab-tic-tac-toe\": {\n@@ -4049,7 +4049,7 @@\n       \"lecture-react-strategies-and-debugging\": {\n         \"title\": \"React Strategies and Debugging\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about different strategies and debugging in React.\"\n+          \"In these lectures, you will learn about different strategies and debugging in React.\"\n         ]\n       },\n       \"review-react-forms-data-fetching-and-routing\": {\n@@ -4068,7 +4068,7 @@\n       \"lecture-understanding-performance-in-web-applications\": {\n         \"title\": \"Understanding Performance in Web Applications\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn performance in web applications.\"\n+          \"In these lectures, you will learn performance in web applications.\"\n         ]\n       },\n       \"review-web-performance\": {\n@@ -4087,7 +4087,7 @@\n       \"lecture-working-with-css-libraries-and-frameworks\": {\n         \"title\": \"Working with CSS Libraries and Frameworks\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn how to work with CSS libraries and frameworks.\"\n+          \"In these lectures, you will learn how to work with CSS libraries and frameworks.\"\n         ]\n       },\n       \"workshop-error-message-component\": {\n@@ -4131,7 +4131,7 @@\n       \"lecture-understanding-the-different-types-of-testing\": {\n         \"title\": \"Understanding the Different Types of Testing\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about the different types of testing.\"\n+          \"In these lectures, you will learn about the different types of testing.\"\n         ]\n       },\n       \"review-testing\": {\n@@ -4148,7 +4148,7 @@\n       \"lecture-introduction-to-typescript\": {\n         \"title\": \"Introduction to TypeScript\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn what TypeScript is and how to use it.\"\n+          \"In these lectures, you will learn what TypeScript is and how to use it.\"\n         ]\n       },\n       \"trvf\": { \"title\": \"293\", \"intro\": [] },\n@@ -4178,7 +4178,7 @@\n       \"lecture-introduction-to-python\": {\n         \"title\": \"Introduction to Python\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn the fundamentals of Python. You'll learn about variables, data types, operators, control flow, functions, and more.\"\n+          \"In these lectures, you will learn the fundamentals of Python. You'll learn about variables, data types, operators, control flow, functions, and more.\"\n         ]\n       },\n       \"workshop-caesar-cipher\": {"
        }
    ],
    "stats": {
        "total": 160,
        "additions": 80,
        "deletions": 80
    }
}