{
    "author": "cuongpham24",
    "message": "feat(curriculum): Add interactive examples to margin collapsing lesson (#63019)",
    "sha": "3cd5a6d1c4ec5d0aa59369bb27935010b28972c2",
    "files": [
        {
            "sha": "e3c0422ecc86b5f9da1d19681b40f90cf718f36d",
            "filename": "curriculum/challenges/english/blocks/lecture-working-with-css-transforms-overflow-and-filters/672bccae6e556cd81cef6af2.md",
            "status": "modified",
            "additions": 17,
            "deletions": 1,
            "changes": 18,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/3cd5a6d1c4ec5d0aa59369bb27935010b28972c2/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-css-transforms-overflow-and-filters%2F672bccae6e556cd81cef6af2.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/3cd5a6d1c4ec5d0aa59369bb27935010b28972c2/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-css-transforms-overflow-and-filters%2F672bccae6e556cd81cef6af2.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-css-transforms-overflow-and-filters%2F672bccae6e556cd81cef6af2.md?ref=3cd5a6d1c4ec5d0aa59369bb27935010b28972c2",
            "patch": "@@ -5,7 +5,7 @@ challengeType: 19\n dashedName: what-is-margin-collapsing\n ---\n \n-# --description--\n+# --interactive--\n \n Margin collapsing is a fundamental concept in CSS that often confuses newcomers to web development.\n \n@@ -15,6 +15,8 @@ Understanding margin collapsing is important for precise control over spacing an\n \n In CSS when two vertical margins come into contact with each other they'll collapse, this means that instead of adding together the larger margin wins and determines the space between the elements. This behavior applies only to vertical margins top and bottom and not horizontal margins, not the left and right. So, here's an example to illustrate this concept:\n \n+:::interactive_editor\n+\n ```html\n <style>\n   .box1 {\n@@ -31,12 +33,16 @@ In CSS when two vertical margins come into contact with each other they'll colla\n <div class=\"box2\">Box 2</div>\n ```\n \n+:::\n+\n In this example, you might expect the total space between `.box1` and `.box2` to be 50 pixels (20 pixels plus 30 pixels). However, due to margin collapsing the actual space will be 30 pixels, which is the larger of the two margins.\n \n As we saw in the previous examples, margins of the adjacent sibling elements will collapse. This is the most straight forward case of margin collapsing. Let's explore more cases where margin collapsing can occur. \n \n Margins can also collapse between a parent element and its first or last child. If there's no border, padding, inline content, or clearance to separate the parent's margin from the child's, they will collapse.\n \n+:::interactive_editor\n+\n ```html\n <style>\n   .parent {\n@@ -54,10 +60,14 @@ Margins can also collapse between a parent element and its first or last child.\n </div>\n ```\n \n+:::\n+\n In this case you might expect the child to be 70 pixels from the top (40 pixels plus 30 pixels). However, the margins collapse and the larger margin 40 pixels is used.\n \n If an element has no content, padding, or border, its top and bottom margins can collapse into a single margin. \n \n+:::interactive_editor\n+\n ```html\n <style>\n   .empty-block {\n@@ -74,10 +84,14 @@ If an element has no content, padding, or border, its top and bottom margins can\n <div class=\"next-block\">Next block</div>\n ```\n \n+:::\n+\n In this example the `empty-block`s top and bottom margins collapse into a single 30 pixels margin, the larger of the two.\n \n Here's another example of preventing collapse using padding: \n \n+:::interactive_editor\n+\n ```html\n <style>\n   .parent {\n@@ -96,6 +110,8 @@ Here's another example of preventing collapse using padding:\n </div>\n ```\n \n+:::\n+\n In this case the one pixel padding on the parent prevents the margin from collapsing resulting in a total space of 71 pixels from the top of the parent to the top of the child content.\n \n Understanding margin collapsing is important for precise control over layout and spacing in CSS. While it can sometimes lead to unexpected results, it's a feature designed to create more aesthetic and consistent spacing in documents. By knowing when margin collapsing occurs and how to prevent it when necessary, you can create more predictable and maintainable layouts in your web designs."
        }
    ],
    "stats": {
        "total": 18,
        "additions": 17,
        "deletions": 1
    }
}