{
    "author": "jdwilkin4",
    "message": "feat(curriculum): adding content for HTML chapter review page (#57022)",
    "sha": "420e6f03bea62228a090ceaa450cbd8820c6547b",
    "files": [
        {
            "sha": "4e5e3e960bafe9168bcd6e4f0510164348f8fdf8",
            "filename": "client/i18n/locales/english/intro.json",
            "status": "modified",
            "additions": 4,
            "deletions": 1,
            "changes": 5,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/420e6f03bea62228a090ceaa450cbd8820c6547b/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/420e6f03bea62228a090ceaa450cbd8820c6547b/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json?ref=420e6f03bea62228a090ceaa450cbd8820c6547b",
            "patch": "@@ -1853,7 +1853,10 @@\n       },\n       \"review-html\": {\n         \"title\": \"HTML Review\",\n-        \"intro\": [\"Review the HTML concepts to prepare for the upcoming exam.\"]\n+        \"intro\": [\n+          \"Before you take the HTML prep exam, you first need to review the concepts taught in the previous modules.\",\n+          \"Open up this page to review concepts around the basics of HTML elements, semantic HTML, tables, forms and accessibility.\"\n+        ]\n       },\n       \"qpra\": { \"title\": \"30\", \"intro\": [] },\n       \"joim\": { \"title\": \"31\", \"intro\": [] },"
        },
        {
            "sha": "5c2d6b973417a9042ce5b52cc17d29c8096a392a",
            "filename": "curriculum/challenges/english/25-front-end-development/review-html/671a883163d5ab5d47145880.md",
            "status": "modified",
            "additions": 150,
            "deletions": 1,
            "changes": 151,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/420e6f03bea62228a090ceaa450cbd8820c6547b/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-html%2F671a883163d5ab5d47145880.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/420e6f03bea62228a090ceaa450cbd8820c6547b/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-html%2F671a883163d5ab5d47145880.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-html%2F671a883163d5ab5d47145880.md?ref=420e6f03bea62228a090ceaa450cbd8820c6547b",
            "patch": "@@ -7,9 +7,158 @@ dashedName: review-html\n \n # --description--\n \n-Review the concepts below to prepare for the upcoming exam.\n+Review the concepts below to prepare for the upcoming prep exam.\n \n+## HTML Basics\n \n+- **Role of HTML**: HTML represents the content and structure of a webpage.\n+- **Block-level vs. inline elements**: The `div` element is a block-level element used for grouping content, while the `span` element is an inline element used for styling text.\n+- **Attributes**: Adding metadata and behavior to elements.\n+\n+## Identifiers and Grouping\n+\n+- **IDs**: Unique element identifiers.\n+- **Classes**: Grouping elements for styling and behavior.\n+\n+## Special Characters and Linking\n+\n+- **HTML entities**: Using special characters like `&amp;` and `&lt;`.\n+- **`<link>` element**: Linking to external stylesheets.\n+- **`<script>` element**: Embedding external JavaScript files.\n+\n+## Boilerplate and Encoding\n+\n+- **HTML boilerplate**: This boilerplate includes the `<!DOCTYPE html>`, `<html>`, `<head>`, and `<body>` elements. It should be used as the starting point for an HTML document.\n+- **UTF-8 character encoding**: Ensuring universal character display.\n+\n+## SEO and Social Sharing\n+\n+- **Meta tags (`description`)**: Describing page content.\n+- **Open Graph tags**: Enhancing social media sharing.\n+\n+## Media Elements and Optimization\n+\n+- **Replaced elements**: Embedded content (e.g., images, iframes).\n+- **Optimizing media**: Techniques to improve media performance.\n+- **Image formats and licenses**: Understanding usage rights and types.\n+- **SVGs**: Scalable vector graphics for sharp visuals.\n+\n+## Multimedia Integration\n+\n+- **HTML audio and video elements**: The `audio` element is used to embed audio content in a webpage, while the `video` element is used to embed video content.\n+- **Embedding with `<iframe>`**: If you want to embed content from another site, like YouTube, you can use the `iframe` element.\n+\n+## Paths and Link Behavior\n+\n+- **Target attribute types**: Controlling link behavior.\n+- **Absolute vs. relative paths**: Navigating directories.\n+- **Path syntax**: Understanding `/`, `./`, `../` for file navigation.\n+- **Link states**: Managing different link interactions (hover, active).\n+- **Inline vs. block-level links**: Links by default are inline elements. You can turn a link into a block-level link by placing it inside a block-level element like a paragraph element.\n+\n+## Importance of Semantic HTML\n+\n+- **Structural hierarchy for heading elements**: It is important to use the correct heading element to maintain the structural hierarchy of the content. The `h1` element is the highest level of heading and the `h6` element is the lowest level of heading.\n+- **Presentational HTML elements**: Elements that define the appearance of content. Ex. the deprecated `center`, `big` and `font` elements.\n+- **Semantic HTML elements**: Elements that hold meaning and structure. Ex. `header`, `nav`, `figure`.\n+\n+## Semantic HTML Elements\n+\n+- **Emphasis (`em`) element**: marks text that has stress emphasis.\n+- **Idiomatic Text (`i`) element**: used for highlighting alternative voice or mood, idiomatic terms from another language, technical terms, and thoughts.\n+- **Strong Importance (`strong`) element**: marks text that has strong importance.\n+- **Bring Attention To (`b`) element**: used to bring attention to text that is not important for the meaning of the content.\n+- **Description List (`dl`) element**: used to represent a list of term-description groupings.\n+- **Description Term (`dt`) element**: used to represent the term being defined.\n+- **Description Details (`dd`) element**: used to represent the description of the term.\n+- **Block Quotation (`blockquote`) element**: used to represent a section that is quoted from another source.\n+- **Inline Quotation (`q`) element**: used to represent a short inline quotation.\n+- **Abbreviation (`abbr`) element**: used to represent an abbreviation or acronym.\n+- **Contact Address (`address`) element**: used to represent the contact information. \n+- **(Date) Time (`time`) element**: used to represent a date and/or time.\n+- **Superscript (`sup`) element**: used to represent superscript text.\n+- **Subscript (`sub`) element**: used to represent subscript text.\n+- **Inline Code (`code`) element**: used to represent a fragment of computer code.\n+- **Unarticulated Annotation (`u`) element**: used to represent a span of inline text which should be rendered in a way that indicates that it has a non-textual annotation.\n+- **Ruby Annotation (`ruby`) element**: used to represent the text of a ruby annotation.\n+- **Strikethrough (`s`) element**: used to represent content that is no longer accurate or relevant.\n+\n+## HTML form elements and attributes\n+\n+- **`form` element**: used to create an HTML form for user input.\n+- **`action` attribute**: used to specify the URL where the form data should be sent.\n+- **`input` element**: used to create an input field for user input.\n+- **`type` attribute**: used to specify the type of input field. Ex. text, password, email, etc.\n+- **`label` element**: used to create a label for an input field.\n+- **`for` attribute**: used to specify which input field the label is for.\n+- **Implicit form association**: inputs can be associated with labels by wrapping the input field inside the `label` element.\n+- **Explicit form association**: inputs can be associated with labels by using the `for` attribute on the `label` element.\n+- **`placeholder` attribute**: used to specify a short hint that describes the expected value of an input field.\n+- **`button` element**: used to create a clickable button. Ex. submit, reset, button.\n+- **`value` attribute**: used to specify the value of the button.\n+- **`required` attribute**: used to specify that an input field must be filled out before submitting the form.\n+- **`size` attribute**: used to specify the width of an input field.\n+- **`minlength` attribute**: used to specify the minimum number of characters required in an input field.\n+- **`maxlength` attribute**: used to specify the maximum number of characters allowed in an input field.\n+- **`disabled` attribute**: used to specify that an input field should be disabled.\n+- **`readonly` attribute**: used to specify that an input field is read-only.\n+- **Focused state**: this is the state of an input field when it is selected by the user.\n+\n+## HTML Table elements and attributes\n+\n+- **Table element**: used to create an HTML table.\n+- **Table Head (`thead`) element**: used to group the header content in an HTML table.\n+- **Table Row (`tr`) element**: used to create a row in an HTML table.\n+- **Table Header (`th`) element**: used to create a header cell in an HTML table.\n+- **`colspan` attribute**: used to specify the number of columns a header cell should span.\n+- **Table body (`tbody`) element**: used to group the body content in an HTML table.\n+- **Table Data Cell (`td`) element**: used to create a data cell in an HTML table.\n+- **Table Foot (`tfoot`) element**: used to group the footer content in an HTML table.\n+\n+## HTML Tools\n+\n+- **HTML validator**: a tool that checks the syntax of HTML code to ensure it is valid.\n+- **DOM inspector**: a tool that allows you to inspect and modify the HTML structure of a web page.\n+- **Devtools**: a set of web developer tools built directly into the browser that helps you debug, profile, and analyze web pages.\n+\n+## Introduction to Accessibility\n+\n+- **Web Content Accessibility Guidelines**: The Web Content Accessibility Guidelines (WCAG) are a set of guidelines for making web content more accessible to people with disabilities. The four principles of WCAG are POUR which stands for Perceivable, Operable, Understandable, and Robust.\n+\n+## Assistive Technology for Accessibility\n+\n+- **Screen readers**: software programs that read the content of a computer screen out loud. They are used by people who are blind or visually impaired to access the web.\n+- **Large text or braille keyboards**: used by people with visual impairments to access the web.\n+- **Screen magnifiers**: software programs that enlarge the content of a computer screen. They are used by people with low vision to access the web.\n+- **Alternative pointing devices**: used by people with mobility impairments to access the web. This includes devices such as joysticks, trackballs, and touchpads.\n+- **Voice recognition**: used by people with mobility impairments to access the web. It allows users to control a computer using their voice.\n+\n+## Accessibility Auditing Tools\n+\n+- **Common Accessibility Tools**: Google Lighthouse, Wave, IBM Equal Accessibility Checker, and axe DevTools are some of the common accessibility tools used to audit the accessibility of a website.\n+\n+## Accessibility Best Practices\n+\n+- **Proper heading level structure**: You should use proper heading levels to create a logical structure for your content. This helps screen readers and other assistive technologies understand the content of your website.\n+- **Accessibility and Tables**: When using tables, you should use the `<th>` element to define header cells and the `<td>` element to define data cells. This helps screen readers and other assistive technologies understand the structure of the table.\n+- **Importance for inputs to have an associated label**: You should use the `<label>` element to associate labels with form inputs. This helps screen readers and other assistive technologies understand the purpose of the input.\n+- **Importance of good `alt` text**: You should use the `alt` attribute to provide a text alternative for images. This helps screen readers and other assistive technologies understand the content of the image.\n+- **Importance of good link text**: You should use descriptive link text to help users understand the purpose of the link. This helps screen readers and other assistive technologies understand the content of the link.\n+- **Best practices for making audio and video content accessible**: You should provide captions and transcripts for audio and video content to make it accessible to people with hearing impairments. You should also provide audio descriptions for video content to make it accessible to people with visual impairments.\n+- **`tabindex` attribute**: used to make elements focusable and define the relative order in which they should be navigated using the keyboard. It important to never use the `tabindex` attribute with a value greater than 0. Instead, you should either use a value of 0 or -1. For more information, review the prior lecture video on keyboard accessibility.\n+- **`accesskey` attribute**: used to define a keyboard shortcut for an element. This can help users with mobility impairments navigate the website more easily.\n+\n+## WAI-ARIA, Roles, and Attributes\n+\n+- **WAI-ARIA**: a set of attributes that can be added to HTML elements to improve accessibility. It provides additional information to assistive technologies about the purpose and structure of the content.\n+- **Aria roles**: a set of predefined roles that can be added to HTML elements to define their purpose. This helps screen readers and other assistive technologies understand the content of the website. Examples include `role=\"tab\"`, `role=\"menu\"`, and `role=\"alert\"`.\n+- **`aria-label` and `aria-labelledby` attributes**: These attributes are used to give an element a programmatic (or accessible) name, which helps people using assistive technology (such as screen readers) understand the purpose of the element. They are often used when the visual label for an element is an image or symbol rather than text. `aria-label` allows you to define the name directly in the attribute while `aria-labelledby` allows you to reference existing text on the page.\n+- **`aria-hidden` attribute**: Used to hide an element from assistive technology such as screen readers. For example, this can be used to hide decorative images that do not provide any meaningful content.\n+- **`aria-expanded` attribute**: used to convey the state of a toggle (or disclosure) feature to screen reader users.\n+- **`aria-live` attribute**: used to indicate that an element's content is important enough to require that any changes to the content should be announced immediately to screen reader users. This can include status messages like updating the number of results returned from a search, or an error message displayed after an unsuccessful form submission.\n+- **Common Aria states**: Common Aria states include `aria-haspopup`, `aria-checked`, `aria-disabled`, and `aria-selected`. These attributes can be used to indicate the state of an element and help screen readers and other assistive technologies understand the content of the website.\n+- **`aria-controls` attribute**: used to associate an element with another element that it controls. This helps screen readers and other assistive technologies understand the relationship between the elements.\n+- **`aria-describedby` attribute**: used to associate an element with another element that describes it. This helps screen readers and other assistive technologies understand the purpose of the element.\n \n # --assignment--\n "
        }
    ],
    "stats": {
        "total": 156,
        "additions": 154,
        "deletions": 2
    }
}