{
    "author": "Dario-DC",
    "message": "chore(curriculum): add transcripts to working with file systems lecture (#58260)\n\nCo-authored-by: Zaira <33151350+zairahira@users.noreply.github.com>",
    "sha": "42b6cc642f319d331868b7c3728b7208852e918e",
    "files": [
        {
            "sha": "ccbb2240dc5b3a7b516d0f92862a59732faa3ab9",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-working-with-file-systems/672aa58c389eb9565978495d.md",
            "status": "modified",
            "additions": 26,
            "deletions": 0,
            "changes": 26,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/42b6cc642f319d331868b7c3728b7208852e918e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672aa58c389eb9565978495d.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/42b6cc642f319d331868b7c3728b7208852e918e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672aa58c389eb9565978495d.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672aa58c389eb9565978495d.md?ref=42b6cc642f319d331868b7c3728b7208852e918e",
            "patch": "@@ -10,6 +10,32 @@ dashedName: how-can-you-use-file-management-applications-on-your-computer\n \n Watch the video lecture and answer the questions below.\n \n+# --transcript--\n+\n+How to use file management applications?\n+\n+A file management application is a way to easily store, organize, and edit your files on your computer. Whether you use a Mac or Windows computer, there are built-in applications you can use to organize your files.\n+\n+If you have a Windows computer, the default file manager is the File Explorer. This is used to browse, search, and manage files and folders, as well as perform file operations like copying, moving, and deleting.\n+\n+To find the File Explorer, you can go to the Start menu or press the Windows logo key on your keyboard.\n+\n+To pin a folder, you can right click with your mouse and select \"Pin\". To move a file or folder, you first need to select it, then select \"Cut\" and then navigate to the new location to paste it.\n+\n+If you have a Mac computer, the default file manager is the Finder. This provides access to local and remote files, supports file previews, and offers a variety of organizational features like tags and Smart Folders.\n+\n+To access the Finder on your Mac, go to the Dock at the bottom and click on the Finder icon.\n+\n+You will notice a sidebar on the left-hand side where your favorite folders are located.\n+\n+One way to organize your files, is to use tags. To tag a file or folder, you can select the item in the Finder and then right click with your mouse. You will see the \"Tags...\" option in the dropdown and you can apply a custom colored tag.\n+\n+To search for tagged items, you can scroll to the bottom of the sidebar and click on the corresponding colored tag, or you can search for the tag by color name in the search field.\n+\n+Another way to organize your files is to use smart folders. Smart folders are collections of files that are automatically organized based on criteria you set, such as file type, date, or keywords.\n+\n+Whether you're using File Explorer on Windows or Finder on Mac, these applications provide flexibility to manage your files with features like tags, search, and Smart Folders.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "33ad391c52c26889342016dfbaebf566654327e0",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-working-with-file-systems/672ac37104dc2530a769e6a4.md",
            "status": "modified",
            "additions": 52,
            "deletions": 0,
            "changes": 52,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/42b6cc642f319d331868b7c3728b7208852e918e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672ac37104dc2530a769e6a4.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/42b6cc642f319d331868b7c3728b7208852e918e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672ac37104dc2530a769e6a4.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672ac37104dc2530a769e6a4.md?ref=42b6cc642f319d331868b7c3728b7208852e918e",
            "patch": "@@ -10,6 +10,58 @@ dashedName: what-are-best-practices-for-naming-files-for-web-applications\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are best practices for naming files for web applications?\n+\n+As you start to build out your own web applications, you will need to be mindful of what you name your files.\n+\n+You will want to name your files in a way that is easy to understand and maintain.\n+\n+Let's take a look at some examples of good and bad file names for HTML files. Note that the `.html` extension in these examples tells us that this is an HTML file.\n+\n+Here is an example of a bad file name: \n+\n+```md\n+index1234.html\n+```\n+\n+By the name alone, it is not clear what the file is about. This file could be for a products page, blog page, or any other type of page but we don't know that from the file name.\n+\n+Here is an example of a better file name for an HTML file:\n+\n+```md\n+about-us.html\n+```\n+\n+By using a more descriptive name like `about-us.html`, it is clear what the file is about.\n+\n+You will also notice in this file name that there are no spaces. Instead, you use a hyphen, `-`, to separate the words. \n+\n+Sometimes you might see a file name called `index.html`. This is a special file name that is used to represent the main page of a website. When you visit a website, the `index.html` file is the first file that is loaded.\n+\n+Another important consideration when naming files is the use of special characters.\n+\n+Using a mixture of special characters, numbers, and letters can make it difficult to understand what the file is about.\n+\n+Here is an example of a bad file name:\n+\n+```md\n+file-1!@.html\n+```\n+\n+This name looks unnecessarily complicated and does not give us any information about what the file is about.\n+\n+So it is best to stick with only using letters and dashes in your file names.\n+\n+As you start to learn more languages, you will see that there are common conventions for naming files in those languages as well. \n+\n+In these situations, it is always best to consult with official documentation or other resources to understand the best practices for naming files in that language.\n+\n+Also you will be in situations where you are working on a team and you will need to follow the conventions that the team has established for naming files. \n+\n+Always consult with the team's style guide to make sure your file names are consistent with the rest of the team.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "d91851322716797c6fd986e8c294f115a3587971",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-working-with-file-systems/672ac39a22b0cc30eb8fd65e.md",
            "status": "modified",
            "additions": 48,
            "deletions": 0,
            "changes": 48,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/42b6cc642f319d331868b7c3728b7208852e918e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672ac39a22b0cc30eb8fd65e.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/42b6cc642f319d331868b7c3728b7208852e918e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672ac39a22b0cc30eb8fd65e.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672ac39a22b0cc30eb8fd65e.md?ref=42b6cc642f319d331868b7c3728b7208852e918e",
            "patch": "@@ -10,6 +10,54 @@ dashedName: what-are-best-practices-for-file-folder-organization-in-web-applicat\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are best practices for file and folder organization in web applications?\n+\n+When building out web applications, it is important to think about the organization of your files and folders. This will help keep your code organized and easier to maintain.\n+\n+Let's take a look at an example folder structure for an HTML and CSS project:\n+\n+```bash\n+.\n+├── /assets\n+│   ├── /images\n+│   │   ├── logo.png\n+│   │   ├── banner.jpg\n+│   │   └── icons.svg\n+│   ├── /fonts\n+│   │   ├── custom-font.woff\n+│   │   └── custom-font.woff2\n+├── /css\n+│   ├── main.css\n+│   ├── about.css\n+│   └── contact.css\n+├── index.html\n+├── about.html\n+├── contact.html\n+└── README.md\n+```\n+\n+At the top of the example, there is a single dot, which represents the root directory.\n+\n+The root directory is the top-level directory in a file system, serving as the starting point for all file paths and containing all other directories and files. A directory is another name for a folder.\n+\n+Inside the root directory, the first directory shown is the `assets` directory. The term `assets` refers to any files that are used in the project, such as images, fonts, or other resources.\n+\n+In this example, there are two directories inside the `assets` directory called `images` and `fonts`.\n+\n+The next directory would be the `css` directory. Sometimes this is also referred to as a stylesheets directory. This is where you would store all of your CSS files.\n+\n+Below the `css` directory are the HTML files. The `index.html` file represents the homepage, while `about.html` and `contact.html` represent the About and Contact pages, respectively.\n+\n+Lastly, there is a `README.md` file. `README` files are commonly used to provide useful information about the project, such as what it does, how to use it, and any other relevant details.\n+\n+The `.md` extension stands for Markdown, which is a lightweight markup language that is often used to write documentation.\n+\n+By organizing your project into assets, CSS, and HTML files, it makes it easy to find what you are looking for. This also makes it easy for other developers to contribute to your project.\n+\n+It is important to note that this is just one example of how you can organize your files and folders. There are many different ways to structure a project.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "df52cdfe1f2bfed558aeb0d9a288c5c39be9bf44",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-working-with-file-systems/672ac3c5d0e9fd31835ff772.md",
            "status": "modified",
            "additions": 68,
            "deletions": 0,
            "changes": 68,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/42b6cc642f319d331868b7c3728b7208852e918e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672ac3c5d0e9fd31835ff772.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/42b6cc642f319d331868b7c3728b7208852e918e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672ac3c5d0e9fd31835ff772.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672ac3c5d0e9fd31835ff772.md?ref=42b6cc642f319d331868b7c3728b7208852e918e",
            "patch": "@@ -10,6 +10,74 @@ dashedName: how-to-create-move-and-delete-files-and-folders-using-explorer-finde\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+How to create, move, and delete files and folders using the Explorer or Finder?\n+\n+To create a file on Windows using the Explorer, you can click on the \"New\" option at the top right. This will show you a list of the different types of files that you can create. \n+\n+You can also create files in their corresponding applications. Let's create a text file to show you the process.\n+\n+When you click on \"New\" and select the file type, you will see a new text file in your current folder with a default name. You can rename it if you'd like.\n+\n+The process of creating folders is exactly the same. Click the \"New\" button at the top right and then select the \"Folder\" option or right-click on an empty spot and go to \"New.\" Then, select the \"Folder\" option. You'll see a new empty folder in your current location.\n+\n+You can rename files and folders by selecting them and clicking on the \"Rename\" option at the top. When current name of the file is highlighted, you can start writing the new name of the file. Press Enter to confirm the changes.\n+\n+Alternatively, you can right-click on the file or folder and select the \"Rename\" option or use the F2 keyboard shortcut. Write the new name and press Enter to confirm the changes. \n+\n+You can move a file or folder to another folder by dragging and dropping it into the destination folder, if you have it opened it as a tab. \n+\n+You can also select the file or folder and select the \"Cut\" option at the top.\n+\n+Then, go to the destination folder and paste it by clicking the \"Paste\" button at the top. If you copied or cut the file previously, this button will be enabled.\n+\n+You can also do this by right-clicking on an empty spot and then clicking on the paste icon. This will remove the file or folder from its original location.\n+\n+To delete a file or folder, click on it and then click on the Trash icon at the top. You will also find a \"Delete\" option if you right-click on it.\n+\n+Great. Now let's see how you can do this on macOS using Finder. \n+\n+Finder is the default file manager on macOS.\n+\n+To create a file on macOS, you need to open an application that lets you create the type of document that you need to create. Currently, there isn't a built-in way to create a file directly on Finder.\n+\n+For example, to create a simple plain text file, you can open TextEdit and save your file. The process works exactly the same for any type of file.\n+\n+There are many ways to open TextEdit. One of them is to go to Launchpad. Then, search for an app where you can create the type of file that you're interested in. In this case, that would be \"TextEdit.\" Click on the icon to open the app.\n+\n+Once you are inside the app, you should see an option to save your file in the App menu. This menu is located at the top-right, next to the Apple menu icon.\n+\n+In one of the App menu options, you should see a command to save the file. This is usually under the File menu.\n+\n+Next to it, you will see the keyboard shortcut for saving your file. This is usually `Command + S` on macOS.\n+\n+When you are saving the file for the first time, you should see a dialog window, where you can write the name of the file and choose a location.\n+\n+Usually, the file extension is added by the application automatically but you can change it before saving the file.\n+\n+After saving the file, you can open Finder by clicking on the Finder icon in the Dock. You should see your new file in the folder where you saved it.\n+\n+To create a new folder, you should go to the location where you want to create that new folder and rick-click on an empty spot. You will see a list of options. The first option is \"New Folder.\"\n+\n+If you click on it, you can assign a name to your new folder. Write the name and press Enter to confirm.\n+\n+There are multiple ways to move files and folders in Finder. If you need to move them to a folder listed in your Finder \"Favorites\" section, you can just drag and drop it.\n+\n+If you need to move it to a different folder, you have two options. \n+\n+You can either open the destination folder as a tab and drag and drop the file or folder into the tab.\n+\n+Or you can use keyboard shortcuts. First, copy the file with `Command + C`, go to the new folder, and then use `Command + Option + V` to paste the file or folder in that location. This will also remove it from the original folder.\n+\n+To delete a file or folder, you can right-click on it and select \"Move to trash.\"\n+\n+You can also drag and drop them into the trash icon on the Dock. This is equivalent.\n+\n+When the file or folder is in the trash can, you can right-click on it to delete it immediately or you can empty the trash to remove all the deleted files and folders permanently.\n+\n+Knowing how to create, move, and delete files and folders on Windows and macOS is very important. By mastering these skills, you can organize your files, locate them quickly, and free up storage on your computer by deleting unnecessary files.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "effaff66d21fb5a572b15ba43d7402f9b7bcbc79",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-working-with-file-systems/672ac3f129efbf327742eb33.md",
            "status": "modified",
            "additions": 36,
            "deletions": 0,
            "changes": 36,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/42b6cc642f319d331868b7c3728b7208852e918e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672ac3f129efbf327742eb33.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/42b6cc642f319d331868b7c3728b7208852e918e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672ac3f129efbf327742eb33.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672ac3f129efbf327742eb33.md?ref=42b6cc642f319d331868b7c3728b7208852e918e",
            "patch": "@@ -10,6 +10,42 @@ dashedName: how-to-search-for-files-and-folders-on-your-computer\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+How to search for files and folder on your computer?\n+\n+Let's learn how to search for files and folders on Windows and macOS.\n+\n+We'll start with Windows. You can search from the Taskbar or from the File Explorer.\n+\n+To search from the Taskbar, write the name of the file or folder that you are looking for. You can also search for keywords. You'll see results from across your PC and OneDrive.\n+\n+If you only want to see documents, you can click on the \"Documents\" tab. You also have tabs for apps and web results.\n+\n+Another alternative is to use the Search File Explorer. You will find it at the top right of the Explorer window, where you can see \"Search Documents.\"\n+\n+You have three options to define the scope of the search:\n+\n+- You can search from Home to find files from your PC and from the cloud quickly.\n+\n+- You can search from a folder to find files stored inside it.\n+\n+- You can search from This PC for a slow but in-depth search.\n+\n+This is how you can search for files and folders on Windows. Now let's see how you can do this on macOS.\n+\n+First, you can use Spotlight, a tool that helps you find files on your Mac. To open Spotlight, go to your menu bar at the top right and find the magnifying glass icon. If you don't see this icon on the menu bar, you can add it in the Control Center settings.\n+\n+Go to your settings, filter by \"Control Center\", click on this option and then scroll down until you find the \"Spotlight\" option. You can also use a keyboard shortcut to open Spotlight: `Command + Spacebar`.\n+\n+When you open Spotlight, you'll see the Spotlight Search, where you can search for any file or folder by typing its name. When you start typing, you'll see the results grouped by category, including suggestions, folders, presentations, photos, documents, and related searches.\n+\n+You can also expand a specific category by clicking on \"Show More.\"\n+\n+Another way to search for files that you have recently opened is to open Finder by click on the Finder icon in the Dock. Then, go to \"Recents\" in the Finder sidebar. And there, you'll find all the files that you've recently viewed.\n+\n+This is how you can search for files and folders on macOS. With these search tools, you can optimize your workflow and find the files and folders you need very quickly.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "aac766ae8508b44e96fd503ef7948db53bcd7e23",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-working-with-file-systems/672ac403a9ba7732b31c6480.md",
            "status": "modified",
            "additions": 56,
            "deletions": 0,
            "changes": 56,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/42b6cc642f319d331868b7c3728b7208852e918e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672ac403a9ba7732b31c6480.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/42b6cc642f319d331868b7c3728b7208852e918e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672ac403a9ba7732b31c6480.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-file-systems%2F672ac403a9ba7732b31c6480.md?ref=42b6cc642f319d331868b7c3728b7208852e918e",
            "patch": "@@ -10,6 +10,62 @@ dashedName: what-are-some-common-file-types-you-will-work-with-in-web-applicatio\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are some common file types used in web applications?\n+\n+Files are classified based on their content and structure. The file type determines how a file is opened and processed by computer programs.\n+\n+We identify file types based on their extensions. A file extension is a three or four letter suffix at the end of the file name. The three main file types that you will find in web applications are HTML, CSS, and JavaScript.\n+\n+HTML files contain the structure and content of the web application. They have a `.html` file extension.\n+\n+CSS files define the styles. They have a `.css` file extension.\n+\n+And JavaScript files add more advanced functionality and interactivity. They have a `.js` file extension.\n+\n+As you develop web applications, you will also need to include images. These are some of the most widely used image file types.\n+\n+JPEG, which stands for \"Joint Photographic Experts Group,\" is known for its efficient compression. It's great for photographs and images. However, the compression is lossy, which means that some image quality is lost to reduce the file size.\n+\n+PNG, which stands for \"Portable Network Graphics,\" preserves image quality, even after compression. This results in larger files. PNG supports transparency and it's great for images with sharp edges, like logos and icons.\n+\n+The GIF image format supports both animation and transparency but has a limited color palette. GIF stands for \"Graphics Interchange Format.\"\n+\n+And finally, we have SVG, which stands for \"Scalable Vector Graphics.\" It's a vector image format. These images can be scaled as much as needed without losing quality.\n+\n+Great. Now that you know about image formats, let's see some video and audio formats.\n+\n+MP3 is an audio format known for its efficient compression. It's a lossy format, so some audio data is lost during the compression to make these files smaller.\n+\n+MP4 is one of the most common video formats. It offers good compression and supports multiple audio and video codecs, subtitles, and metadata.\n+\n+MOV, the QuickTime multimedia file format developed by Apple, is primarily associated with QuickTime Player.\n+\n+Other popular audio and video file types are WAV, a lossless audio format that keeps the original quality of the audio, and WebM, a high-quality open-source video format.\n+\n+If you ever need to customize the fonts of your web application, you will also work with font formats. These are three of the most widely used ones.\n+\n+TTF, which stands for \"TrueType Font\", is a font format compatible with different operating systems.\n+\n+WOFF is a modern font format, specifically designed for web development purposes. It stands for \"Web Open Font Format\". These files are smaller because they have better compression. They can also store metadata, including licensing information.\n+\n+And WOFF2 is the successor of WOFF with even more efficient compression and performance.\n+\n+You can also create archive files if you need to group multiple folders and files. The most widely used archive format is ZIP. ZIP offers lossless compression, so no data is lost during the process. It's widely supported across operating systems and software applications.\n+\n+And finally, let's talk about documentation. In web applications, you will usually find a file called `README` that contains information about the application, like how to use it, how to install it, its license, and how to contribute.\n+\n+They are usually written in a file format called Markdown. With Markdown, you can create structured documents with headings, subheadings, links, images, lists, and more. Markdown files have a `.md` or `.markdown` extension.\n+\n+Here you can find the `README` file of freeCodeCamp's GitHub repository: https://github.com/freeCodeCamp/freeCodeCamp/blob/main/README.md\n+\n+You can create this detailed structure and format using Markdown.\n+\n+You will definitely read and write many `README` files throughout your career. Learning about these common file types is essential for web development. \n+\n+From the core building blocks of HTML, CSS, and JavaScript to image, video, and audio formats, every file type has an important role in creating interactive web applications.\n+\n # --questions--\n \n ## --text--"
        }
    ],
    "stats": {
        "total": 286,
        "additions": 286,
        "deletions": 0
    }
}