{
    "author": "minjo70",
    "message": "fix(curriculum): removed a misplaced comma (#62660)",
    "sha": "4fc3277aef55cadd95fb29aec259d704309db5b1",
    "files": [
        {
            "sha": "6f7b4466cd63feaba676b944a8c537e24344879c",
            "filename": "curriculum/challenges/english/blocks/lecture-introduction-to-javascript-libraries-and-frameworks/6734e867bbf41cc5b11648c4.md",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/4fc3277aef55cadd95fb29aec259d704309db5b1/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-introduction-to-javascript-libraries-and-frameworks%2F6734e867bbf41cc5b11648c4.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/4fc3277aef55cadd95fb29aec259d704309db5b1/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-introduction-to-javascript-libraries-and-frameworks%2F6734e867bbf41cc5b11648c4.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-introduction-to-javascript-libraries-and-frameworks%2F6734e867bbf41cc5b11648c4.md?ref=4fc3277aef55cadd95fb29aec259d704309db5b1",
            "patch": "@@ -13,7 +13,7 @@ SPAs heavily use JavaScript to manage the application's state and render content\n \n SPAs have some common issues. One significant issue is that screen readers may struggle with dynamically updated content. When content changes without a page reload/refresh, screen readers might not notify these changes, which makes our users unaware of updates on our web app.\n \n-Another challenge with SPAs is with navigation and browser history. Users expect the back and forward buttons to work as they do on traditional websites. This might not work properly in SPAs because technically, the URL of the web app doesn’t change. Since, the URL of the web app doesn’t change, they can’t bookmark any specific page. Refreshing the page might reset the application to its initial state, rather than maintaining the current view.\n+Another challenge with SPAs is with navigation and browser history. Users expect the back and forward buttons to work as they do on traditional websites. This might not work properly in SPAs because technically, the URL of the web app doesn’t change. Since the URL of the web app doesn’t change, they can’t bookmark any specific page. Refreshing the page might reset the application to its initial state, rather than maintaining the current view.\n \n SPAs can pose challenges for SEO optimization. Search engines like Google can have difficulty indexing dynamically loaded content because they may not execute JavaScript properly or may miss content that isn’t included in the initial HTML page. This can lead to pages not being indexed correctly.\n "
        }
    ],
    "stats": {
        "total": 2,
        "additions": 1,
        "deletions": 1
    }
}