{
    "author": "Supravisor",
    "message": "fix(curriculum): update acronym example (#61700)\n\nCo-authored-by: Ilenia M <nethleen@gmail.com>\nCo-authored-by: Copilot <175728472+Copilot@users.noreply.github.com>",
    "sha": "572a58f8cd51324305e78e6dcd88c4005bf9e58e",
    "files": [
        {
            "sha": "05a012659ce360fbd24d3972d0b00134a6b09a5d",
            "filename": "curriculum/challenges/english/blocks/lecture-working-with-text-and-time-semantic-elements/672995d673bd3237200b9e7c.md",
            "status": "modified",
            "additions": 21,
            "deletions": 11,
            "changes": 32,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/572a58f8cd51324305e78e6dcd88c4005bf9e58e/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-text-and-time-semantic-elements%2F672995d673bd3237200b9e7c.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/572a58f8cd51324305e78e6dcd88c4005bf9e58e/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-text-and-time-semantic-elements%2F672995d673bd3237200b9e7c.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-text-and-time-semantic-elements%2F672995d673bd3237200b9e7c.md?ref=572a58f8cd51324305e78e6dcd88c4005bf9e58e",
            "patch": "@@ -1,41 +1,51 @@\n ---\n id: 672995d673bd3237200b9e7c\n-title: How Do You Display Abbreviations and Acronyms in HTML?\n+title: How Do You Display Abbreviations in HTML?\n challengeType: 19\n dashedName: how-do-you-display-abbreviations-and-acronyms-in-html\n ---\n \n # --description--\n \n-An abbreviation is a shortened form of a word. For example, \"Dr\" followed by a period, is an abbreviation for the word \"doctor\".\n+An abbreviation is a shortened form of a word or phrase. For example, \"Dr\" followed by a period, is an abbreviation for the word \"doctor\".\n \n-An acronym is a word formed from the initial letters of a phrase, with each letter representing the first letter of a word in that phrase. HTML is an example of an acronym. It stands for HyperText Markup Language.\n+There are two common forms of abbreviations: acronyms and initialisms.\n \n-By taking the first letters of each word H, T, M, and L, you get the acronym HTML. They are both very helpful for writing more concise text, especially when they are well-known and easy to understand in a given context. \n+An acronym is a word formed from the initial letters of a phrase, with each letter representing the first letter of a word in that phrase.\n \n-If you need to display abbreviations and acronyms in HTML, the abbreviation element is exactly what you're looking for. You should always explain their full meaning when you use them for the first time. Then you can use the abbreviation element to highlight them and provide more details. \n+GUI is an example of an acronym. It stands for Graphical User Interface. By taking the first letters of each word G, U, and I, you get the acronym GUI.\n+\n+An initialism is formed from the initial letters of a phrase, with each letter representing the first letter of a word in that phrase.\n+\n+For example, HTML is an initialism; it stands for HyperText Markup Language and is pronounced by spelling out each letter H, T, M, L.\n+\n+Both acronyms and initialisms are types of abbreviations. The distinction is acronyms are pronounced as words and initialisms are pronounced as individual letters.\n+\n+They are very helpful for writing more concise text, especially when they are well-known and easy to understand in a given context. \n+\n+If you need to display abbreviations such as acronyms or initialisms in HTML, the abbreviation element is exactly what you're looking for. You should always explain their full meaning when you use them for the first time. Then you can use the abbreviation element to highlight them and provide more details. \n \n Here's an example where you can see a paragraph with the sentence `HTML is the foundation of the web`: \n \n ```html\n <p><abbr>HTML</abbr> is the foundation of the web.</p>\n ```\n \n-The acronym HTML is within an abbreviation element. In the browser, you'll see that nothing has really changed. It still looks like normal text. The abbreviation element is providing helpful context behind the scenes, but users will still see the acronym as normal text. \n+The initialism HTML is within an abbreviation element. In the browser, you'll see that nothing has really changed. It still looks like normal text. The abbreviation element is providing helpful context behind the scenes, but users will still see the initialism as normal text. \n \n-If you want to help users understand what this acronym means, you can show its full form with the `title` attribute.\n+If you want to help users understand what this initialism means, you can show its full form with the `title` attribute.\n \n-The `title` attribute is optional, but if you decide to include it, it must be a human readable description of the abbreviation, or acronym.\n+The `title` attribute is optional, but if you decide to include it, it must be a human readable description of the abbreviation, acronym, or initialism.\n \n-Let's take the same example as before, but add the `title` attribute. It will be `HyperText Markup Language`, the expanded form of the acronym:\n+Let's take the same example as before, but add the `title` attribute. It will be `HyperText Markup Language`, the expanded form of the initialism:\n \n ```html\n <p><abbr title=\"HyperText Markup Language\">HTML</abbr> is the foundation of the web.</p>\n ```\n \n-Usually, the style of the abbreviation element will change when you add this attribute. The specific style will depend on the browser. Some browsers may display a dotted underline, while others may convert the contents to small caps, or even assign certain default styles, such as a dotted underline. When the user hovers over the acronym with the mouse, the full form is displayed as a tooltip.\n+Usually, the style of the abbreviation element will change when you add this attribute. The specific style will depend on the browser. Some browsers may display a dotted underline, while others may convert the contents to small caps, or even assign certain default styles, such as a dotted underline. When the user hovers over the abbreviation with the mouse, the full form is displayed as a tooltip.\n \n-While you don't necessarily need to use the abbreviation element for every abbreviation, or acronym on your web page, it's recommended for those that might be unclear and those that might need additional context.\n+While you don't necessarily need to use the abbreviation element for every abbreviation on your web page, it's recommended for those that might be unclear and those that might need additional context.\n \n You should use your best judgment to find the right balance between information and presentation to avoid cluttering the text while being clear and concise.\n "
        }
    ],
    "stats": {
        "total": 32,
        "additions": 21,
        "deletions": 11
    }
}