{
    "author": "jdwilkin4",
    "message": "fix(curriculum): update accessibility review page to include missing concepts from lectures  (#58336)\n\nCo-authored-by: Sem Bauke <sem@freecodecamp.org>\nCo-authored-by: Tom <20648924+moT01@users.noreply.github.com>",
    "sha": "68fd1420149719f798b8175d6d05b324f5f98255",
    "files": [
        {
            "sha": "00db65f0929e956ad6a875c239e0af738ef5c228",
            "filename": "curriculum/challenges/english/25-front-end-development/review-html-accessibility/671a87a39b88245a579c2271.md",
            "status": "modified",
            "additions": 15,
            "deletions": 1,
            "changes": 16,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/68fd1420149719f798b8175d6d05b324f5f98255/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-html-accessibility%2F671a87a39b88245a579c2271.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/68fd1420149719f798b8175d6d05b324f5f98255/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-html-accessibility%2F671a87a39b88245a579c2271.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-html-accessibility%2F671a87a39b88245a579c2271.md?ref=68fd1420149719f798b8175d6d05b324f5f98255",
            "patch": "@@ -28,7 +28,7 @@ Review the concepts below to prepare for the upcoming quiz.\n ## Accessibility Best Practices\n \n - **Proper heading level structure**: You should use proper heading levels to create a logical structure for your content. This helps people using assistive technologies understand the content of your website.\n-- **Accessibility and Tables**: When using tables, you should use the `<th>` element to define header cells and the `<td>` element to define data cells. This helps people using assistive technologies understand the structure of the table.\n+- **Accessibility and Tables**: When using tables, you should use the `<th>` element to define header cells and the `<td>` element to define data cells. This helps people using assistive technologies understand the structure of the table. With the `<caption>` element, you can write the caption (or title) of a table, so users, especially those who use assistive technologies, can quickly understand the table's purpose and content. You should place the `<caption>` element immediately after the opening tag of the `<table> `element. This way, screen readers and other assistive technologies can provide more context by announcing the caption before reading the content.\n - **Importance for inputs to have an associated label**: You should use the `<label>` element to associate labels with form inputs. This helps people using assistive technologies understand the purpose of the input.\n - **Importance of good `alt` text**: You should use the `alt` attribute to provide a text alternative for images. This helps people using assistive technologies understand the content of the image.\n - **Importance of good link text**: You should use descriptive link text to help users understand the purpose of the link. This helps people using assistive technologies understand the purpose of the link.\n@@ -40,11 +40,25 @@ Review the concepts below to prepare for the upcoming quiz.\n \n - **WAI-ARIA**: It stands for Web Accessibility Initiative - Accessible Rich Internet Applications. It is a set of attributes that can be added to HTML elements to improve accessibility. It provides additional information to assistive technologies about the purpose and structure of the content.\n - **Aria roles**: A set of predefined roles that can be added to HTML elements to define their purpose. This helps people using assistive technologies understand the content of the website. Examples include `role=\"tab\"`, `role=\"menu\"`, and `role=\"alert\"`.\n+\n+There are six main categories of ARIA roles:\n+\n+- **Document structure roles**: These roles define the overall structure of the web page. With these roles, assistive technologies can understand the relationships between different sections and help users navigate the content.\n+- **Widget roles**: These roles define the purpose and functionality of interactive elements, like scrollbars.\n+- **Landmark roles**: These roles classify and label the primary sections of a web page. Screen readers use them to provide convenient navigation to important sections of a page.\n+- **Live region roles**: These roles define elements with content that will change dynamically. This way, screen readers and other assistive technologies can announce changes to users with visual disabilities.\n+- **Window roles**: These roles define sub-windows, like pop up modal dialogues. These roles include `alertdialog` and `dialog`. \n+- **Abstract roles**: These roles help organize the document. They're only meant to be used internally by the browser, not by developers, so you should know that they exist but you shouldn't use them on your websites or web applications.\n+\n - **`aria-label` and `aria-labelledby` attributes**: These attributes are used to give an element a programmatic (or accessible) name, which helps people using assistive technology (such as screen readers) understand the purpose of the element. They are often used when the visual label for an element is an image or symbol rather than text. `aria-label` allows you to define the name directly in the attribute while `aria-labelledby` allows you to reference existing text on the page.\n - **`aria-hidden` attribute**: Used to hide an element from people using assistive technology such as screen readers. For example, this can be used to hide decorative images that do not provide any meaningful content.\n - **`aria-expanded` attribute**: Used to convey the state of a toggle (or disclosure) feature to screen reader users.\n - **`aria-live` attribute**: Used to indicate that an element's content is important enough to require that any changes to the content should be announced immediately to screen reader users. This can include status messages like updating the number of results returned from a search, or an error message displayed after an unsuccessful form submission.\n - **Common Aria states**: Common Aria states include `aria-haspopup`, `aria-checked`, `aria-disabled`, and `aria-selected`. These attributes can be used to indicate the state of an element and help people using assistive technologies understand the content of the website.\n+- **`aria-haspopup` attribute**: This state is used to indicate that an interactive element will trigger a pop-up element when activated. You can only use the `aria-haspopup` attribute when the pop-up has one of the following roles: `menu`, `listbox`, `tree`, `grid`, or `dialog`. The value of `aria-haspopup` must be either one of these roles or `true`, which is the same as `menu`.\n+- **`aria-checked` attribute**: This attribute is used to indicate whether an element is in the checked state. It is most commonly used when creating custom checkboxes, radio buttons, switches, and listboxes.\n+- **`aria-disabled` attribute**: This state is used to indicate that an element is disabled only to people using assistive technologies, such as screen readers.\n+- **`aria-selected` attribute**: This state is used to indicate that an element is selected. You can use this state on custom controls like a tabbed interface, a listbox, or a grid.\n - **`aria-controls` attribute**: Used to associate an element with another element that it controls. This helps people using assistive technologies understand the relationship between the elements.\n - **`aria-describedby` attribute**: Used to provide additional information about an element by associating it with another element that contains the information. This gives people using screen readers immediate access to the additional information when they navigate to the element. Common usage would include associating formatting instructions to a text input or an error message to an input after an invalid form submission.\n "
        }
    ],
    "stats": {
        "total": 16,
        "additions": 15,
        "deletions": 1
    }
}