{
    "author": "clarencepenz",
    "message": "feat(curriculum): Add interactive examples  to What Are Booleans, and How Do They Work with Equality and Inequality Operators (#63245)",
    "sha": "691b9c2ee8e7d1d190a3eb14b51a77ea5383200a",
    "files": [
        {
            "sha": "dc527fc06603140a166e179fac8d09f8cbe80166",
            "filename": "curriculum/challenges/english/blocks/lecture-working-with-comparison-and-boolean-operators/673271c7581a27d9dd78f6d6.md",
            "status": "modified",
            "additions": 25,
            "deletions": 1,
            "changes": 26,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/691b9c2ee8e7d1d190a3eb14b51a77ea5383200a/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-comparison-and-boolean-operators%2F673271c7581a27d9dd78f6d6.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/691b9c2ee8e7d1d190a3eb14b51a77ea5383200a/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-comparison-and-boolean-operators%2F673271c7581a27d9dd78f6d6.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-comparison-and-boolean-operators%2F673271c7581a27d9dd78f6d6.md?ref=691b9c2ee8e7d1d190a3eb14b51a77ea5383200a",
            "patch": "@@ -5,20 +5,26 @@ challengeType: 19\n dashedName: what-are-booleans-and-how-do-they-work-with-equality-and-inequality-operators\n ---\n \n-# --description--\n+# --interactive--\n \n In an earlier lesson, you were first introduced to the concept of booleans, but in this lesson, we will dive deeper into how booleans work and how the equality and inequality operators work.\n \n Booleans are a data type with only `true` and `false` values. They're useful because they allow you to do something based on some conditions. Booleans are essential when you want to evaluate whether something should happen or not, like deciding if someone can access a certain feature in your app. Here is an example of setting the value `true` to a variable called `isOldEnoughToDrive`:\n \n+:::interactive_editor\n+\n ```js\n let isOldEnoughToDrive = true;\n \n console.log(isOldEnoughToDrive); // true\n ```\n \n+:::\n+\n You can use this variable inside a conditional like this:\n \n+:::interactive_editor\n+\n ```js\n let isOldEnoughToDrive = true;\n \n@@ -29,36 +35,54 @@ if (isOldEnoughToDrive) {\n }\n ```\n \n+:::\n+\n A conditional helps you make decisions in your code based on a condition. This example uses what is called an `if/else` statement.\n \n If `isOldEnoughToDrive` is `true`, then the sentence `You're old enough to drive` will be logged to the console. Otherwise, if the `isOldEnoughToDrive` is `false`, then the sentence `Sorry, you are not old enough to drive` will be logged to the console. Since the `isOldEnoughToDrive` variable is set to `true`, the first sentence will be logged to the console. You will learn more about `if/else` statements in a future lesson.\n \n To compare two values, you can use either the equality or strict equality operator. The result of the comparison will be a boolean of either `true` or `false`. Here is an example of using the equality operator to compare a string and a number. The equality operator is represented by a double equals sign (`==`).\n \n+:::interactive_editor\n+\n ```js\n console.log(5 == \"5\"); // true\n ```\n \n+:::\n+\n In this example, JavaScript converts the string `\"5\"` into the number `5` and then checks if they are equal. Since both values are now the same, the result is true. The equality operator uses type coercion before checking if each value is equal.\n \n This differs from the strict equality operator, which does not perform type coercion. The strict equality operator will check if the types are the same and if the values are the same. Here is an example using the strict equality operator to compare a number and string. This operator is represented by a triple equals sign (`===`).\n \n+:::interactive_editor\n+\n ```js\n console.log(5 === '5'); // false\n ```\n \n+:::\n+\n The following comparison will be `false`, because a string data type is not the same as a number data type. If you need to check if something is not equal to another value, then you can use the inequality or strict inequality operators. Here is an example of using the inequality operator (`!=`) to compare a number with a string. \n \n+:::interactive_editor\n+\n ```js\n console.log(5 != \"5\"); // false\n ```\n \n+:::\n+\n In this example, the result would be `false` because the inequality operator first converts the string value to a number and then compares the values. Since the values would be the same it will return `false`. If you tried to use the strict inequality operator, then you would get a different result. The strict inequality operator is represented by an exclamation mark followed by two equal signs (`!==`).\n \n+:::interactive_editor\n+\n ```js\n console.log(5 !== \"5\"); // true\n ```\n \n+:::\n+\n The result would be `true` because the strict inequality operator does not perform any type coercion. Since the number `5` is not equal to the string `\"5\"`, then the result is `true`.\n \n It is considered best practice to use strict inequality and equality operators whenever possible, as they do not perform type coercion. Most of the time in professional projects, you will see codebases that usually prefer these two operators over the inequality and equality operators."
        }
    ],
    "stats": {
        "total": 26,
        "additions": 25,
        "deletions": 1
    }
}