{
    "author": "Supravisor",
    "message": "fix(curriculum): remove plural from noun in review page (#59411)",
    "sha": "6bceab357a7eb137e5a3c2a98e1257559227d93f",
    "files": [
        {
            "sha": "121169e2d63eaa99685677d01964c00f596665e0",
            "filename": "curriculum/challenges/english/25-front-end-development/review-css/671a9a0a140c2b9d6a75629f.md",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/6bceab357a7eb137e5a3c2a98e1257559227d93f/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-css%2F671a9a0a140c2b9d6a75629f.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/6bceab357a7eb137e5a3c2a98e1257559227d93f/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-css%2F671a9a0a140c2b9d6a75629f.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-css%2F671a9a0a140c2b9d6a75629f.md?ref=6bceab357a7eb137e5a3c2a98e1257559227d93f",
            "patch": "@@ -369,7 +369,7 @@ Review the concepts below to prepare for the upcoming exam.\n ## Color Contrast Tools\n \n - **WebAIM's Color Contrast Checker**: This online tool allows you to input the foreground and background colors of your design and instantly see if they meet the Web Content Accessibility Guidelines (WCAG) standards. \n-- **TPGi Colour Contrast Analyzer**: This is a free color contrast checker that allows you to check if your websites and apps meet the Web Content Accessibility Guidelines (WCAG) standards. This tools also comes with a Color Blindness Simulator feature which allows you to see what your website or app looks like for people with color vision issues.\n+- **TPGi Colour Contrast Analyzer**: This is a free color contrast checker that allows you to check if your websites and apps meet the Web Content Accessibility Guidelines (WCAG) standards. This tool also comes with a Color Blindness Simulator feature which allows you to see what your website or app looks like for people with color vision issues.\n \n ## Accessibility Tree\n "
        },
        {
            "sha": "98f687d15ff921e653006a2518c2de47d58973aa",
            "filename": "curriculum/challenges/english/25-front-end-development/review-web-performance/6724e18296fa40173cc2437c.md",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/6bceab357a7eb137e5a3c2a98e1257559227d93f/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-web-performance%2F6724e18296fa40173cc2437c.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/6bceab357a7eb137e5a3c2a98e1257559227d93f/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-web-performance%2F6724e18296fa40173cc2437c.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-web-performance%2F6724e18296fa40173cc2437c.md?ref=6bceab357a7eb137e5a3c2a98e1257559227d93f",
            "patch": "@@ -91,7 +91,7 @@ Here are some ways to improve INP:\n \n - **Chrome DevTools**: Chrome DevTools is a built-in tool inside Google Chrome that lets you analyze and debug performance in real-time. DevTools will show loading times, CPU usage, and render delays. It's especially useful for measuring First Contentful Paint, or FCP, is how fast a user sees the first visible content. If your website feels slow, DevTools will help you spot the bottlenecks. \n - **Lighthouse**: This is an automated tool that checks performance, SEO, and accessibility. \n-- **WebPageTest**: This tools lets you test how your site loads from different locations and devices. This tool gives you a detailed breakdown of your site's Speed Index, Total Blocking Time, and other key performance metrics. If you want to know how real users experience your site globally, WebPageTest is the tool for that.\n+- **WebPageTest**: This tool lets you test how your site loads from different locations and devices. This tool gives you a detailed breakdown of your site's Speed Index, Total Blocking Time, and other key performance metrics. If you want to know how real users experience your site globally, WebPageTest is the tool for that.\n - **PageSpeed Insights**: This tool analyzes your website and suggests quick improvements for both mobile and desktop. It will tell you what's slowing your site down and give specific recommendations like optimizing images, removing render-blocking scripts, and reducing server response times. PageSpeed Insights is a fast and easy way to check how Google sees your site's performance.\n - **Real User Monitoring**: RUM tools track actual user behavior, showing how real visitors experience your site. Popular RUM tools include Google Analytics, which tracks page load times and bounce rates, and New Relic or Datadog, which monitor real-time performance issues. If you want data from actual users, RUM tools are essential.\n "
        }
    ],
    "stats": {
        "total": 4,
        "additions": 2,
        "deletions": 2
    }
}