{
    "author": "Supravisor",
    "message": "fix(curriculum): typo in video transcript (#59652)",
    "sha": "6d8922f8bd4f5de45fc958f6721801987fc4d88e",
    "files": [
        {
            "sha": "7f29ad0ed74e763083a4862cbb0cb8dee19163c9",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-semantic-html/672985445d7da807c6b4f406.md",
            "status": "modified",
            "additions": 2,
            "deletions": 2,
            "changes": 4,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/6d8922f8bd4f5de45fc958f6721801987fc4d88e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-semantic-html%2F672985445d7da807c6b4f406.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/6d8922f8bd4f5de45fc958f6721801987fc4d88e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-semantic-html%2F672985445d7da807c6b4f406.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-semantic-html%2F672985445d7da807c6b4f406.md?ref=6d8922f8bd4f5de45fc958f6721801987fc4d88e",
            "patch": "@@ -57,9 +57,9 @@ It may be tempting to use a specific heading element because of its styling, suc\n \n Instead, you should choose the appropriate element for your document structure and use CSS to achieve the styling you'd like.\n \n-Using the right hierarchy is important for accessibility. Assistive technologies, like screen readers, rely on the structure of a web page to determine how to pause and announce that web page to the user. Using an `h3` element after an `h1` might cause a screen reader user to believe they have accidentally skipped over important content, due to the lack of an `h2` element.\n+Using the right hierarchy is important for accessibility. Assistive technologies, like screen readers, rely on the structure of a web page to determine how to parse and announce that web page to the user. Using an `h3` element after an `h1` might cause a screen reader user to believe they have accidentally skipped over important content, due to the lack of an `h2` element.\n \n-Proper structure is also important for SEO. Search engines use automation to pause the content of your web page and determine when and where it should show up in results. If your structure is malformed, search engines may not be able to rank you very well in the relevant search results.\n+Proper structure is also important for SEO. Search engines use automation to parse the content of your web page and determine when and where it should show up in results. If your structure is malformed, search engines may not be able to rank you very well in the relevant search results.\n \n Finally, depending on how incorrect your structure is, your HTML may not even be technically valid. When this happens, the web browser has to effectively guess what you meant to do. And what it guesses might not even be what you want at all. \n "
        }
    ],
    "stats": {
        "total": 4,
        "additions": 2,
        "deletions": 2
    }
}