{
    "author": "Dario-DC",
    "message": "chore(curriculum): replace transcript with video (#57691)",
    "sha": "751320a9cd8498a5dcfa6dba746c72209a8d5ac4",
    "files": [
        {
            "sha": "31b4d3e0b3d4bd54bfbf685202ce9e3a4fae3eb6",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-understanding-form-validation/6733d3ab69e94b7df7ee91b0.md",
            "status": "modified",
            "additions": 3,
            "deletions": 76,
            "changes": 79,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/751320a9cd8498a5dcfa6dba746c72209a8d5ac4/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-form-validation%2F6733d3ab69e94b7df7ee91b0.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/751320a9cd8498a5dcfa6dba746c72209a8d5ac4/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-form-validation%2F6733d3ab69e94b7df7ee91b0.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-form-validation%2F6733d3ab69e94b7df7ee91b0.md?ref=751320a9cd8498a5dcfa6dba746c72209a8d5ac4",
            "patch": "@@ -1,87 +1,14 @@\n ---\n id: 6733d3ab69e94b7df7ee91b0\n title: How Does the Submit Event Work with Forms?\n-challengeType: 19\n-# videoId: nVAaxZ34khk\n+challengeType: 11\n+videoId: EWGb5yFyQs4\n dashedName: how-does-the-submit-event-work-with-forms\n ---\n \n # --description--\n \n-The video for this lecture isn't available yet, one will be available soon. Here is a transcript of the lecture for now:\n-\n-Let’s learn about how the submit event works with HTML forms.\n-\n-First, we need to understand how to submit a form. There are three ways a form can be submitted. \n-\n-The first is when the user clicks a button in the form which has the type attribute set to `submit`. \n-\n-The second is when the user presses the `Enter` key on any editable input field in the form. \n-\n-The third is through a JavaScript call to the `requestSubmit()` or `submit()` methods of the form element.\n-\n-But what happens when a form is submitted? There’s a few things that happen, and the behavior of the form depends on its attributes.\n-\n-The first attribute that we need to look at is the `action` attribute. \n-\n-The `action` attribute should contain either a URL or a relative path for the current domain. This value determines where the form attempts to send data. If you do not set an `action` attribute, the form will send data to the current page’s URL.\n-\n-Here is an example of a form with an action attribute set to a specific URL:\n-\n-```js\n-<form action=\"https://freecodecamp.org\">\n-  <input type=\"number\" id=\"input\" placeholder=\"Enter a number\" name=\"number\" />\n-  <button type=\"submit\">Submit</button>\n-</form>\n-```\n-\n-When this form is submitted, it will send data to freeCodeCamp’s homepage, which probably won’t do anything.\n-\n-Here’s another form, which submits to a relative path:\n-\n-```js\n-<form action=\"/data\">\n-  <input type=\"number\" id=\"input\" placeholder=\"Enter a number\" name=\"number\" />\n-  <button type=\"submit\">Submit</button>\n-</form>\n-```\n-\n-This one submits to the /data path on the current domain. In our case, it would submit to `http://127.0.0.1:5500/data`.\n-\n-The second attribute to control how a submission behaves is the `method` attribute. This attribute accepts a standard HTTP method, such as `“GET”` or `“POST”`, and uses that method when making the request to the action URL.\n-\n-HTTP stands for Hypertext Transfer Protocol and it is used to transfer data over the web. \n-\n-HTTP methods are used to define the actions that can be performed on resources, such as `GET`, `POST`, `PUT`, `DELETE`, and so on. You will more about these methods in future lecture videos.\n-\n-When a method is not set, the form will default to a `“GET”` request. \n-\n-A `GET` request is used to retrieve data from a specified resource without making any changes to it, and the parameters are typically appended to the URL in the form of a query string.\n-\n-The data in the form will be URL encoded as name=value pairs and appended to the action URL as query parameters. Our form then tries to GET the URL `http://127.0.0.1:5500/data?number=3342`, for example.\n-\n-This is great for something like a search form, where your user is querying data. But if you want your user to submit new data, such as in a registration form, the idiomatic method to use would be the `POST` method. The `POST` method is used to send data to the server to create or update a resource.\n-\n-Let’s set the method attribute to the value of `POST`:\n-\n-```js\n-<form action=\"/data\" method=\"POST\">\n-  <input type=\"number\" id=\"input\" placeholder=\"Enter a number\" name=\"number\" />\n-  <button type=\"submit\">Submit</button>\n-</form>\n-```\n-\n-When you send a `POST` request, a body can be included which contains the data for your request. So unlike a `GET`, the data are not appended to the URL, and our form sends the POST request to `http://127.0.0.1:5500/data`. The data, instead, can be found in the body of the request, still as URL-encoded form data.\n-\n-URL-encoded form data is when form data is converted into a string of key-value pairs, like `name=John+Doe&email=john%40example.com`, where special characters are replaced with encoded versions to safely send the data over the web. You will learn more about this in future lecture videos\n-\n-But maybe you don’t want to send the data as a URL-encoded form payload? \n-\n-The form element accepts an `enctype` attribute, which represents the encoding type to use for the data. \n-\n-This attribute only accepts three values: `application/x-www-form-urlencoded` (which is the default, sending the data as a URL-encoded form body), `text/plain` (which sends the data in plaintext form, in name=value pairs separated by new lines), or `mulitpart/form-data`, which is specifically for handling forms with a file upload.\n-\n-In this video, you’ve learned the basics of form submissions. In future videos, we’ll dive deeper into working with forms and how they interact with the server.\n+Watch the lecture video and answer the questions below.\n \n # --questions--\n "
        }
    ],
    "stats": {
        "total": 79,
        "additions": 3,
        "deletions": 76
    }
}