{
    "author": "Supravisor",
    "message": "fix(curriculum): typos in core JS fundamentals lecture (#60151)",
    "sha": "7b3a19f433637efcec706e92ca7c325b21d24422",
    "files": [
        {
            "sha": "cf1cb692e857141764f98931a76734bd9cd94661",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-understanding-core-javascript-fundamentals/6732c6c72d3738614e1230a2.md",
            "status": "modified",
            "additions": 2,
            "deletions": 2,
            "changes": 4,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/7b3a19f433637efcec706e92ca7c325b21d24422/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-core-javascript-fundamentals%2F6732c6c72d3738614e1230a2.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/7b3a19f433637efcec706e92ca7c325b21d24422/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-core-javascript-fundamentals%2F6732c6c72d3738614e1230a2.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-core-javascript-fundamentals%2F6732c6c72d3738614e1230a2.md?ref=7b3a19f433637efcec706e92ca7c325b21d24422",
            "patch": "@@ -14,7 +14,7 @@ Watch the video or read the transcript and answer the questions below.\n \n What are linters and formatters, and how can they help you with code consistency?\n \n-In the world of software development maintaining clean, consistent and error-free code is important. This is where linters and formatters come into play. These tools are essential for developers to ensure code quality and consistency across a projects and teams.\n+In the world of software development maintaining clean, consistent and error-free code is important. This is where linters and formatters come into play. These tools are essential for developers to ensure code quality and consistency across projects and teams.\n \n Let's start with linters. A linter is a static code analysis tool that flags programming errors, bugs, stylistic errors, and suspicious constructs. The term lint comes from a Unix utility that examines C language source code. \n \n@@ -56,7 +56,7 @@ Both linters and formatters can be integrated into your development workflow in\n \n Many development teams set up these tools as part of their project configuration often with pre-commit hooks that run the linter and formatter before allowing code to be committed. This ensures that all code in the repository meets the teams standards for quality and style.\n \n-In summary, linters and formatters are powerful tools that help maintain code quality, catch potential errors early, and ensure consistency across codebases. By automating this aspects of code review they allow developers to focus more on solving problems and less on debating code style.\n+In summary, linters and formatters are powerful tools that help maintain code quality, catch potential errors early, and ensure consistency across codebases. By automating these aspects of code review they allow developers to focus more on solving problems and less on debating code style.\n \n # --questions--\n "
        },
        {
            "sha": "e23e7a78a29fea0a96de30d3d429f92f9cd2c87e",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-understanding-core-javascript-fundamentals/6732c6d4dec34c61850a1276.md",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/7b3a19f433637efcec706e92ca7c325b21d24422/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-core-javascript-fundamentals%2F6732c6d4dec34c61850a1276.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/7b3a19f433637efcec706e92ca7c325b21d24422/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-core-javascript-fundamentals%2F6732c6d4dec34c61850a1276.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-core-javascript-fundamentals%2F6732c6d4dec34c61850a1276.md?ref=7b3a19f433637efcec706e92ca7c325b21d24422",
            "patch": "@@ -16,7 +16,7 @@ What is memory management, and how does it work in JavaScript?\n \n Memory management is an essential concept in programming, but it can be a bit confusing for beginners, let's break it down in simple terms.\n \n-When you run a program, including JavaScript code in a web browser, it needs memory to store all the information its working with. This includes variables, functions, objects, basically everything your code creates and uses. Memory management is the process of controlling this memory, allocating it when needed, and freeing it up when it's no longer needed. In some programming languages, developers have to manually manage memory. They need to explicitly tell the computer when to allocate memory for new things and when to free up memory that's no longer needed. This can be powerful but also tricky as for getting to free memory can lead to memory leaks.\n+When you run a program, including JavaScript code in a web browser, it needs memory to store all the information its working with. This includes variables, functions, objects, basically everything your code creates and uses. Memory management is the process of controlling this memory, allocating it when needed, and freeing it up when it's no longer needed. In some programming languages, developers have to manually manage memory. They need to explicitly tell the computer when to allocate memory for new things and when to free up memory that's no longer needed. This can be powerful but also tricky as forgetting to free memory can lead to memory leaks.\n \n JavaScript however uses automatic memory management. This means that JavaScript (more specifically the JavaScript engine in your web browser) takes care of memory allocation and deallocation for you. You don't have to explicitly free memory in your code. This automatic process is often called garbage collection.\n "
        }
    ],
    "stats": {
        "total": 6,
        "additions": 3,
        "deletions": 3
    }
}