{
    "author": "zairahira",
    "message": "chore(curriculum): add transcript to using DevTools and CSS validator (#58612)\n\nCo-authored-by: Jessica Wilkins <67210629+jdwilkin4@users.noreply.github.com>\r\nCo-authored-by: Dario-DC <105294544+Dario-DC@users.noreply.github.com>",
    "sha": "7eb80ac0d1e0402cf082eaf8a17ac9e9edf054f2",
    "files": [
        {
            "sha": "b32a26a8af7e91ddd28873590c57fab217f0b79e",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-debugging-css/672aa8c1ad423562a38b484d.md",
            "status": "modified",
            "additions": 38,
            "deletions": 0,
            "changes": 38,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/7eb80ac0d1e0402cf082eaf8a17ac9e9edf054f2/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-debugging-css%2F672aa8c1ad423562a38b484d.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/7eb80ac0d1e0402cf082eaf8a17ac9e9edf054f2/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-debugging-css%2F672aa8c1ad423562a38b484d.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-debugging-css%2F672aa8c1ad423562a38b484d.md?ref=7eb80ac0d1e0402cf082eaf8a17ac9e9edf054f2",
            "patch": "@@ -10,6 +10,44 @@ dashedName: how-can-you-use-the-devtools-inspection-tool\n \n Watch the video lecture and answer the questions below.\n \n+# --transcript--\n+\n+How can you use the DevTools inspection tool and CSS validators to debug your CSS?\n+\n+Developer tools, inspection tools, and CSS validators are essential resources for debugging CSS issues and ensuring your stylesheets are error-free and optimized.\n+\n+These tools provide invaluable insights into how your CSS is being applied and can help identify potential problems.\n+\n+Let's start with browser developer tools, commonly known as DevTools. Most modern browsers, including Chrome, Firefox, and Safari, come with built-in DevTools. To access them, you can right-click on an element on your webpage and select \"Inspect\" or use keyboard shortcuts like `F12` or `Cmd+Option+I` (on macOS).\n+\n+DevTools allow you to inspect and modify your CSS in real-time. The Styles pane shows all the CSS rules applied to the selected element, including inherited styles.\n+\n+You can toggle individual properties on and off, edit values, and even add new rules directly in the browser. This immediate feedback is incredibly useful for experimenting with different styles without modifying your source code.\n+\n+The inspection tool, which is part of DevTools, allows you to hover over elements on your page and see their box model, including margins, borders, padding, and content area. This is particularly useful for diagnosing layout issues or understanding why elements are positioned in a certain way.\n+\n+CSS validators are another important tool for debugging. The W3C CSS Validator is a popular choice. It checks your CSS against the official specifications and reports any errors or warnings. To use it, you can either upload your CSS file, input your CSS directly, or provide a URL to validate.\n+\n+For example, let's say you are working with the following CSS:\n+\n+```css\n+.container {\n+  width: 100%;\n+  height: 200px\n+  background-color: #F0F0F0;\n+}\n+```\n+\n+The validator would point out that there's a missing semicolon after the `height` property. This kind of error can be easy to overlook but can cause significant issues in your stylesheet.\n+\n+When debugging responsive designs, the device emulation feature in DevTools is invaluable. It allows you to simulate how your site looks on various screen sizes and devices. This can help you identify breakpoint issues or styles that don't scale well across different viewport sizes.\n+\n+Remember, effective CSS debugging often involves a combination of these tools. You might start by using a validator to catch any syntax errors, then use DevTools to inspect specific elements and experiment with changes. The device emulation tool can then help ensure your styles work across different screen sizes.\n+\n+By mastering these tools, you can significantly speed up your CSS debugging process and create more robust, error-free stylesheets.\n+\n+Regular use of these debugging techniques will not only help you solve immediate issues but also improve your overall understanding of CSS and how it interacts with your HTML.\n+\n # --questions--\n \n ## --text--"
        }
    ],
    "stats": {
        "total": 38,
        "additions": 38,
        "deletions": 0
    }
}