{
    "author": "AyushSharma72",
    "message": "fix(curriculum) : Added missing cute puppy and tropical-resort images (#62926)\n\nCo-authored-by: Ilenia <26656284+ilenia-magoni@users.noreply.github.com>",
    "sha": "808d0d0d7411f64eb24c97604b92ad251e124cf7",
    "files": [
        {
            "sha": "7a976366f4b5bc96276efcc3fb992cc5b776867f",
            "filename": "curriculum/challenges/english/blocks/lecture-accessible-media-elements/672a55b5c0c14493328fe36e.md",
            "status": "modified",
            "additions": 7,
            "deletions": 1,
            "changes": 8,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/808d0d0d7411f64eb24c97604b92ad251e124cf7/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-accessible-media-elements%2F672a55b5c0c14493328fe36e.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/808d0d0d7411f64eb24c97604b92ad251e124cf7/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-accessible-media-elements%2F672a55b5c0c14493328fe36e.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-accessible-media-elements%2F672a55b5c0c14493328fe36e.md?ref=808d0d0d7411f64eb24c97604b92ad251e124cf7",
            "patch": "@@ -13,7 +13,11 @@ It's essential for making websites accessible to people with visual disabilities\n \n Alternative text is also used by search engines to understand images. Some browsers may also display it when an image is not loaded properly. This can happen when the image file is missing or when the user has connectivity issues. So it's helpful for many different purposes.\n \n-A person with a visual disability will not be able to know what's in the image unless it's described in the alt text.  An example of bad alt text for an image of a puppy would be \"A cute puppy.\" This text is not specific enough to convey the important details of the image, like what does the puppy look like? Where is the puppy? Are there any important objects around the puppy?\n+A person with a visual disability will not be able to know what's in the image unless it's described in the alt text. An example of bad alt text for an image of a puppy would be \"A cute puppy.\"\n+\n+<img src=\"https://cdn.freecodecamp.org/curriculum/lecture-transcripts/puppy.png\" alt=\"A cute puppy.\" />\n+\n+This text is not specific enough to convey the important details of the image, like what does the puppy look like? Where is the puppy? Are there any important objects around the puppy?\n \n Let's improve this. An example of good alternative text would be: \"A black and white puppy with an orange collar lies on its belly in the sand, looking off to the side. A bright orange ball rests near its front paws.\"\n \n@@ -27,6 +31,8 @@ It is important to note that there is no one correct way to write alt text for a\n \n Here we have another example of a beautiful tropical resort. Let's describe it.\n \n+<img src=\"https://cdn.freecodecamp.org/curriculum/lecture-transcripts/resort.jpg\" alt=\"Resort.\">\n+\n An example of bad `alt` text for this image would be \"Resort.\"\n \n This is too short and it doesn't provide enough information about the image. To improve this description, you could expand it to include the most important elements of the image:"
        }
    ],
    "stats": {
        "total": 8,
        "additions": 7,
        "deletions": 1
    }
}