{
    "author": "huyenltnguyen",
    "message": "fix(curriculum): wrap keywords in backticks (#57992)",
    "sha": "8af28768393005cfa07aa0fceed454e94cc6230f",
    "files": [
        {
            "sha": "10e1c2d4cfe13c5e5260724e3a7c52e2c5c86ad0",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-working-with-data-in-react/673500b41af8500191febedc.md",
            "status": "modified",
            "additions": 4,
            "deletions": 4,
            "changes": 8,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/8af28768393005cfa07aa0fceed454e94cc6230f/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-data-in-react%2F673500b41af8500191febedc.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/8af28768393005cfa07aa0fceed454e94cc6230f/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-data-in-react%2F673500b41af8500191febedc.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-data-in-react%2F673500b41af8500191febedc.md?ref=8af28768393005cfa07aa0fceed454e94cc6230f",
            "patch": "@@ -25,9 +25,9 @@ function FruitList() {\n }\n ```\n \n-In this example, the `map()` function iterates over each item in the fruits array. For each fruit, it creates a new `<li>` element containing the fruit's name. The newly created array of `<li>` elements is then displayed inside the `<ul>` parent tags. \n+In this example, the `map()` function iterates over each item in the `fruits` array. For each fruit, it creates a new `<li>` element containing the fruit's name. The newly created array of `<li>` elements is then displayed inside the `<ul>` parent tags. \n \n-However, when rendering lists in React, it is important not to forget the key prop to each element in the list. The key must always be unique and it helps React identify which items have changed, been added, or been removed, which is essential for efficient rendering and updating the list. \n+However, when rendering lists in React, it is important not to forget the `key` prop to each element in the list. The key must always be unique and it helps React identify which items have changed, been added, or been removed, which is essential for efficient rendering and updating the list. \n \n Let's modify our example to include keys:\n \n@@ -46,7 +46,7 @@ function FruitList() {\n \n In this refactored example, we are creating a unique key for each list item by concatenating the fruit name with its index. This ensures that each list item has a distinct key, which helps React efficiently manage and update the list when items are added, removed, or reordered.\n \n-React's also allows you to render more complex structures. For instance, you might have an array of objects representing users, each with multiple properties that you want to display:\n+React also allows you to render more complex structures. For instance, you might have an array of objects representing users, each with multiple properties that you want to display:\n \n ```js\n function UserList() {\n@@ -68,7 +68,7 @@ function UserList() {\n }\n ```\n \n-In this example, we're creating a more complex JSX structure for each user, displaying both their name and email. We're using the user's id as the key, which is a good practice.\n+In this example, we're creating a more complex JSX structure for each user, displaying both their name and email. We're using the user's `id` as the key, which is a good practice.\n \n In conclusion, rendering lists in React involves converting arrays of data into JSX elements, typically using the `map()` function. \n "
        }
    ],
    "stats": {
        "total": 8,
        "additions": 4,
        "deletions": 4
    }
}