{
    "author": "sanchitkhthpalia",
    "message": "fix(curriculum): remove class references and align text with code in CSS filter tutorial (#63436)\n\nCo-authored-by: Sanchit Kathpalia <sanchitkhthpalia.com>",
    "sha": "8c466512da44ec69599ce1521efa71cb7e2f6be5",
    "files": [
        {
            "sha": "ad956b3c45d05b3ea694a7d7fcede07b2c44533a",
            "filename": "curriculum/challenges/english/blocks/lecture-working-with-css-transforms-overflow-and-filters/672bccebe1fc82d911c3f078.md",
            "status": "modified",
            "additions": 8,
            "deletions": 8,
            "changes": 16,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/8c466512da44ec69599ce1521efa71cb7e2f6be5/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-css-transforms-overflow-and-filters%2F672bccebe1fc82d911c3f078.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/8c466512da44ec69599ce1521efa71cb7e2f6be5/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-css-transforms-overflow-and-filters%2F672bccebe1fc82d911c3f078.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-css-transforms-overflow-and-filters%2F672bccebe1fc82d911c3f078.md?ref=8c466512da44ec69599ce1521efa71cb7e2f6be5",
            "patch": "@@ -7,7 +7,7 @@ dashedName: what-is-the-css-filter-property\n \n # --interactive--\n \n-The CSS `filter` property is a powerful tool that allows you to apply  graphical effects to elements on a web page. It's particularly useful for adjusting the visual presentation of images, backgrounds and even text without modifying the original asset.\n+The CSS `filter` property is a powerful tool that allows you to apply graphical effects to elements on a web page. It's particularly useful for adjusting the visual presentation of images, backgrounds and even text without modifying the original asset.\n \n The `filter` property can be used to create various effects, such as blurring, color shifting, and contrast adjustments. Let's discuss how the filter property works and explore some common examples. The basic syntax for a `filter` property is straightforward:\n \n@@ -34,7 +34,7 @@ img {\n \n :::\n \n-The `blur` function applies a gaussian blur to the element, the amount is specified in pixels and represents the radius of the blur. This CSS rule will apply a 5 pixel blur to all images on the page. The `blur` effect can be useful for creating depth in your design or for obscuring parts of an image. \n+The `blur` function applies a gaussian blur to the element, the amount is specified in pixels and represents the radius of the blur. This CSS rule will apply a 2 pixel blur to all images on the page. The `blur` effect can be useful for creating depth in your design or for obscuring parts of an image. \n \n The `brightness` function adjusts the brightness of the element. A value of `0%` will make the element completely black, while values over `100%` will increase the brightness. \n \n@@ -53,7 +53,7 @@ img {\n \n :::\n \n-This CSS rule increases the brightness of elements with the class `bright-image` by `50%`. Brightness adjustments can be used to make images pop or create a washed-out effect.\n+This CSS rule increases the brightness of the image element by `50%`. Brightness adjustments can be used to make images pop or create a washed-out effect.\n \n The `grayscale` function converts the element to grayscale. The amount is defined as a percentage, where `100%` is completely grayscale and `0%` leaves the image unchanged.\n \n@@ -72,7 +72,7 @@ img {\n \n :::\n \n-This rule will convert elements with the class `gray-image` to complete grayscale. `grayscale` can be used to create a vintage look or de-emphasize certain elements on a page.\n+This rule will convert the image element to complete grayscale. `grayscale` can be used to create a vintage look or de-emphasize certain elements on a page.\n \n The `sepia` function applies a sepia tone to the element. Like grayscale, it uses a percentage value: \n \n@@ -91,7 +91,7 @@ img {\n \n :::\n \n-This rule applies an `80%` sepia effect to elements with the class `old-photo`. The sepia effect is great for creating a vintage or old-timey look.\n+This rule applies an `80%` sepia effect to the image element. The sepia effect is great for creating a vintage or old-timey look.\n \n The `hue-rotate` function applies the hue rotation to the element. The value is defined in degrees, and represents a rotation around the color circle. \n \n@@ -110,7 +110,7 @@ img {\n \n :::\n \n-This rule rotates the hue of elements with the class `color-shift` by `90` degrees. Hue rotation can be used to create psychedelic effects or to adjust the overall color scheme of an image.\n+This rule rotates the hue of the image element by `90` degrees. Hue rotation can be used to create psychedelic effects or to adjust the overall color scheme of an image.\n \n One of the most powerful aspects of the `filter` property is the ability to combine multiple effects. You can apply several filters to the same element by separating them with spaces: \n \n@@ -129,11 +129,11 @@ img {\n \n :::\n \n-This rule applies increased contrast, slightly increased brightness, and a subtle sepia effect to elements with the class `multi-filter`. \n+This rule applies increased contrast, slightly increased brightness, and a subtle sepia effect to the image element. \n \n By combining filters you can create complex and unique visual effects tailored to your design needs. The CSS filter property is a versatile tool that allows for creative visual manipulation of web elements. \n \n-While we have covered some of the most common filter functions, there are others available, such as `contrast`, `invert`, and `saturate`. As with any powerful feature, it's important to kind of be careful with how you use the filters to enhance your design without overwhelming your users or compromising accessibility.\n+While we have covered some of the most common filter functions, there are others available, such as `contrast`, `invert`, and `saturate`. As with any powerful feature, it's important to be careful with how you use the filters to enhance your design without overwhelming your users or compromising accessibility.\n \n # --questions--\n "
        }
    ],
    "stats": {
        "total": 16,
        "additions": 8,
        "deletions": 8
    }
}