{
    "author": "moT01",
    "message": "feat(curriculum): videos and transcripts for CSS frameworks and preprocessors (#59488)",
    "sha": "90ee92699ada76d3223a65ff82e37fde1f5ee18e",
    "files": [
        {
            "sha": "747252967ecdb481d2cdda997ff3aaf1c9ad1fa8",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-working-with-css-libraries-and-frameworks/67d1d74780981f521b8ac090.md",
            "status": "modified",
            "additions": 72,
            "deletions": 2,
            "changes": 74,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/90ee92699ada76d3223a65ff82e37fde1f5ee18e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-css-libraries-and-frameworks%2F67d1d74780981f521b8ac090.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/90ee92699ada76d3223a65ff82e37fde1f5ee18e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-css-libraries-and-frameworks%2F67d1d74780981f521b8ac090.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-css-libraries-and-frameworks%2F67d1d74780981f521b8ac090.md?ref=90ee92699ada76d3223a65ff82e37fde1f5ee18e",
            "patch": "@@ -2,13 +2,83 @@\n id: 67d1d74780981f521b8ac090\n title: What Is a CSS Framework, and What Are Some Advantages and Disadvantages of Using It?\n challengeType: 11\n-videoId: nVAaxZ34khk\n+videoId: A-z2RMOP9dE\n dashedName: what-is-a-css-framework-and-what-are-some-advantages-and-disadvantages-of-using-it\n ---\n \n # --description--\n \n-Watch the video lecture and answer the questions below.\n+Watch the video or read the transcript and answer the questions below.\n+\n+# --transcript--\n+\n+What is a CSS framework, and what are some advantages and disadvantages to using it?\n+\n+Let's learn about CSS frameworks and why you should use them.\n+\n+As you work CSS, you may experience certain challenges, such as keeping the styles consistent and compatible across browsers, avoiding repetition, and handling the growing complexity and number of CSS files across your project. CSS frameworks are very helpful to prevent these issues from the start.\n+\n+A CSS framework consists of pre-written CSS code that you can use to style your HTML elements.\n+\n+By using a CSS framework, you can speed up your workflow, create a uniform visual style across the website, make your design look consistent across multiple browsers, and overall keep your CSS code more organized.\n+\n+You can think of a CSS framework as toolbox, where you can quickly find a style or component that fits your needs and use it right away, without having to specify it yourself using CSS properties. These frameworks often include pre-defined styles and components that you can use very easily, including styles for creating responsive layouts.\n+\n+Some of the most popular CSS frameworks are Tailwind CSS, Bootstrap, Materialize, and Foundation.\n+\n+Let's talk a little bit about the two types of CSS frameworks: utility-first CSS frameworks, and component-based CSS frameworks.\n+\n+Tailwind CSS is a utility-first CSS framework. This means that it has small classes with very specific purposes, like setting the margin, padding, or background color. You can usually assign these small classes directly to the HTML elements.\n+\n+For example:\n+\n+```html\n+<button class=\"bg-blue-500 text-white font-bold py-2 px-4 rounded-full hover:bg-blue-700\">\n+  Button\n+</button>\n+```\n+\n+This button will have a blue background with white and bold text, a vertical padding of 2 rem, a horizontal padding of 4 rem, and rounded borders. The class `hover:bg-blue-700` will turn the background dark blue when the user hovers over it with the mouse.\n+\n+As you can see, Tailwind CSS classes are very granular, so they can be applied to individual HTML elements as needed.\n+\n+In contrast, Bootstrap is a component-based CSS framework. It has pre-built components with pre-defined styles that you can easily add to your website. These components are usually available in the official documentation of the CSS framework, where you can copy and paste them quickly into your project.\n+\n+For example, if you want to create a list group in Bootstrap, you would write something like this in HTML:\n+\n+```html\n+<div class=\"card\" style=\"width: 25rem;\">\n+  <ul class=\"list-group list-group-flush\">\n+    <li class=\"list-group-item\">HTML</li>\n+    <li class=\"list-group-item\">CSS</li>\n+    <li class=\"list-group-item\">JavaScript</li>\n+  </ul>\n+</div>\n+```\n+\n+These pre-defined classes will automatically apply standard styles to the card, list group, and list group items.\n+\n+Notice that here, instead of adding small and general classes, we are adding the entire component, including the HTML structure. This is why Bootstrap is component-based.\n+\n+```html\n+<div class=\"card\" style=\"width: 25rem;\">\n+  <ul class=\"list-group list-group-flush\">\n+    <li class=\"list-group-item\">HTML</li>\n+    <li class=\"list-group-item\">CSS</li>\n+    <li class=\"list-group-item\">JavaScript</li>\n+  </ul>\n+</div>\n+```\n+\n+While CSS frameworks have many advantages, they also have certain disadvantages. It's important that you know both of them to make an informed decision.\n+\n+Since CSS frameworks rely on pre-defined styles, if you try to add custom CSS on top them, specificity issues may arise. The selectors used by the framework may have a higher specificity than the selectors that you use in your custom CSS, so the correct style may not be displayed. To solve this, you will need to use a more specific CSS selector, so this may bring some additional challenges.\n+\n+They can also limit uniqueness to a certain extent because their standard styles are used widely across many websites. However, this can be addressed by customizing the CSS with your unique styles. \n+\n+And finally, you should consider potential performance issues that CSS frameworks might introduce. Some frameworks are quite large, and may take some time to load.\n+\n+As a developer, you will decide if using a CSS framework is helpful for your project, if using entirely custom CSS is better, or perhaps a mix of both.\n \n # --questions--\n "
        },
        {
            "sha": "31082964211d79250cfc24f20cd938c839349bc2",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-working-with-css-libraries-and-frameworks/67d2fe63c8b0049ad7481021.md",
            "status": "modified",
            "additions": 156,
            "deletions": 3,
            "changes": 159,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/90ee92699ada76d3223a65ff82e37fde1f5ee18e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-css-libraries-and-frameworks%2F67d2fe63c8b0049ad7481021.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/90ee92699ada76d3223a65ff82e37fde1f5ee18e/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-css-libraries-and-frameworks%2F67d2fe63c8b0049ad7481021.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-css-libraries-and-frameworks%2F67d2fe63c8b0049ad7481021.md?ref=90ee92699ada76d3223a65ff82e37fde1f5ee18e",
            "patch": "@@ -2,13 +2,166 @@\n id: 67d2fe63c8b0049ad7481021\n title: What Is the Value of Using a CSS Preprocessor, and What Are Some Disadvantages?\n challengeType: 11\n-videoId: nVAaxZ34khk\n+videoId: qCedKYGOYg4\n dashedName: what-is-the-value-of-using-a-css-preprocessor-and-what-are-some-disadvantages\n ---\n \n # --description--\n \n-Watch the lecture video and answer the questions below.\n+Watch the video or read the transcript and answer the questions below.\n+\n+# --transcript--\n+\n+What is the value of using a CSS preprocessor, and what are some disadvantages?\n+\n+Let's learn about CSS preprocessors.\n+\n+A CSS preprocessor is a tool that extends standard CSS with powerful features like variables, mixins, nesting, and selector inheritance. \n+\n+Some of these features, like variables and nesting, are now supported or are getting more support in native CSS, and this trend is very likely to continue. However, earlier versions of native CSS did not support these features.\n+\n+That is why CSS preprocessors became so widely used in the first place. They take the CSS rules and styles you write, along with their extended syntax, and compile them into a native CSS file that browsers can understand.\n+\n+By using a CSS preprocessor, you can structure your CSS code in a more reusable and logical way. You will also have access to powerful features, like mixins, that are not directly supported by CSS.\n+\n+Some of the most popular CSS preprocessors are Sass, Less, and Stylus.\n+\n+Let's talk about Sass.\n+\n+Sass stands for \"Syntactically Awesome Style Sheets.\" It's compatible with all versions of CSS and maintained by a large community of developers.\n+\n+Sass supports features like:\n+\n+- Variables, so you can store and reuse values throughout the spreadsheet.\n+\n+- Nested CSS rules, so you can create a visual hierarchy in your file.\n+\n+- Modules, so you can split your styles into multiple stylesheets.\n+\n+- Mixins, so you can reuse CSS declarations throughout your site.\n+\n+- Inheritance, so multiple CSS selectors can share properties.\n+\n+- And operators, for basic mathematical operations.\n+\n+Sass also supports two syntaxes.\n+\n+The SCSS syntax stands for Sassy CSS, which is a superset of CSS. This means that SCSS expands the basic syntax of CSS.\n+\n+SCSS is the most common syntax that you'll use and find when working with Sass. It requires the use of curly braces (`{` and `}`) around CSS properties and semicolons (`;`) at the end of CSS declarations, just like native CSS.\n+\n+These files have a `.scss` extension. Here is an example:\n+\n+```scss\n+$primary-color: #3498eb;\n+\n+header {\n+  background-color: $primary-color;\n+}\n+```\n+\n+What you see here, at the top, is a variable defined in SCSS. This variable is used in the CSS rule below.\n+\n+Let's compare SCSS with a less-frequently used syntax, the indented syntax. This is also known as the \"Sass syntax\" since it was Sass's original syntax.\n+\n+This syntax relies on indentation to define the rules. Here is an example:\n+\n+```scss\n+$primary-color: #3498eb\n+\n+header\n+  background-color: $primary-color\n+```\n+\n+Notice that there are no curly braces around the CSS rule, or semi-colons at the end of CSS declarations. At the top, you can also see a variable. Notice that its name starts with a dollar sign (`$`) in this syntax, which is different than native CSS variables, but works very similarly.\n+\n+Sass also supports a powerful feature, called mixins. \n+\n+Mixins allow you to group multiple CSS properties and their values under the name and reuse that block of CSS code throughout your stylesheet.\n+\n+This makes your CSS code less repetitive and easier to maintain because, if you change something in that block, the change is applied everywhere you use the mixin.\n+\n+Since mixins can have custom and descriptive names, they can be helpful to understand what each block of CSS code does, which can make your stylesheets easier to understand.\n+\n+And mixins also promote consistency in stylesheets by applying uniform styles.\n+\n+This is an example of a mixin in SCSS syntax:\n+\n+```scss\n+@mixin center-flex {\n+  display: flex;\n+  justify-content: center;\n+  align-items: center;\n+}\n+```\n+\n+To define a mixin, you start by writing the `@mixin` at-rule, followed by the name of the mixin. In this case, the mixin is called `center-flex`. It has three CSS properties to center elements using Flexbox.\n+\n+Then, once you have your mixin defined, you would use the `@include` at-rule to include those properties in a CSS rule. You just need to write `@include` followed by the name of the mixin. In this case, the name is `center-flex`:\n+\n+```scss\n+section {\n+  @include center-flex;\n+  height: 500px;\n+  background-color: #3289a8;\n+}\n+```\n+\n+This is the full code with the mixin and the CSS rule:\n+\n+```scss\n+@mixin center-flex {\n+  display: flex;\n+  justify-content: center;\n+  align-items: center;\n+}\n+\n+section {\n+  @include center-flex;\n+  height: 500px;\n+  background-color: #3289a8;\n+}\n+```\n+\n+You can include the mixin in as many CSS rules as needed. If you need to make any changes, you would only need to change the mixin itself and the changes would be applied everywhere automatically. This example is in SCSS syntax. Notice that it has the curly braces and the semicolons.\n+\n+Here is the equivalent in indented syntax, also known as Sass syntax, without the curly braces or semicolons:\n+\n+```scss\n+@mixin center-flex\n+  display: flex\n+  justify-content: center\n+  align-items: center\n+\n+section\n+  @include center-flex\n+  height: 500px\n+  background-color: #3289a8\n+```\n+\n+And this is the compiled CSS code, what the browser will actually interpret after the file is compiled into native CSS:\n+\n+```css\n+section {\n+  display: flex;\n+  justify-content: center;\n+  align-items: center;\n+  height: 500px;\n+  background-color: #3289a8;\n+}\n+```\n+\n+Notice that it includes the three mixin properties at the top: `display`, `justify-content`, and `align-items`.\n+\n+This is only a simple example of what CSS preprocessors are capable of. They have many powerful features that are worth learning and applying in your daily workflow.\n+\n+However, they do have potential disadvantages that you should be aware of.\n+\n+First, CSS preprocessors have to compile the CSS rules into standard CSS. While the potential overhead of this compilation process is often minimal in terms of time and resources, it is something that you should consider for real-world projects.\n+\n+Next, they can create debugging challenges, since browsers use the compiled CSS directly. Finding out what is generating a problematic style from the extended syntax can take a few extra steps when compared to standard CSS.\n+\n+However, the advantages of CSS preprocessors usually outweigh their disadvantages, especially for complex projects. They can be very helpful for writing cleaner, reusable, less repetitive, and scalable CSS.\n \n # --questions--\n \n@@ -106,7 +259,7 @@ Think about the two different syntaxes available for working with Sass.\n \n ---\n \n-SCSS is a syntax for Sass that is similar to standard CSS.\n+SCSS is a syntax for Sass that is closer to standard CSS.\n \n ---\n "
        }
    ],
    "stats": {
        "total": 233,
        "additions": 228,
        "deletions": 5
    }
}