{
    "author": "majestic-owl448",
    "message": "feat(curriculum): add images to color theory lesson (#63975)",
    "sha": "9157a25ef443fa9367b3fb0e75be1381594474bc",
    "files": [
        {
            "sha": "5e73b86977e22b8b090c7686570c75f813a9327b",
            "filename": "curriculum/challenges/english/blocks/lecture-working-with-colors-in-css/672aa7678e05e35d42e33522.md",
            "status": "modified",
            "additions": 31,
            "deletions": 3,
            "changes": 34,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/9157a25ef443fa9367b3fb0e75be1381594474bc/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-colors-in-css%2F672aa7678e05e35d42e33522.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/9157a25ef443fa9367b3fb0e75be1381594474bc/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-colors-in-css%2F672aa7678e05e35d42e33522.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-colors-in-css%2F672aa7678e05e35d42e33522.md?ref=9157a25ef443fa9367b3fb0e75be1381594474bc",
            "patch": "@@ -11,32 +11,60 @@ Color theory is the study of how colors interact with each other and how they af\n \n Primary colors, yellow, blue, and red, are the fundamental hues from which all other colors are derived.\n \n-Secondary colors result from mixing equal amounts of two primary colors. Green, orange, and purple are examples of secondary colors. For example, green is the result of combining yellow and blue.\n+<img src=\"https://cdn.freecodecamp.org/curriculum/lecture-transcripts/lecture-what-is-color-theory-in-design-1.png\" alt=\"Color classification diagram\" />\n+\n+Secondary colors result from mixing equal amounts of two primary colors. Green, orange, and purple are examples of secondary colors.\n+\n+<img src=\"https://cdn.freecodecamp.org/curriculum/lecture-transcripts/lecture-what-is-color-theory-in-design-2.png\" alt=\"Primary colors diagram\" />\n+\n+For example, green is the result of combining yellow and blue.\n+\n+<img src=\"https://cdn.freecodecamp.org/curriculum/lecture-transcripts/lecture-what-is-color-theory-in-design-3.png\" alt=\"Secondary colors diagram\" />\n \n Tertiary colors result from combining a primary color with a neighboring secondary color. Yellow-Green, Blue-Green, and Blue-Violet, are examples of tertiary colors.\n \n+<img src=\"https://cdn.freecodecamp.org/curriculum/lecture-transcripts/lecture-what-is-color-theory-in-design-4.png\" alt=\"Green color mixing example\" />\n+\n This is a fundamental classification in the world of color theory, but there are other ways to classify colors. They can be classified as warm or cool, based on their temperature.\n \n-Warm colors, like reds, oranges, and yellows, evoke feelings of comfort, warmth, and coziness. Cool colors, like blues, green, and purples, evoke feelings of calmness, serenity, and professionalism.\n+<img src=\"https://cdn.freecodecamp.org/curriculum/lecture-transcripts/lecture-what-is-color-theory-in-design-5.png\" alt=\"Warm and cool colors diagram\" />\n+\n+Warm colors, like reds, oranges, and yellows, evoke feelings of comfort, warmth, and coziness.\n+\n+<img src=\"https://cdn.freecodecamp.org/curriculum/lecture-transcripts/lecture-what-is-color-theory-in-design-6.png\" alt=\"Warm colors examples\" />\n+\n+Cool colors, like blues, green, and purples, evoke feelings of calmness, serenity, and professionalism.\n \n Colors can also be represented through color models. They are essential for describing and reproducing colors in a standard way. Frequently used color models include the RGB model, the HSV model, and the HSL model. They represent colors based on different properties. You will learn more about them in future lessons.\n \n-Great. Now that you know more about this, let's talk about a fundamental tool that designers use to represent colors and their relationships. The color wheel is a circular diagram that shows how colors relate to each other. It's an essential tool for designers because it helps them to select color combinations. This is very helpful for creating color palettes and color schemes.\n+Great. Now that you know more about this, let's talk about a fundamental tool that designers use to represent colors and their relationships.\n+\n+The color wheel is a circular diagram that shows how colors relate to each other. It's an essential tool for designers because it helps them to select color combinations. This is very helpful for creating color palettes and color schemes.\n+\n+<img src=\"https://cdn.freecodecamp.org/curriculum/lecture-transcripts/lecture-what-is-color-theory-in-design-7.png\" alt=\"Color wheel diagram\" />\n \n A color scheme is the set of colors chosen for a specific design or project. They are usually based on the principles of color theory. By understanding the relationships between colors on the wheel, you can develop different types of color schemes. Let's see some of them.\n \n Analogous color schemes create cohesive and soothing experiences. They have analogous colors, which are adjacent to each other in the color wheel.\n \n+<!-- <img src=\"https://cdn.freecodecamp.org/curriculum/lecture-transcripts/lecture-what-is-color-theory-in-design-8.png\" alt=\"Analogous color scheme example\" /> -->\n+\n Complementary color schemes create high contrast and visual impact. Their colors are located on the opposite ends of the color wheel, relative to each other.\n \n Color contrast is essential for web accessibility. It ensures that text and other important elements are clearly distinguishable from their background. This is especially important for people with visual disabilities.\n \n In an RGB color wheel, complementary colors are located at the opposite ends of the wheel. For example, magenta is complementary to green and blue is complementary to yellow and so on.\n \n+<!-- <img src=\"https://cdn.freecodecamp.org/curriculum/lecture-transcripts/lecture-what-is-color-theory-in-design-9.png\" alt=\"RGB color wheel with complementary colors\" /> -->\n+\n A triadic color scheme has vibrant colors. They are made from colors that are approximately equidistant from each other. If they are connected, they form an equilateral triangle on the color wheel.\n \n+<!-- <img src=\"https://cdn.freecodecamp.org/curriculum/lecture-transcripts/lecture-what-is-color-theory-in-design-10.png\" alt=\"Triadic color scheme example\" /> -->\n+\n And finally, we have the monochromatic color scheme. In this color scheme, all the colors are derived from the same base color by adjusting its lightness, darkness, and saturation. This evokes a feeling of unity and harmony while still creating contrast.\n \n+<img src=\"https://cdn.freecodecamp.org/curriculum/lecture-transcripts/lecture-what-is-color-theory-in-design-11.png\" alt=\"Monochromatic color scheme example\" />\n+\n And finally, here are some tips for using color effectively in web development:\n \n - Create a color scheme that defines your website's branding."
        }
    ],
    "stats": {
        "total": 34,
        "additions": 31,
        "deletions": 3
    }
}