{
    "author": "moT01",
    "message": "chore(curriculum): add css animations transcripts (#58375)",
    "sha": "918a76869b406219d467c2ab2102d919efaa1109",
    "files": [
        {
            "sha": "76e8657a95a7691d6eec853a69cf07682390f369",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-animations-and-accessibility/672aa8d65995be62ef1c7515.md",
            "status": "modified",
            "additions": 101,
            "deletions": 0,
            "changes": 101,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/918a76869b406219d467c2ab2102d919efaa1109/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-animations-and-accessibility%2F672aa8d65995be62ef1c7515.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/918a76869b406219d467c2ab2102d919efaa1109/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-animations-and-accessibility%2F672aa8d65995be62ef1c7515.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-animations-and-accessibility%2F672aa8d65995be62ef1c7515.md?ref=918a76869b406219d467c2ab2102d919efaa1109",
            "patch": "@@ -10,6 +10,107 @@ dashedName: what-are-css-animations\n \n Watch the video lecture and answer the questions below.\n \n+# --transcript--\n+\n+What are CSS animations, and how do they work?\n+\n+CSS animations allow you to create dynamic, visually engaging effects on web pages without the need for JavaScript or complex programming. They provide a way to smoothly transition elements between different styles over a specified duration.\n+\n+At its core, a CSS animation consists of two main components: the `@keyframes` rule and the animation property.\n+\n+The `@keyframes` rule defines the stages and styles of the animation. It specifies what styles the element should have at various points during the animation. \n+\n+Here's an example:\n+\n+```css\n+@keyframes slide-in {\n+  0% {\n+    transform: translateX(-100%);\n+  }\n+  100% {\n+    transform: translateX(0);\n+  }\n+}\n+```\n+\n+This `@keyframes` rule, named `slide-in`, defines an animation that moves an element from left to right. The percentages represent the progress of the animation, with `0%` being the start and `100%` being the end.\n+\n+The `translateX` function in your `@keyframes` animation is controlling the horizontal position of an element as it animates into view.\n+\n+To apply this animation to an element, you use the `animation` property:\n+\n+```css\n+.sliding-element {\n+  animation: slide-in 2s ease-out;\n+}\n+```\n+\n+This applies the `slide-in` animation to the element with a duration of 2 seconds and an `ease-out` timing function.\n+\n+The `animation` property is actually a shorthand for several individual properties:\n+\n+`animation-name` which specifies the `@keyframes` rule to use.\n+\n+`animation-duration` which sets how long the animation should take to complete.\n+\n+`animation-timing-function` which defines how the animation progresses over time - such as `ease`, `linear`, `ease-in-out`.\n+\n+`animation-delay` which specifies a delay before the animation starts.\n+\n+`animation-iteration-count` which sets how many times the animation should repeat.\n+\n+`animation-direction` which determines whether the animation should play forwards, backwards, or alternate.\n+\n+`animation-fill-mode` which specifies how the element should be styled before and after the animation.\n+\n+`animation-play-state` which allows you to pause and resume the animation.\n+\n+You can use these properties individually for more precise control:\n+\n+```css\n+.complex-animation {\n+  animation-name: color-change;\n+  animation-duration: 3s;\n+  animation-timing-function: linear;\n+  animation-delay: 1s;\n+  animation-iteration-count: infinite;\n+  animation-direction: alternate;\n+}\n+\n+@keyframes color-change {\n+  0% {\n+    background-color: red;\n+  }\n+  50% {\n+    background-color: blue;\n+  }\n+  100% {\n+    background-color: green;\n+  }\n+}\n+```\n+\n+This creates an animation that continuously transitions an element's background color between red, blue, and green.\n+\n+CSS animations can be triggered by various events, such as hovering over an element:\n+\n+```css\n+.button {\n+  background-color: blue;\n+  transition: background-color 0.3s;\n+}\n+\n+.button:hover {\n+  background-color: red;\n+}\n+```\n+\n+While this example uses the `transition` property, which is simpler for basic effects, it demonstrates how CSS can create interactive, animated elements.\n+\n+It's important to note that while CSS animations are powerful, they should be used in moderation. Overuse of animations can lead to poor performance and may be distracting or problematic for users with certain accessibility needs. Always consider providing options to reduce or disable animations for users who prefer less motion.\n+\n+CSS animations offer a way to create engaging, interactive web experiences without relying on JavaScript. By understanding the principles of `@keyframes` and `animation` properties, you can bring your web designs to life in a performant and accessible manner.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "7739f5d3260e002b5aedf65f23b45383a58fddd9",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-animations-and-accessibility/672cf764cf55a70433590def.md",
            "status": "modified",
            "additions": 65,
            "deletions": 0,
            "changes": 65,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/918a76869b406219d467c2ab2102d919efaa1109/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-animations-and-accessibility%2F672cf764cf55a70433590def.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/918a76869b406219d467c2ab2102d919efaa1109/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-animations-and-accessibility%2F672cf764cf55a70433590def.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-animations-and-accessibility%2F672cf764cf55a70433590def.md?ref=918a76869b406219d467c2ab2102d919efaa1109",
            "patch": "@@ -10,6 +10,71 @@ dashedName: what-are-accessibility-concerns-around-using-animations\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are accessibility concerns around using animations, and how can `prefers-reduced-motion` help?\n+\n+Animations can greatly enhance the visual appeal and user experience of a website. However, they can also pose significant accessibility challenges for certain users. It's crucial to understand these concerns and implement solutions to ensure your website remains accessible to all users.\n+\n+One of the primary accessibility concerns with animations is that they can cause discomfort or even physical harm to some users. People with vestibular disorders or motion sensitivity may experience dizziness, nausea, or headaches when exposed to certain types of movement on screen.\n+\n+Additionally, animations can be distracting for users with cognitive disabilities or attention disorders. Rapid flashing or strobing effects are particularly problematic. They can trigger seizures in people with photosensitive epilepsy. As a general rule, avoid any content that flashes more than three times per second.\n+\n+Another issue is that animations can make it difficult for some users to focus on or read content. This is especially true for users with low vision or reading difficulties who may struggle to track moving text or shifting layouts.\n+\n+To address these concerns, CSS provides the `prefers-reduced-motion` media query. This feature allows web developers to detect if the user has requested minimal animations or motion effects at the system level.\n+\n+Here's how you can use `prefers-reduced-motion`:\n+\n+```css\n+@media (prefers-reduced-motion: reduce) {\n+  * {\n+    animation-duration: 0.01ms !important;\n+    animation-iteration-count: 1 !important;\n+    transition-duration: 0.01ms !important;\n+    scroll-behavior: auto !important;\n+  }\n+}\n+```\n+\n+This CSS code snippet effectively disables most animations and transitions for users who have indicated a preference for reduced motion. Let's break it down:\n+\n+The `@media` query rule checks if the user prefers reduced motion. If true, it applies the enclosed styles.\n+\n+Inside the media query, we're targeting all elements (`*`) and overriding animation and transition properties.\n+\n+We set `animation-duration` and `transition-duration` to an extremely small value (`0.01ms`). This essentially turns off the animations while still allowing them to complete, which can be important for certain functionality.\n+\n+`animation-iteration-count: 1` ensures that any looping animations only play once.\n+\n+`scroll-behavior: auto` disables smooth scrolling effects.\n+\n+The `!important` declaration is used to ensure these rules take precedence over other animation styles.\n+\n+It's important to note that while this method effectively reduces motion, it's a blanket approach. For more precise control, you might want to define specific reduced-motion alternatives for your animations.\n+\n+Here's an example of a more targeted approach:\n+\n+```css\n+.animated-element {\n+  transition: transform 0.3s ease-in-out;\n+}\n+\n+@media (prefers-reduced-motion: reduce) {\n+  .animated-element {\n+    transition: none;\n+  }\n+}\n+```\n+\n+In this case, we're only disabling the `transition` for a specific element when reduced motion is preferred. This allows you to provide alternative, less motion-intensive experiences for users who need them.\n+\n+Remember, the goal is not to completely remove all motion from your site, but to provide options that allow all users to comfortably interact with your content. Some motion can still be beneficial for usability and feedback, even for users who prefer reduced motion.\n+\n+When implementing animations, consider using them thoughtfully rather than just for decoration. Avoid large, unexpected movements and provide controls to pause, stop, or hide animations when possible. Importantly, use the `prefers-reduced-motion` query to offer a low-motion alternative, ensuring your content remains accessible and comfortable for all users, including those sensitive to motion.\n+\n+By being mindful of these accessibility concerns and utilizing tools like `prefers-reduced-motion`, you can create engaging, animated experiences that are inclusive and accessible to all users.\n+\n # --questions--\n \n ## --text--"
        }
    ],
    "stats": {
        "total": 166,
        "additions": 166,
        "deletions": 0
    }
}