{
    "author": "vardhu032",
    "message": "fix(curriculum): grammar and punctuations in CSS filter lesson (#63496)\n\nCo-authored-by: Vardhu32 <vardhu9550@gmail.com>\nCo-authored-by: Sem Bauke <sem@freecodecamp.org>\nCo-authored-by: Huyen Nguyen <25715018+huyenltnguyen@users.noreply.github.com>",
    "sha": "9ac6fbf27c4483a622ee5e64e1f651c2da525757",
    "files": [
        {
            "sha": "f860674f6b50f5882c90709c62e5d5f786f1c1fd",
            "filename": "curriculum/challenges/english/blocks/lecture-working-with-css-transforms-overflow-and-filters/672bccebe1fc82d911c3f078.md",
            "status": "modified",
            "additions": 6,
            "deletions": 6,
            "changes": 12,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/9ac6fbf27c4483a622ee5e64e1f651c2da525757/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-css-transforms-overflow-and-filters%2F672bccebe1fc82d911c3f078.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/9ac6fbf27c4483a622ee5e64e1f651c2da525757/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-css-transforms-overflow-and-filters%2F672bccebe1fc82d911c3f078.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-working-with-css-transforms-overflow-and-filters%2F672bccebe1fc82d911c3f078.md?ref=9ac6fbf27c4483a622ee5e64e1f651c2da525757",
            "patch": "@@ -7,7 +7,7 @@ dashedName: what-is-the-css-filter-property\n \n # --interactive--\n \n-The CSS `filter` property is a powerful tool that allows you to apply graphical effects to elements on a web page. It's particularly useful for adjusting the visual presentation of images, backgrounds and even text without modifying the original asset.\n+The CSS `filter` property is a powerful tool that allows you to apply graphical effects to elements on a web page. It's particularly useful for adjusting the visual presentation of images, backgrounds, and even text without modifying the original asset.\n \n The `filter` property can be used to create various effects, such as blurring, color shifting, and contrast adjustments. Let's discuss how the filter property works and explore some common examples. The basic syntax for a `filter` property is straightforward:\n \n@@ -17,7 +17,7 @@ selector {\n }\n ```\n \n-Here `function` represents the specific filter effect you want to apply, and `amount` is typically a value that determines the intensity of the effect. Now let's look at some common filter functions and their uses.\n+Here, `function` represents the specific filter effect you want to apply, and `amount` is typically a value that determines the intensity of the effect. Now let's look at some common filter functions and their uses.\n \n :::interactive_editor\n \n@@ -34,7 +34,7 @@ img {\n \n :::\n \n-The `blur` function applies a gaussian blur to the element, the amount is specified in pixels and represents the radius of the blur. This CSS rule will apply a 2 pixel blur to all images on the page. The `blur` effect can be useful for creating depth in your design or for obscuring parts of an image. \n+The `blur` function applies a Gaussian blur to the element, the amount is specified in pixels and represents the radius of the blur. This CSS rule will apply a 2-pixel blur to all images on the page. The `blur` effect can be useful for creating depth in your design or for obscuring parts of an image. \n \n The `brightness` function adjusts the brightness of the element. A value of `0%` will make the element completely black, while values over `100%` will increase the brightness. \n \n@@ -72,7 +72,7 @@ img {\n \n :::\n \n-This rule will convert the image element to complete grayscale. `grayscale` can be used to create a vintage look or de-emphasize certain elements on a page.\n+This rule will convert the image element to full grayscale. `grayscale` can be used to create a vintage look or de-emphasize certain elements on a page.\n \n The `sepia` function applies a sepia tone to the element. Like grayscale, it uses a percentage value: \n \n@@ -93,7 +93,7 @@ img {\n \n This rule applies an `80%` sepia effect to the image element. The sepia effect is great for creating a vintage or old-timey look.\n \n-The `hue-rotate` function applies the hue rotation to the element. The value is defined in degrees, and represents a rotation around the color circle. \n+The `hue-rotate` function applies a hue rotation to the element. The value is defined in degrees, and represents a rotation around the color circle. \n \n :::interactive_editor\n \n@@ -131,7 +131,7 @@ img {\n \n This rule applies increased contrast, slightly increased brightness, and a subtle sepia effect to the image element. \n \n-By combining filters you can create complex and unique visual effects tailored to your design needs. The CSS filter property is a versatile tool that allows for creative visual manipulation of web elements. \n+By combining filters, you can create complex and unique visual effects tailored to your design needs. The CSS filter property is a versatile tool that allows for creative visual manipulation of web elements. \n \n While we have covered some of the most common filter functions, there are others available, such as `contrast`, `invert`, and `saturate`. As with any powerful feature, it's important to be careful with how you use the filters to enhance your design without overwhelming your users or compromising accessibility.\n "
        }
    ],
    "stats": {
        "total": 12,
        "additions": 6,
        "deletions": 6
    }
}