{
    "author": "jdwilkin4",
    "message": "feat(curriculum): adding content for CSS typography review page (#57062)",
    "sha": "9fe1a2832c548928c5d33ba9219660caebda2ea9",
    "files": [
        {
            "sha": "0f56041b460b3f15443ba6f5c16e382030887e2d",
            "filename": "client/i18n/locales/english/intro.json",
            "status": "modified",
            "additions": 2,
            "deletions": 1,
            "changes": 3,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/9fe1a2832c548928c5d33ba9219660caebda2ea9/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/9fe1a2832c548928c5d33ba9219660caebda2ea9/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json?ref=9fe1a2832c548928c5d33ba9219660caebda2ea9",
            "patch": "@@ -2099,7 +2099,8 @@\n       \"review-css-typography\": {\n         \"title\": \"CSS Typography Review\",\n         \"intro\": [\n-          \"Review the CSS Typography concepts to prepare for the upcoming quiz.\"\n+          \"Before you are quizzed on the fundamentals of typography, you first need to review.\",\n+          \"Open up this page to review concepts like web safe fonts, the <code>font-family</code> property and more.\"\n         ]\n       },\n       \"quiz-css-typography\": {"
        },
        {
            "sha": "0c860c0eed3368a8b76f4584d88c7e4507f2a4b6",
            "filename": "curriculum/challenges/english/25-front-end-development/review-css-typography/671a9528fc4f1487cf265444.md",
            "status": "modified",
            "additions": 136,
            "deletions": 0,
            "changes": 136,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/9fe1a2832c548928c5d33ba9219660caebda2ea9/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-css-typography%2F671a9528fc4f1487cf265444.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/9fe1a2832c548928c5d33ba9219660caebda2ea9/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-css-typography%2F671a9528fc4f1487cf265444.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-css-typography%2F671a9528fc4f1487cf265444.md?ref=9fe1a2832c548928c5d33ba9219660caebda2ea9",
            "patch": "@@ -9,7 +9,143 @@ dashedName: review-css-typography\n \n Review the concepts below to prepare for the upcoming quiz.\n \n+## Introduction to Typography\n \n+- **Definition**: Typography is the art of choosing the right fonts and format to make text visually appealing and easy to read. \"Type\" refers to how the individual characters are designed and arranged.\n+- **Typeface Definition**: A typeface is the overall design and style of a set of characters, numbers, and symbols. It's like a blueprint for a family of fonts.\n+- **Font Definition**: A font is a specific variation of a typeface with specific characteristics, such as size, weight, style, and width.\n+- **Serif Typeface**: This typeface has a classical style with small lines at the end of characters. Serif typefaces are commonly used for printed materials, like books.\n+- **Sans Serif Typeface**: This typeface has a more modern look, without the small lines at the end of characters. Sans Serif typefaces are commonly used in digital design because they are easy to read on screen. Some examples include Helvetica, Arial, and Roboto.\n+- **Font Weight**: This is the thickness of the characters, including light, regular, bold, and black.\n+- **Font Style**: This is the slant and orientation of the characters, like italic and oblique.\n+- **Font Width**: This is the horizontal space occupied by characters, like condensed and expanded.\n+- **Baseline**: This is the imaginary line on which most characters rest.\n+- **Cap Height**: This is the height of uppercase letters, measured from the baseline to the top.\n+- **X-height**: This is the average height of lowercase letters, excluding ascenders and descenders.\n+- **Ascenders**: These are the parts of lowercase letters that extend above the x-height, such as the tops of the letters 'h', 'b', 'd', and 'f'.\n+- **Descenders**: These are the parts of lowercase letters that extend below the baseline, such as the tails of 'y', 'g', 'p', and 'q'.\n+- **Kerning**: This is how space is adjusted between specific pairs of characters to improve their readability and aesthetics. For example, reducing the space between the letters A and V.\n+- **Tracking**: This is how space is adjusted between all characters in a block of text. It's essentially the distance between the characters. It affects how dense and open the text will be.\n+- **Leading**: This is the vertical space between lines of text. It's measured from the baseline of one line to the baseline of the next line.\n+- **Best Practices with Typography**: You should choose clear and simple fonts to make your designs easy to understand. This is particularly important for the main text of your website. Users are more likely to engage with your content if the font is easy to read. \n+  \n+## CSS `font-family` Property\n+\n+- **Definition**: A font family is a group of fonts that share a common design. All the fonts that belong to the same family are based on the same core typeface but they also have variations in their style, weight, and width. You can specify multiple font families in order of priority, from highest to lowest, by separating them with commas. These alternative fonts will act as fallback options. You should always include a generic font family at the end of the font-family list.  \n+\n+```css\n+font-family: Arial, Lato;\n+```\n+\n+- **Common Font Families**: Here are some common font families used in CSS: serif, sans-serif, monospace, cursive, fantasy \n+\n+## Web Safe Fonts\n+\n+- **Definition**: These fonts are a subset of fonts that are very likely to be installed on a computer or device. When the browser has to render a font, it tries to find the font file on the user's system. But if the font is not found, it will usually fall back to a default system font. \n+\n+## At-rules and the `@font-face` At-rule\n+\n+- **Definition**: At-rules are statements that provide instructions to the browser. You can use them to define various aspects of the stylesheet, such as media queries, keyframes, font faces, and more.  \n+- **`@font-face`**: This allows you to define a custom font by specifying the font file, format, and other important properties, like weight and style. For the `@font-face` at-rule to be valid, you also need to specify the `src` property. This property contains references to the font resources.\n+\n+```css\n+@font-face {\n+  font-family: \"MyCustomFont\"; \n+  src: url(\"path/to/font.woff2\"),\n+       url(\"path/to/font.woff\"),\n+       url(\"path/to/font.otf\");\n+}\n+```\n+\n+- **Font Formats**: For each font resource, you can also specify the format. This is optional. It's a hint for the browser on the font format. If the format is omitted, the resource will be downloaded and the format will be detected after it's downloaded. If the format is invalid, the resource will not be downloaded. Possible font formats include `collection`, `embedded-opentype`, `opentype`, `svg`, `truetype`, `woff`, and `woff2`.\n+\n+```css\n+@font-face {\n+  font-family: \"MyCustomFont\"; \n+  src: url(\"path/to/font.woff2\") format(\"woff2\"),\n+       url(\"path/to/font.otf\") format(\"opentype\"),\n+       url(\"path/to/font.woff\") format(\"woff\");\n+}\n+```\n+\n+- **`woff` and `woff2`**: `woff` stands for \"Web Open Font Format.\" It's a widely used font format developed by Mozilla in collaboration with Type Supply, LettError, and other organizations. The difference between `woff` and `woff2` is the algorithm used to compress the data.\n+- **OpenType**: This is a format for scalable computer fonts developed by Microsoft and Adobe that allows users to access additional features in a font. It's widely used across major operating systems.\n+- **`tech()`**: This is used to specify the technology of the font resource. This is optional.\n+\n+```css\n+@font-face {\n+  font-family: \"MyCustomFont\"; \n+  src: url(\"path/to/font.woff2\") format(\"woff2\"),\n+       url(\"path/to/font.otf\") format(\"opentype\") tech(color-COLRv1),\n+       url(\"path/to/font.woff\") format(\"woff\");\n+}\n+```\n+\n+## Working With External Fonts\n+\n+- **Definition**: An external font is a font file that is not included directly within your project files.They're usually hosted on a separate server. To include these external fonts inside your project, you can use a `<link>` element or `@import` statement inside your CSS. \n+- **Google Fonts**: This is a Google service that offers a collection of fonts, many of which are designed specifically for web development. \n+\n+Here is an example using the `link` element:\n+\n+```html\n+<link rel=\"preconnect\" href=\"https://fonts.googleapis.com\">\n+<link rel=\"preconnect\" href=\"https://fonts.gstatic.com\" crossorigin>\n+<link href=\"https://fonts.googleapis.com/css2?family=Roboto:ital,wght@0,100;0,300;0,400;0,500;0,700;0,900;1,100;1,300;1,400;1,500;1,700;1,900&display=swap\" rel=\"stylesheet\">\n+```\n+\n+```css\n+.roboto-thin {\n+  font-family: \"Roboto\", sans-serif;\n+  font-weight: 100;\n+  font-style: normal;\n+}\n+```\n+\n+Here is an example using the `@import` statement:\n+\n+```css\n+@import url('https://fonts.googleapis.com/css2?family=Roboto:ital,wght@0,100;0,300;0,400;0,500;0,700;0,900;1,100;1,300;1,400;1,500;1,700;1,900&display=swap');\n+```\n+\n+- **Font Squirrel**: This is another popular resource that you can use for adding custom external fonts to your projects.\n+\n+## `text-shadow` Property\n+\n+- **Definition**: This property is used to apply shadows to text. You need to specify the X and Y offset, which represent the horizontal and vertical distance of the shadow from the text, respectively. These values are required. Positive values of the X offset and Y offset will move the shadow right and down, respectively, while negative values will move the shadow left and up.\n+\n+```css\n+p {\n+  text-shadow: 3px 2px;\n+}\n+```\n+\n+- **Shadow Color**: You can also customize the color of the shadow by specifying this value before or after the offset. If the color is not specified, the browser will determine the color automatically, so it's usually best to set it explicitly.\n+\n+```css\n+p {\n+  text-shadow: 3px 2px #00ffc3;\n+}\n+```\n+\n+- **Blur Radius**: The blur radius is optional but will make the shadow look a lot smoother and more subtle. The default value of the radius blur is zero. The higher the value, the bigger the blur, which means that the shadow becomes lighter.\n+\n+```css\n+p {\n+  text-shadow: 3px 2px 3px #00ffc3;\n+}\n+```\n+\n+- **Applying Multiple Text Shadows**: The text can have more than one shadow. The shadows will be applied in layers, from front to back, with the first shadow at the top.\n+\n+```css\n+p {\n+  text-shadow: \n+    3px 2px 3px #00ffc3, \n+    -3px -2px 3px #0077ff, \n+    5px 4px 3px #dee7e5;\n+}\n+```\n \n # --assignment--\n "
        }
    ],
    "stats": {
        "total": 139,
        "additions": 138,
        "deletions": 1
    }
}