{
    "author": "Supravisor",
    "message": "fix(curriculum): typos in video transcript (#59134)",
    "sha": "a209164965c742e3031b24dd94fcbdb720356c90",
    "files": [
        {
            "sha": "64c6e6bc47ba2ec743b6c4c580d79d31197d474c",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-working-with-css-transforms-overflow-and-filters/672bccdb8f1823d8c60f914c.md",
            "status": "modified",
            "additions": 3,
            "deletions": 3,
            "changes": 6,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/a209164965c742e3031b24dd94fcbdb720356c90/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-css-transforms-overflow-and-filters%2F672bccdb8f1823d8c60f914c.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/a209164965c742e3031b24dd94fcbdb720356c90/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-css-transforms-overflow-and-filters%2F672bccdb8f1823d8c60f914c.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-working-with-css-transforms-overflow-and-filters%2F672bccdb8f1823d8c60f914c.md?ref=a209164965c742e3031b24dd94fcbdb720356c90",
            "patch": "@@ -14,13 +14,13 @@ Watch the video or read the transcript and answer the questions below.\n \n What is a CSS reset, and what are some common examples?\n \n-A CSS reset is a stylesheet that removes all or some of the default formatting that web browsers apply to HTML elements. For example, you might have noticed that certain elements, like paragraphs and headings, already have margings by default even if you don't define them explicitly in your custom stylesheets. \n+A CSS reset is a stylesheet that removes all or some of the default formatting that web browsers apply to HTML elements. For example, you might have noticed that certain elements, like paragraphs and headings, already have margins by default even if you don't define them explicitly in your custom stylesheets. \n \n You will also see this with various properties in a wide range of HTML elements. Different browsers may also apply different default styles to HTML elements. The default styles in Google Chrome may not be exactly the same as in Mozilla Firefox or Microsoft Edge. This can result in inconsistent styles across browsers which you should avoid as much as possible.\n \n-To handle this, a CSS reset removes the default styles. By removing all or some of the default styles, you can get a consistent baseline for your design and minimize the potential inconsistencies across browsers and devices. Removing default styles can also make the styling process easier because you will only see the styles that you have applied expplicitly in your custom stylesheets. There are two main approaches to CSS resets: you can either define custom CSS resets or use third-party CSS resets.\n+To handle this, a CSS reset removes the default styles. By removing all or some of the default styles, you can get a consistent baseline for your design and minimize the potential inconsistencies across browsers and devices. Removing default styles can also make the styling process easier because you will only see the styles that you have applied explicitly in your custom stylesheets. There are two main approaches to CSS resets: you can either define custom CSS resets or use third-party CSS resets.\n \n-Custom CSS resets are stylesheets that you create from scratch to fit the need of your project. This way you can control the specific styles that will be reset with alot of room for flexibility. However, you also need to invest time to develop and maintain the stylesheets. Here's an example of a very common CSS rule for resetting the margin and padding of all HTML elements:\n+Custom CSS resets are stylesheets that you create from scratch to fit the need of your project. This way you can control the specific styles that will be reset with a lot of room for flexibility. However, you also need to invest time to develop and maintain the stylesheets. Here's an example of a very common CSS rule for resetting the margin and padding of all HTML elements:\n \n ```css\n * {"
        }
    ],
    "stats": {
        "total": 6,
        "additions": 3,
        "deletions": 3
    }
}