{
    "author": "zairahira",
    "message": "chore(curriculum): add accessibility transcripts (#58596)\n\nCo-authored-by: Jessica Wilkins <67210629+jdwilkin4@users.noreply.github.com>\r\nCo-authored-by: Naomi <accounts+github@nhcarrigan.com>\r\nCo-authored-by: Dario-DC <105294544+Dario-DC@users.noreply.github.com>",
    "sha": "b157a216c09110c5b67a277159f1a900822f42b6",
    "files": [
        {
            "sha": "fe300992e4bcefe170b52057f5027b5af9ef259b",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a51e9e4fd8b8552eeb758.md",
            "status": "modified",
            "additions": 40,
            "deletions": 0,
            "changes": 40,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a51e9e4fd8b8552eeb758.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a51e9e4fd8b8552eeb758.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a51e9e4fd8b8552eeb758.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,46 @@ dashedName: what-is-accessibility\n \n Watch the video lecture and answer the questions below.\n \n+# --transcript--\n+\n+What is accessibility?\n+\n+Accessibility involves creating products and services that everyone can use. In the context of web development, it's making websites that everyone can understand and interact with, including people with visual, auditory, motor, and cognitive disabilities.\n+\n+Some examples of disabilities that can impact users' online experience include:\n+\n+- Blindness.\n+- Low vision.\n+- Color blindness.\n+- Deafness.\n+- Difficulty using keyboards, mice, or touchscreens.\n+- Attention disorders\n+- Memory issues.\n+- Difficulty speaking or understanding spoken language.\n+- Sensitivity to flashing lights.\n+\n+These are just a few of many conditions that can impact users around the world.\n+\n+To help you create accessible websites, the World Wide Web Consortium, known as W3C, developed a set of international standards that you can follow to make your websites more accessible and easier to use for people with disabilities.\n+\n+These standards are known as \"The Web Content Accessibility Guidelines\" (WCAG).\n+\n+These guidelines are designed with four core principles in mind, known as **POUR**.\n+\n+- `P` stands for Perceivable. Users must be able to perceive the information that you are presenting. For example, you can provide alternative text for images, so users who access your website with a screen reader can understand them.\n+- `O` stands for Operable. Users must be able to interact with the user interface. For example, you can make sure that all functionality is accessible through the keyboard too, not just the mouse.\n+- `U` stands for Understandable. Users must be able to understand the information. For example, you can avoid complex sentences and use simple language as much as possible.\n+- `R` stands for Robust. A wide range of browsers and other tools, including assistive technologies, must be able to interpret the content. \n+\n+Using semantic HTML is very helpful for making your website compatible with different browsers and assistive technologies.\n+\n+If your content doesn't follow any one of these core principles, not everyone will be able to use your website.\n+\n+To check if you are following these guidelines correctly, you can access the Quick Reference of the World Wide Web Consortium. There, you will find a comprehensive list of criteria and techniques.\n+\n+Accessibility is essential for web development. By developing with inclusivity in mind, you can ensure that everyone can access and engage with your content, promote equality and create a better user experience for everyone around the world.\n+\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "7c31d4bd653a2337c06abda354f68321b112c81e",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a5310d7e46b8a34d48dfd.md",
            "status": "modified",
            "additions": 34,
            "deletions": 0,
            "changes": 34,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a5310d7e46b8a34d48dfd.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a5310d7e46b8a34d48dfd.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a5310d7e46b8a34d48dfd.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,40 @@ dashedName: what-are-screen-readers\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are screen readers and who uses them?\n+\n+Screen readers are assistive technology programs that help blind and visually impaired people use computers and mobile devices.\n+\n+Screen readers are not just tools for the blind and visually impaired to access computers and mobile devices.\n+\n+They empower these individuals to access education, work opportunities, and social media. This ensures digital inclusion and enhances their ability to participate fully in society.\n+\n+There's a common misconception that screen readers are text-to-speech devices.\n+\n+However, text-to-speech is just one of the features of a screen reader. Some screen readers even render the text to braille output instead of speech.\n+\n+Apart from text-to-speech and braille output, other notable features of screen readers are navigation aids and web browsing assistance.\n+\n+Screen reader programs are also not only made for the blind and visually impaired. Dyslexic individuals and people with cognitive disabilities also use screen readers. All the popular operating systems out there have screen readers built into them.\n+\n+macOS and iOS both have VoiceOver built-in. You can turn it on on your computer by pressing `CMD + F5`. You can access it on iPhones through Settings.\n+\n+Windows computers have Narrator built-in. You can turn it on by pressing `WIN + CTRL + ENTER`. NonVisual Desktop Access (NVDA) and Job Access With Speech (JAWS) are also available for Windows computers. NVDA is free and open-source, while JAWS is paid.\n+\n+Linux has _Orca_ for the desktop environment and _Speakup_ for the Linux terminal.\n+\n+Android phones have TalkBack built-in. You can turn it on by accessing _Settings > Special Function > Accessibility > Talkback._\n+\n+Some Android devices also have Ella and Select to Speak built in.\n+\n+One major challenge for screen reader users is that many software developers don't design their products with screen-reader friendliness and accessibility in mind.\n+\n+Even though accessibility is a broad topic, every developer needs to learn how to make their web software accessible for the blind and visually impaired, as well as other groups of people with disabilities.\n+\n+This demonstrates empathy and a commitment to inclusivity, ensuring that all users can benefit from their work.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "29fad1309f426617cc1baa3c8d14689643ee5bd8",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a5326a7606a8a766cbedb.md",
            "status": "modified",
            "additions": 20,
            "deletions": 0,
            "changes": 20,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a5326a7606a8a766cbedb.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a5326a7606a8a766cbedb.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a5326a7606a8a766cbedb.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,26 @@ dashedName: what-are-large-text-or-braille-keyboards\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are Large Text or Braille Keyboards, and Who Uses Them?\n+\n+Large text and braille keyboards are designed for users with visual disabilities. In Large Text Keyboards, also called Large Print Keyboards, the letters, numbers, and symbols are larger compared to standard keyboards. This design is helpful for people who may find smaller text in the keys difficult to see. Most of them also have enhanced contrast and brightness.\n+\n+A large print keyboard made by the brand MaxiAids has yellow keys with black, big, and bold letters, numbers, and symbols on them. This is helpful for people with low vision.\n+\n+Another keybord is the black large print keyboard with white print on the keys. This keyboard is also backlit, so users can adjust its brightness to different lighting conditions.\n+\n+While large print keyboards provide visual cues for users with low vision, braille keyboards provide a completely tactile experience for people with more severe vision disabilities, including people who are blind.\n+\n+Braille is a tactile reading and writing system. It consists of raised dots arranged in specific patterns to represent letters, numbers, and punctuation.\n+\n+Braille keyboards use this system to help users find the right keys on the keyboard by feeling these patterns with their fingers. The keys have raised dots in patterns that represent letters, numbers and symbols.\n+\n+And some keyboards combine both approaches- large fonts and braille patterns in the keys. This is helpful for people with visual disabilities and for people who are learning braille.\n+\n+Large text and braille keyboards are tools that empower people with visual disabilities. By providing alternative input methods, these assistive technologies ensure that everyone can be part of the digital world.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "23d321303fd72d4c01f9f07aa6958cdc688720a0",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a533e6041c28ad680eb8f.md",
            "status": "modified",
            "additions": 33,
            "deletions": 0,
            "changes": 33,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a533e6041c28ad680eb8f.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a533e6041c28ad680eb8f.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a533e6041c28ad680eb8f.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,39 @@ dashedName: what-are-alternative-pointing-devices\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are alternative pointing devices such as trackballs, joysticks, and touchpads used for?\n+\n+Alternative pointing devices are input devices that make good alternatives to the traditional mouse. They are essential for improving computer accessibility for those with disabilities, forelimb impairments, and limited mobility.\n+\n+Common examples of alternative pointing devices are trackballs, joysticks, and touchpads.\n+\n+A trackball is a stationary pointing device that consists of a large, movable ball within a socket. It also includes additional buttons for clicking and performing other functions.\n+\n+Unlike the traditional mouse, which requires movement around a surface to control the cursor, a trackball remains in place. Users manipulate the ball directly with their fingers, thumb, or palm to move the cursor on the screen.\n+\n+Some traditional mice also have a trackball on the top or side. These mice could make a good starting point if you want to gradually switch to a trackball.\n+\n+Trackballs reduce the physical movement the user needs for navigation, making them ideal for users with mobility issues. \n+Apart from that, if you need high precision and have limited desk space, a trackball is more ideal than a traditional mouse.\n+\n+A joystick is a pointing device primarily designed for games and certain industrial applications like machinery control. It consists of a lever that pivots up, down, left, and right, and often includes additional buttons for various actions\n+\n+Joysticks provide precise control over movement and actions within digital environments. This makes them popular for flight simulators, cranes, driving games, and other applications requiring precise directional input.\n+\n+Because joysticks accommodate larger and more deliberate movements, they are beneficial for individuals with tremors and unsteady hands.\n+\n+They also reduce the strain and pain that comes with repetitive movements, making them ideal for individuals with arthritis and carpal tunnel syndrome.\n+\n+A touchpad is a flat, touch-sensitive device built into laptops and some keyboards. It allows users to control the cursor on the screen by sliding their fingers across its surface.\n+\n+Apart from the surface for cursor control, touchpads also feature buttons that emulate the actions of a traditional mouse, such as right-click and left-click.\n+\n+Most people see touchpads as a better alternative to a mouse because they significantly enhance navigation by supporting multi-touch gestures like pinch-to-zoom, two-finger scrolling, tap-to-click, and three-finger swipes.\n+\n+Touchpad is ideal for individuals with low arm or hand movement because the forelimb is almost always stationary while using it. It is also suitable for people with arthritis and joint pain because they don't get to move their arms too much.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "9ce95f46893215daa0beb96cb8e225ddf0aeabd6",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a5361ef88158b25fbfba7.md",
            "status": "modified",
            "additions": 38,
            "deletions": 0,
            "changes": 38,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a5361ef88158b25fbfba7.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a5361ef88158b25fbfba7.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a5361ef88158b25fbfba7.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,44 @@ dashedName: what-are-screen-magnifiers\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are screen magnifiers used for?\n+\n+Screen magnifiers are tools that help people with low vision and other visual impairments better access digital content and the web.\n+\n+Let's delve deeper into what these tools are and the role they play in digital content accessibility.\n+\n+Screen magnifiers work by enlarging texts, graphics, and other elements on a computer or mobile device screen. Many screen magnifiers allow users to enlarge the display by more than 200%. Users can then navigate the page using their pointing device or keyboard. Additionally, most magnifiers offer customizable zoom percentages and other features in their settings.\n+\n+Screen magnifiers primarily help people with low vision read text, as small fonts in documents or applications can be challenging for them. By enlarging the text, they can read emails, articles, and other content without straining their eyes. Screen magnifiers also assist with web browsing. They help users locate and click on buttons, links, and other interactive elements that might be difficult to see. This improved visibility ensures that users can browse websites, fill out forms, and engage in online activities without difficulty.\n+\n+Therefore, software developers need to make their digital products accessible to people with low vision. Some considerations include:\n+\n+- Using scalable fonts so the user can resize the page without the layout breaking.\n+- Ensuring the user interface adapts to different screen sizes through responsive design.\n+- Using high-contrast color schemes and customizable colors.\n+- Implementing a non-sticky and tiny navbar so users can still see content when using magnifiers.\n+- Using regular HTML text instead of images of text.\n+- Providing feedback directly next to the element that triggers it, and more.\n+\n+All the mainstay Operating Systems have at least one magnifier built into them by their manufacturers:\n+\n+- macOS and iOS both have Zoom. You can turn it on on Mac by going to Settings, filter by Accessibility, and then click on \"Zoom\". Toggle the \"Use keyboard shortcuts to zoom\" option to enable it.\n+  - You can turn it on on iPhone through _Settings > Accessibility > Zoom_.\n+- Android devices have Magnification. To turn it on, go to _Settings > Special Function > Accessibility> Magnification_. Since this may vary from device to device, you can search for \"Magnification\" on the settings homepage to access it.\n+- Windows has Magnifier. You can use it by going to _Settings > Ease of Access > Magnifier_.\n+- The magnifiers for Linux operating systems vary. It is either Zoom or Magnifier.\n+\n+Apart from the ones built into operating systems, some useful third party screen magnifiers are:\n+\n+- ZoomText for Windows.\n+- ClaroView for both Mac and Windows.\n+- iZoom for Windows.\n+- Zoomify - Screen Magnifier for Mac.\n+- LunarPluse for Windows.\n+- Loupe for Mac.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "4073ff19715f50871f8fe1d6ffa41a3911f76283",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a536f8386288b9ed0a154.md",
            "status": "modified",
            "additions": 22,
            "deletions": 0,
            "changes": 22,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a536f8386288b9ed0a154.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a536f8386288b9ed0a154.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a536f8386288b9ed0a154.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,28 @@ dashedName: what-is-voice-recognition-software\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What is voice recognition software used for?\n+\n+Voice recognition software helps people with disabilities interact with computers and other digital devices. Let's discuss what voice recognition software is and the role it plays in digital inclusion.\n+\n+In the context of accessibility, voice recognition tools let people with disabilities use their voice to pass commands to perform various tasks instead of using traditional input devices like keyboards and mice. This includes writing emails and other documents, surfing the net, and controlling smart home devices.\n+\n+Because voice recognition software tools eliminate the need for physical interaction, they empower people with disabilities with significant independence and control over their environment. \n+\n+Here are the specific people who may find voice recognition software significantly helpful:\n+\n+- People with visual impairments, including those with low-vision or blindness.\n+- Individuals with mobility impairments, such as limited use of hands and arms or conditions like arthritis and carpal tunnel syndrome.\n+- Those recovering from hand or arm injuries.\n+- Individuals with cognitive disorders, like memory issues or attention deficit disorders.\n+- Elderly individuals who might find it easier to use voice commands.\n+\n+Note that people with disabilities are not the only ones who use voice recognition technology. Law enforcement agencies, gamers, drivers, and busy professionals also use voice recognition tools.\n+\n+A few examples of voice recognition software that allows people to interact with their computer include Voice Control for macOS/iOS, Voice Access for Android, and Windows Speech Recognition for Windows (referred to as Voice Access in the most recent versions of Windows). Dragon by Nuance is a popular third-party voice recognition software for Windows.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "6975c2b557c16469eba942711e05624b5ee8220f",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a537f05f3798bd4f57d2d.md",
            "status": "modified",
            "additions": 33,
            "deletions": 0,
            "changes": 33,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a537f05f3798bd4f57d2d.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a537f05f3798bd4f57d2d.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a537f05f3798bd4f57d2d.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,39 @@ dashedName: what-are-some-common-accessibility-auditing-tools\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are some common accessibility auditing tools to use?\n+\n+Accessibility is a crucial yet often overlooked aspect of digital content. When making your digital content accessible, it's important to ensure it meets accessibility standards.\n+\n+An accessibility auditing tool is an application that helps you improve the accessibility of your digital content by reporting accessibility issues that can be easily found through automated testing. This content includes websites, web applications, and mobile apps.\n+\n+It is important to note that while automated accessibility tools have a role in improving accessibility, they typically will only find about a third of all possible accessibility issues. Therefore, it is important not to rely on them entirely to evaluate the accessibility of your content. Manual testing, preferably by people with disabilities, will always be required to ensure that your content is as accessible as possible.\n+\n+Let's look at some free tools that can help you improve the accessibility of your digital content.\n+\n+Google Lighthouse is a popular web metric checker you can use directly within Chrome DevTools or online. This means you can check not only live websites but also locally-developed ones.\n+\n+The metrics you can check include accessibility, SEO, best practices, and performance.\n+\n+To use Lighthouse, open your DevTools by pressing `F12` and switching to the Lighthouse tab.\n+Select the metrics you want to check, choose the device you want to test on, and click the \"Analyze page load\" button.\n+\n+An accessibility score will appear after the check is complete, along with a list of any issues that need fixing.\n+\n+If you want more reliable metrics, consider using the web version. The downside is that it doesn't support testing local websites. You can access the web version on `pagespeed.web.dev`.\n+\n+WAVE is another reliable accessibility checker you can use as a Chrome extension or on the web. All you need to do is enter the URL of your website and a comprehensive accessibility report will be generated for you. This report includes accessibility features implemented, ARIA, and contrasts.\n+\n+The IBM Equal Accessibility Checker is another robust tool for improvingg digital content accessibility. With it, you can scan your websites for accessibility issues and generate a detailed report.\n+\n+You can use it as a Chrome extension or Firefox add-on.\n+\n+To use the IBM Accessibility Checker as a Chrome extension, download it from the Chrome web store. Open your Devtools by pressing `F12` and selecting the \"Accessibility Checker\" tab located in the Elements panel. Click the scan button to start the check and a report will be generated for you. You can export the report as a spreadsheet and an HTML file by clicking the \"Export XLS\" button.\n+\n+Please keep in mind, while these automated tools help you make your content more accessible, a perfect score from any of them does not mean that your content is entirely accessible. The range of issues that these tools test for is limited, and manual testing will always be needed to ensure a more accessible experience for everyone.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "db972d90f545b498160b5c9bcda2ce3d2c135562",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a538c029f9e8c1687460e.md",
            "status": "modified",
            "additions": 53,
            "deletions": 0,
            "changes": 53,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a538c029f9e8c1687460e.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a538c029f9e8c1687460e.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a538c029f9e8c1687460e.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,59 @@ dashedName: how-does-proper-heading-level-structure-affect-accessibility\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+How does proper heading level structure affect accessibility?\n+\n+In an earlier lecture video, you learned about proper heading level structure. In this video, you will learn how a good heading structure affects accessibility.\n+\n+Proper use of headings creates a visual hierarchy for users to navigate and understand your web page. Using a logical heading hierarchy allows screen reader users to understand the structure of your content and navigate your content quickly. Creating appropriate heading text that accurately describes the content that follows helps everyone find the information they need on your site. As an additional benefit, well-formed headings may also improve the SEO of your site.\n+\n+Think of headings as the foundation of your site. Without a good foundation, the accessibility of your content will suffer.\n+\n+Let's look at how you can make your web projects friendly for people who use assistive technologies by using headings correctly.\n+\n+Headings, ranging from `h1` to `h6`, create a navigational structure for screen reader users. Screen readers can list all headings on a page, allowing users to jump directly to the sections they need. So, correctly arranging headings is important for helping these users avoid unnecessary content and finding the information they are looking for quickly.\n+\n+People with partial sight or cognitive disabilities need to process information quickly and easily to reduce cognitive load.\n+\n+While proper arrangement of headings is important, it is also necessary to make heading texts clear and descriptive.\n+\n+Here are some key practices to follow to use headings properly:\n+\n+- Use headings in a hierarchy that reflects clear organization. For example, the page title should be an `h1`, major sections should be introduced with `h2` headings, subsections with `h3` , and so on, down to `h6`.\n+- Don't skip from `h1` to `h3`, or from `h2` to `h4`, and so on.\n+- Use clear and descriptive text that summarizes the content that follows each heading.\n+- Don't use a heading in isolation – some content must follow the heading.\n+- Use appropriate headings where necessary instead of formatting text to look like headings.\n+- Each page should have a single `h1` element representing the main topic or title.\n+\n+Here's a basic markup that represents how you should use headings on a page:\n+\n+```html\n+<!-- Page title -->\n+<h1>What is HTML</h1>\n+\n+<!-- First section -->\n+<section>\n+  <h2>Introduction to HTML</h2>\n+  <p>\n+    HTML stands for HyperText Markup Language. It is the standard language for\n+    creating web pages.\n+  </p>\n+</section>\n+<!-- Second section -->\n+<section>\n+  <h2>History of HTML</h2>\n+  <p>HTML began to take shape in the early 90s</p>\n+  <h3>Origins</h3>\n+  <p>\n+    HTML was created by Tim Berners-Lee in 1991. It has evolved significantly\n+    over the years.\n+  </p>\n+</section>\n+```\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "e8b42702b5f043d6c7e02b2544e876bcdce1e0e0",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a539b887ec68c593cdc4b.md",
            "status": "modified",
            "additions": 127,
            "deletions": 0,
            "changes": 127,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a539b887ec68c593cdc4b.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a539b887ec68c593cdc4b.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a539b887ec68c593cdc4b.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,133 @@ dashedName: what-are-best-practices-for-tables-and-accessibility\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are best practices for tables and accessibility?\n+\n+When we see a table, we immediately start making visual associations between the data and the headers.\n+\n+For example, let's say we have a table representing our pets. We have two dogs and two cats and the table is showing us their names and ages. While a sighted person may be able to understand the relationships in this table, making the connections between the values and the headers is much harder for people who use screen readers to navigate the table.\n+\n+As a web developer, you are in charge of creating these associations and structuring your HTML markup in a way that is also easy for screen reader users to interpret.\n+\n+So, let's see how you can create accessible tables that everyone can understand. The first best practice that we will cover is using table caption. With the `caption` element, you can write the caption (or title) of a table, so users, especially those who use assistive technologies, can quickly understand the table's purpose and content. You should place the `caption` element immediately after the opening tag of the `table` element. This way, screen readers and other assistive technologies can provide more context by announcing the caption before reading the content.\n+\n+```html\n+<table>\n+  <caption>Our Pets</caption>\n+  <!-- Table Rows and Columns -->\n+</table>\n+```\n+\n+Now let's talk about row and column headers. Headers are special cells, typically found at the start of a row or column, that describe the type of data stored in the row or column. You can define a row or column header with the table header element, `th`.\n+\n+For example, the code below creates a table for two pets. Every row has a row header (the name of the pet) and every column has a column header, which describes what the data in the column represents (age and type).\n+\n+```html\n+<table>\n+  <caption>Our Pets</caption>\n+  <thead>\n+    <tr>\n+      <!-- Column Headers -->\n+      <th>Name</th>\n+      <th>Age</th>\n+      <th>Type</th>\n+    </tr>\n+  </thead>\n+  <tbody>\n+    <tr>\n+      <th>Nora</th> <!-- Row Header -->\n+      <td>5</td>\n+      <td>Dog</td>\n+    </tr>\n+    <tr>\n+      <th>Gino</th> <!-- Row Header -->\n+      <td>2</td>\n+      <td>Cat</td>\n+    </tr>\n+  </tbody>\n+</table>\n+```\n+\n+Notice that the above code has a `caption` element immediately after the opening `table` element. Then, inside the table head (`thead`) element, it has the column headers (`Name`, `Age`, and `Type`). In the second and third rows, inside the table body (`tbody`) element, we find the data for each one of our pets. The names of the pets are the row headers because they are inside table header elements (`th`).\n+\n+Associating the data cells with their corresponding headers is also very important for screen readers. The `scope` attribute determines if a header is a row header or a column header.\n+Screen readers may guess this correctly from the table's structure, but it's usually recommended to explicitly indicate the `scope` to ensure clarity.\n+\n+The `scope` attribute has four possible values. The two you will use most often are `col` for column and `row` for row.\n+In the code below, you can see that we added the `scope` attribute to the column and row headers. The three column headers (`Name`, `Age`, and `Type`) have a `scope` of `col`, column.\n+\n+The two row headers (`Nora` and `Gino`) have a `scope` of `row`.\n+\n+```html\n+<table>\n+  <caption>Our Pets</caption>\n+  <thead>\n+    <tr>\n+      <!-- Now they have scope -->\n+      <th scope=\"col\">Name</th>\n+      <th scope=\"col\">Age</th>\n+      <th scope=\"col\">Type</th>\n+    </tr>\n+  </thead>\n+  <tbody>\n+    <tr>\n+      <th scope=\"row\">Nora</th>\n+      <td>5</td>\n+      <td>Dog</td>\n+    </tr>\n+    <tr>\n+      <th scope=\"row\">Gino</th>\n+      <td>2</td>\n+      <td>Cat</td>\n+    </tr>\n+  </tbody>\n+</table>\n+```\n+\n+If a column or row header spans across multiple cells, the `scope` will also be applied to each one of the cells individually. Here's an example of that:\n+\n+<table>\n+  <tbody>\n+    <tr>\n+      <td></td>\n+      <th scope=\"col\">Name</th>\n+      <th scope=\"col\">Age</th>\n+    </tr>\n+    <tr>\n+      <th rowspan=\"2\" scope=\"row\">Dogs</th>\n+      <th scope=\"row\">Nora</th>\n+      <td>5</td>\n+    </tr>\n+    <tr>\n+      <th scope=\"row\">Gino</th>\n+      <td>2</td>\n+    </tr>\n+    <tr>\n+      <th rowspan=\"2\" scope=\"row\">Cats</th>\n+      <th scope=\"row\">Lulu</th>\n+      <td>10</td>\n+    </tr>\n+    <tr>\n+      <th scope=\"row\">Elizabeth</th>\n+      <td>6</td>\n+    </tr>\n+  </tbody>\n+</table>\n+\n+In this table, the cell with `Nora`'s age (`5`) will have one column header (`Age`) and two row headers (`Dogs` and `Nora`). `Gino`'s age (`2`) will also have one column header (`Age`) and two row headers (`Dogs` and `Gino`).\n+\n+However, some screen readers may not be able to interpret tables with complex structures, so you should also try to flatten the table as much as possible to avoid row and column headers that span across multiple cells.\n+\n+Your goal should always be to make sure users can access this information, even if their screen readers can't handle complex table structures.\n+\n+Now, for cell width, it's recommended to avoid using fixed values. You should use relative values instead, like percentages. Also, try to avoid defining cell height. This will allow users to adjust the text size to fit their needs.\n+\n+And finally, you should let the browser determine the table width whenever possible, to reduce the need for horizontal scrolling.\n+\n+HTML tables are essential for presenting structured data in an accessible and understandable format. By following these accessibility guidelines, you can create tables that are easy to understand for everyone.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "57a459d44342e533c36f1fdce51238c0c118486f",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a53ae8f1ad28c8a1ed0f0.md",
            "status": "modified",
            "additions": 27,
            "deletions": 0,
            "changes": 27,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a53ae8f1ad28c8a1ed0f0.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a53ae8f1ad28c8a1ed0f0.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a53ae8f1ad28c8a1ed0f0.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,33 @@ dashedName: why-is-it-important-for-inputs-to-have-an-associated-label\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+Why is it important for inputs to have an associated label?\n+\n+Labels on input fields might seem like small details, but they play a crucial role in making forms easier for everyone to use.\n+\n+Labels help people with disabilities, make forms more user-friendly for everyone, and ultimately improve form conversion rates.\n+\n+Let's dive into why adding labels to input elements is important for accessibility and usability.\n+\n+Screen readers often rely on labels to describe the purpose of input fields. In order for this to work properly, the label must be programmatically associated with the `input`. While there are several ways to do that, the most common is to use the HTML `label` element.\n+\n+Here's how to associate a `label` with an `input`:\n+\n+```html\n+<form>\n+   <label for=\"name\">Your Name</label>\n+   <input type=\"text\" id=\"name\" />\n+</form>\n+```\n+\n+In this example, the `for` attribute of the `label` element is associated with the `id` of the `input` element. This connection allows screen readers to announce the `label` when the `input` is in a focused state, allowing screen reader users to understand the purpose of the `input`.\n+\n+Associating labels with all input fields also benefits SEO.  With proper labels, search engines will understand the page content better, leading to a positive impact on the page search rankings.\n+\n+But it is important to understand that you're making content for humans, not search engines. So, you should make sure the labels are as clear and descriptive as possible.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "7e8c400d2cbd764abeed3e245e5ef69065eebee0",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a53cf67140d8cd85d4b0f.md",
            "status": "modified",
            "additions": 104,
            "deletions": 0,
            "changes": 104,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a53cf67140d8cd85d4b0f.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a53cf67140d8cd85d4b0f.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a53cf67140d8cd85d4b0f.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,110 @@ dashedName: what-is-the-purpose-of-wai-aria\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What is the purpose of WAI-ARIA, and how does it work?\n+\n+Making static content accessible can be relatively straightforward, but dynamic content can be more challenging. This is where WAI-ARIA comes in.\n+\n+Let's look at what WAI-ARIA is, its purpose, how it works, and some examples.\n+\n+WAI-ARIA stands for Web Accessibility Initiative - Accessible Rich Internet Applications. It's a specification that enhances accessibility for dynamic content and UI (User Interface) components.\n+\n+Note that WCAG and WAI-ARIA are not the same. WCAG provides general guidelines for web accessibility, while WAI-ARIA offers specific rules for making dynamic and interactive content accessible for users of assistive technologies.\n+\n+So, the primary purpose of WAI-ARIA is to improve accessibility for dynamic content and UI components that do not have native HTML equivalents.\n+\n+WAI-ARIA works by introducing a set of attributes you can add to HTML elements to provide additional semantic information. These attributes are categorized into roles, states, and properties.\n+\n+ARIA role defines the purpose of an element within a website or web app. Here is an example of setting the role to `button` for a `div` element.\n+\n+```html\n+<div role=\"button\">Click Me</div>\n+```\n+\n+By doing this you are indicating to assistive technology that the element is a button. Roles do not provide any functionality however. Merely giving this `div` a `role` of `button` will not make it act like a button. To make it look and behave like a button you would need to use CSS and JavaScript to get the desired result. It is always better to use the native `button` or `input` element with `type=\"button\"` instead.\n+\n+Since HTML alone does not provide a way to make custom UI components like tabbed navigation (tab list) accessible, ARIA roles can be very helpful.\n+\n+Here's what a tablist could look like with the `role` attribute:\n+\n+```html\n+<div role=\"tablist\" aria-label=\"Football Match Dashboard\">\n+   <button\n+     role=\"tab\"\n+     aria-selected=\"true\"\n+     aria-controls=\"match-info-panel\"\n+     id=\"match-info-tab\">\n+       Match Info\n+   </button>\n+\n+   <button\n+     role=\"tab\"\n+     aria-selected=\"false\"\n+     aria-controls=\"player-stats-panel\"\n+     id=\"player-stats-tab\">\n+     Player Stats\n+   </button>\n+</div>\n+```\n+\n+Each tab in the tablist will have an associated tab panel that will display when its tab is selected. Each tab panel will have a `role` of `tabpanel`.\n+\n+Here's what each of those tab panels could look like:\n+\n+```html\n+<div \n+  role=\"tabpanel\"\n+  id=\"match-info-panel\" \n+  aria-labelledby=\"match-info-tab\"\n+>\n+   <p>\n+     Details about the match, including date,\n+     time, venue, and current score.\n+   </p>\n+</div>\n+\n+<div\n+   role=\"tabpanel\"\n+   id=\"player-stats-panel\"\n+   aria-labelledby=\"player-stats-tab\"\n+   hidden\n+>\n+   <p>\n+     Individual player statistics such as goals,\n+     assists, and minutes played.\n+   </p>\n+</div>\n+```\n+\n+ARIA state describes the current status of an element, which can change based on user interactions. An example is the `aria-expanded` attribute for collapsible sections:\n+\n+```html\n+<button aria-expanded=\"false\" aria-controls=\"more-info\">\n+  More Info\n+</button>\n+\n+<div id=\"more-info\" hidden>\n+   <p>This is additional information.</p>\n+</div>\n+```\n+\n+Again, this is merely describing the state, it does not provide any functionality. You would have to use JavaScript to change the state of the attribute  when the user clicks the button.\n+\n+ARIA properties provide additional details about elements. For example, the `aria-labelledby` property lets you connect an element to a specific label:\n+\n+```html\n+<h2 id=\"header-id\">About freeCodeCamp</h2>\n+<button id=\"button-id\" aria-labelledby=\"header-id button-id\">Learn More</button>\n+```\n+\n+This will make the elements understandable and navigable for users of assistive technologies.\n+\n+To get the best out of WAI-ARIA, try to stick with native HTML whenever possible since it generally provides more accessibility out of the box.\n+\n+Use WAI-ARIA only when HTML falls short, and don’t forget to test with assistive technologies like screen readers, or have people with disabilities test your work. Also, make sure your WAI-ARIA states and properties update with the content in real time. Avoid overusing ARIA as it can be confusing many times.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "e45faa55667dfb97745b08cfb022e2a613e2ed9c",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a549231b8728f7171ed9d.md",
            "status": "modified",
            "additions": 63,
            "deletions": 0,
            "changes": 63,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a549231b8728f7171ed9d.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a549231b8728f7171ed9d.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a549231b8728f7171ed9d.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,69 @@ dashedName: what-are-aria-roles\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are ARIA roles?\n+\n+ARIA stands for Accessible Rich Internet Applications.\n+\n+ARIA roles specify the semantic meaning of HTML elements. They're essential for making web content accessible to people who use assistive technologies, like screen readers.\n+\n+HTML has semantic and non-semantic elements, based on whether they convey meaning about their content.\n+\n+Many semantic HTML elements already have an ARIA role assigned by default. For example, the `button` element has a default ARIA role of `button`. \n+\n+But non-semantic elements don't have a role. For example, screen readers will not know how to interpret the purpose of a `div` if you don't specify its role explicitly.\n+\n+To specify the ARIA role of an element, you just need to add the `role` attribute, like this `role=\"ARIA role\"`, where value is the name of a role in the ARIA specification.\n+\n+It is important to note that specifying a role on an element only does one thing: It informs assistive technology of the purpose of the element. It does not add any functionality or behavior to the element. If people expect a role to behave a certain way, it is up to you, the developer, to add that expected behavior. For example, adding a `role` of `button` to a `div` does not automatically make it clickable with a mouse or usable with a keyboard. It is the responsibility of the developer to add the expected behavior that allows the `div` to act like a button, and in most cases, it is just better to use the `button` element.\n+\n+There are six main categories of ARIA roles:\n+\n+- Document structure roles\n+- Widget roles\n+- Landmark roles\n+- Live region roles\n+- Window roles\n+- And Abstract roles\n+\n+Let's take a look at them in more detail.\n+\n+Document structure roles define the overall structure of the web page. With these roles, assistive technologies can understand the relationships between different sections and help users navigate the content.\n+\n+However, most of the document structure roles are not used in modern web development because browsers already support equivalent semantic HTML elements, which should be prioritized whenever possible.\n+\n+You should specify the roles that don't have an equivalent semantic element. For example: `toolbar`, `tooltip`, `feed`, `math`, `presentation`, `none`, and `note`.\n+\n+There are other similar roles but these are the most commonly used ones. This is an example of a `div` with the `math` ARIA role. The `div` contains a mathematical equation.\n+\n+```html\n+<div role=\"math\" aria-label=\"x squared + y squared = 3\">\n+  x<sup>2</sup> + y<sup>2</sup> = 3\n+</div>\n+```\n+\n+You'll also notice that the `div` has an `aria-label` attribute. The value of this attribute should be a string that represents the expression.\n+\n+Widget roles define the purpose and functionality of interactive elements, like scrollbars.\n+\n+Examples of widget roles include `scrollbar`, `searchbox`, `separator` (when focusable), `slider`, `spinbutton`, `switch`, `tab`, `tabpanel`, and `treeitem`.\n+\n+Some of these roles have equivalent semantic elements. You should prioritize the semantic element over the role if there is one. For example, you should favor using the HTML `button` element over adding a `role` of `button` to a `div`.\n+\n+Landmark roles classify and label the primary sections of a web page. Screen readers use them to provide convenient navigation to important sections of a page. You should use them sparingly to keep the overall layout simple and easy to understand. Examples of landmark roles are `banner`, `complementary`, `contentinfo`, `form`, `main`, `navigation`, `region`, and `search`. Each of these roles has a corresponding HTML equivalent, such as `header`, `footer`, `aside`, `form`, `main`, `nav`, `section`, and `search`. If you use the proper HTML elements to define the sections of your page then it is not necessary to explicitly add the `role` attribute to these elements.\n+\n+Live region roles define elements with content that will change dynamically. This way, screen readers and other assistive technologies can announce changes to users with visual disabilities. These roles include: `alert`, `log`, `marquee`, `status`, and `timer`.\n+\n+Window roles define sub-windows, like pop up modal dialogues. These roles include `alertdialog` and `dialog`. Please note that it is now considered a best practice to use the HTML `dialog` element and its associated JavaScript methods instead of manually creating a dialog.\n+\n+And finally, we have abstract roles. These roles help organize the document. They're only meant to be used internally by the browser, not by developers, so you should know that they exist but you shouldn't use them on your websites or web applications.\n+\n+With ARIA roles, you can create accessible and inclusive websites and web applications. They provide semantic information about the purpose and function of HTML elements.\n+\n+Screen readers and other assistive technologies use this information to help users understand the content of your page and set expectations for how to use it, which helps ensure  that everyone can have a great user experience.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "f0b4741477b43e10a4a466955a456e3c0ee1d2f8",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a54a6675c168faa84252d.md",
            "status": "modified",
            "additions": 63,
            "deletions": 0,
            "changes": 63,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a54a6675c168faa84252d.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a54a6675c168faa84252d.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a54a6675c168faa84252d.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,69 @@ dashedName: what-are-the-roles-of-the-aria-label-and-aria-labelledby-attributes\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are the roles of the `aria-label` and `aria-labelledby` attributes?\n+\n+It is important to make sure that all users, including those living with disabilities, can access websites without issues.\n+\n+For people using screen readers, the `aria-label` and `aria-labelledby` attributes provide crucial information about page elements that might be unclear or invisible.\n+\n+Let's look at what the `aria-label` and `aria-labelledby` attributes are and the roles they play in making the web accessible to people with visual impairments and related disabilities.\n+\n+You'll notice both `aria-label` and `aria-labelledby` are prefixed with aria. So what does that mean? ARIA stands for Accessible Rich Internet Applications. It's a set of attributes prefixed with `aria-`, which lets developers communicate the purpose of elements to assistive technologies. The `aria-label` attribute is an invisible label for interactive elements. It adds a text label to an element that screen readers can read.\n+\n+`aria-label` is especially useful for elements that do not have visible text but still need to be described by screen readers. For example, buttons with only icons often need `aria-label` to convey their purpose.\n+\n+Here is an example:\n+\n+```html\n+<button aria-label=\"Search\">\n+  <i class=\"fas fa-search\"></i>\n+</button>\n+```\n+\n+In this case, a screen reader may announce this button as `Search, button`, even though the button only contains an icon. The `aria-label` attribute tells screen readers what text to use in place of the icon.\n+\n+If the button contained the text \"Search\" instead of an icon, then there would be no need for the `aria-label` attribute as the text would provide the label for the button.\n+\n+For input elements, the `aria-label` attribute provides a label directly if there isn't a visible label associated with the input.\n+\n+The `aria-labelledby` attribute does the exact same thing as the `aria-label` attribute, but instead of defining the text directly in the attribute, you use a reference to text that already exists on the page. The existing text must have an `id` attribute, which will be used for the reference value in the `aria-labelledby` attribute.\n+\n+Here's an example:\n+\n+```html\n+<input type=\"text\" aria-labelledby=\"search-btn\">\n+<button type=\"button\" id=\"search-btn\">Search</button>\n+```\n+\n+In this case, the text for the button is being used as the label for the search input. Screen readers will announce the input as something like `Search, edit`. If you later decide you want to change the button text to `Find`, the label for the input will automatically be updated to the new text since it is referencing the button text.\n+Combining multiple `id` values into a single `aria-labelledby` attribute value is also possible. Here's how that works:\n+\n+```html\n+<div>\n+  <span id=\"volume-label\">Volume</span>\n+  <span id=\"volume-details\">Adjust the volume level</span>\n+  <input\n+    type=\"range\"\n+    min=\"0\"\n+    max=\"100\"\n+    value=\"30\"\n+    aria-labelledby=\"volume-label volume-details\">\n+</div>\n+```\n+\n+For the slider, the screen reader will look out for the content of the `volume-label` and `volume-details` elements and announce `Volume Adjust the volume level`.\n+\n+You've seen that both `aria-label` and `aria-labelledby` attributes help screen readers understand what elements do. So, which one should you use? Since they both provide the same functionality, either can be used, but there may be a few advantages to using `aria-labelledby` over `aria-label`:\n+\n+- If someone is using a translation service to translate the content on your page, the text in an `aria-label` attribute may not always be translated. \n+- Using `aria-labelledby` can also help prevent a mismatch between the visible label text and the invisible label for screen reader users since updating the visible text will automatically update the invisible label. \n+- `aria-labelledby` can make it much easier to programmatically create complex invisible labels consisting of multiple sources of text.\n+\n+One last note, do not use `aria-label` and `aria-labelledby` on an element at the same time. In this case, the invisible label for screen readers will always be determined by `aria-labelledby` and `aria-label` will be completely ignored. \n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "190b555620572a32e9409c3a05a6d94b61e762a4",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a54bc58319c8fe6f78ad4.md",
            "status": "modified",
            "additions": 48,
            "deletions": 0,
            "changes": 48,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a54bc58319c8fe6f78ad4.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a54bc58319c8fe6f78ad4.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a54bc58319c8fe6f78ad4.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,54 @@ dashedName: what-is-the-aria-hidden-attribute\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What is the `aria-hidden` attribute, and how does it work?\n+\n+If you ever need to display content while at the same time hiding it from people who use assistive technology, like screen readers, you can use the `aria-hidden` attribute.\n+\n+You just need to add it to the HTML element that you want to hide and set its value to `true`, like you can see over here: `aria-hidden=\"true\"`.\n+\n+This attribute hides the element and all of its children from the accessibility tree, while keeping them visible on the page. Common use cases include:\n+\n+- Icons and images that only have a decorative purpose.\n+- Duplicated content.\n+\n+It is important to remember that `aria-hidden` only hides content from assistive technology, such as screen readers. If the content should be hidden from everyone, then you should not use `aria-hidden` to hide it. For example, a hamburger menu that is currently collapsed must be hidden from all keyboard users, not just screen reader users. In this case you could set the CSS `display` property to `none` on the menu to remove it from the DOM when it is collapsed.\n+\n+You should never use `aria-hidden` to hide an element that is focusable with the keyboard. The `aria-hidden` attribute only removes the element from the accessibility tree. It does not remove it from the DOM. Thus, it will still be possible for screen reader users to tab to the element, but their screen reader will not announce the element, effectively causing them to focus on \"nothing\".\n+\n+Here's an example where we hide an icon from the accessibility tree by adding the `aria-hidden` attribute with a value of `true`.\n+\n+We only keep the text exposed to assistive technologies to avoid any confusion that may arise from the redundancy of having both an icon and text for the same purpose.\n+\n+```html\n+<button>\n+  <i class=\"fa-solid fa-gear\" aria-hidden=\"true\"></i>\n+  <span class=\"label\">Settings</span>\n+</button>\n+```\n+\n+You do not need to use `aria-hidden` when:\n+\n+- The HTML element already has a `hidden` attribute.\n+- The element or the element's ancestor is already hidden with `display: none`.\n+- The element or the element's ancestor is already hidden with `visibility: hidden`.\n+\n+In these three cases, the element is already removed from the DOM and thus hidden from the accessibility tree, so the `aria-hidden` attribute is not necessary.\n+\n+As with using any aria attributes, you should always test with assistive technologies, and preferably having people with disabilities test your work, to make sure that it's easy to understand, even with these hidden elements.\n+\n+You should also know that setting `aria-hidden` to `false` will not expose the element to assistive technologies if any of its parents has this attribute set to `true`.\n+\n+The `aria-hidden` attribute is used to hide elements from people who use assistive technology, such as screen reader users.\n+\n+While it can be helpful for hiding purely decorative elements and duplicated content, it should be used sparingly to avoid hindering accessibility.\n+\n+In general, all content and functionality available on the page should also be available to people using assistive technology. The use case for `aria-hidden` is very narrow and should be limited primarily to making the experience cleaner for screen reader users by removing purely decorative or duplicate information. Do not use `aria-hidden` to hide content that you don’t think screen reader users would be interested in. Screen reader users deserve to have access to all information on the page.\n+\n+By following these best practices and testing the user experience, you can create inclusive online experiences for everyone.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "db0504a78a4ec781ff89230439756b8cc8dd2bde",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a54ce90c19e9038f481d7.md",
            "status": "modified",
            "additions": 65,
            "deletions": 0,
            "changes": 65,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a54ce90c19e9038f481d7.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a54ce90c19e9038f481d7.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a54ce90c19e9038f481d7.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,71 @@ dashedName: what-is-the-aria-expanded-attribute\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What is the `aria-expanded` attribute, and how does it work?\n+\n+The `aria-expanded` attribute is used for accessibility purposes to indicate if a control is expanded or collapsed. It's used in conjunction with collapsible widgets like menus, accordions and other disclosure widgets that control the visibility of content. The `aria-expanded` attribute is set to `true` if the control is expanded, or `false` if it is collapsed.\n+\n+The information provided by `aria-expanded` allows people using screen readers to understand the current state of the control (whether it is expanded or collapsed).\n+\n+The `aria-expanded` attribute is applied to the interactive element that toggles the visibility of a collapsible widget. For example, if a button toggles a expandable menu, the `aria-expanded` attribute is placed on the button.\n+\n+When the menu is expanded, the `aria-expanded` attribute should be set to `true` like in this example:\n+\n+```html\n+<button aria-expanded=\"true\">Menu</button>\n+```\n+\n+When the menu is collapsed, it should be set to `false` instead.\n+\n+```html\n+<button aria-expanded=\"false\">Menu</button>\n+```\n+\n+You must always have the `aria-expanded` attribute set to either `true` or `false` on the controlling element. For example, if a button toggles the visibility of a menu, the default value for `aria-expanded` should be  based on the default visibility of the menu.\n+\n+If the menu is expanded by default, `aria-expanded` should initially be set to `true`. If the menu is collapsed by default, `aria-expanded` should initially be set of `false`.\n+\n+The value of `aria-expanded` should be updated dynamically using JavaScript as the user interacts with the element.\n+\n+Additionally, the properties, `aria-controls` and `aria-owns` can be used in combination with `aria-expanded` to establish a programmatic connection between the controlling element and the element it controls.\n+\n+Let's start with `aria-controls`. When used with `aria-expanded`, the `aria-controls` attribute is used to specify the element being controlled. For example, a button might expand or collapse a list acting as a menu. The value of `aria-controls` will be the `id` of the controlled element (the menu list in this example).\n+\n+```html\n+<button aria-expanded=\"false\" aria-controls=\"menu1\">Menu</button>\n+<ul id=\"menu1\">\n+  <li>...</li>\n+  <li>...</li>\n+</ul>\n+```\n+\n+Notice that the list immediately follows the controlling button. For expandable controls like this, it is best to have the expanded content immediately follow the element that controls it in the DOM. This prevents screen reader users from having to search for the expanded content, and makes it easier for keyboard users to navigate through any interactive controls in the expanded content.\n+\n+If it is not possible to place the expanded content immediately after the controlling element, the `aria-owns` attribute allows you to virtually move it after the control in the accessibility tree. This allows assistive technology like screen readers to pretend the expanded content is placed directly after the control in the DOM.  \n+\n+```html\n+<button aria-owns=\"menu1\" aria-expanded=\"true\">Menu</button>\n+<main>\n+  <!-- an entire page worth of content --->\n+</main>\n+<ul id=\"menu1\">\n+  <li>...</li>\n+  <li>...</li>\n+</ul>\n+```\n+\n+There are drawbacks to using the `aria-owns` attribute. It creates unnecessary verbosity for screen reader users since most screen readers will automatically read out the entire contents of the expanded element when first expanded. It also does not change the tab order, potentially forcing keyboard users to tab through all of the other interactive controls on the page before reaching the expanded content, unless you manage the tabbing order with JavaScript.\n+\n+Ideally, the expandable content should be placed after the control element, and the `aria-owns` attribute should only be used in a worst case scenario when that is not possible. If it must be used, you will need to thoroughly test with a wide range of screen readers and browsers to ensure that your implementation is accessible for everyone.\n+\n+And just a reminder, when you use either `aria-controls` or `aria-owns`, the value of `aria-expanded` must continue to be updated as the control is expanded and collapsed.\n+\n+The `aria-expanded` attribute indicates whether a control  is expanded or collapsed. This information is essential for screen reader users, helping them understand the current state of collapsible elements like menus, accordions, and other similar disclosure widgets.\n+\n+By using `aria-expanded` correctly, you can create an intuitive user experience for everyone.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "c6e4fd65c2336504c720fb9323113888550b3e1d",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a54dff9dc439089f1a219.md",
            "status": "modified",
            "additions": 46,
            "deletions": 0,
            "changes": 46,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a54dff9dc439089f1a219.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a54dff9dc439089f1a219.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a54dff9dc439089f1a219.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,52 @@ dashedName: what-is-the-aria-live-attribute\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What is the `aria-live` attribute and how does it work?\n+\n+The `aria-live` attribute creates a live region on your page which can be used to notify screen reader users of dynamic content changes in the live region as they occur.\n+\n+Common uses of live regions include messages that are displayed after an action has been taken (such as an error message or confirmation), content that updates periodically (such as a ticker, marquee, or countdown timer), or general status messages (such as updates about a process).\n+\n+Because the reading focus for screen readers can only be at one place at a time, screen reader users will not notice a content change if their focus is on another part of the page. Live regions allow screen reader users to be automatically notified of changes that happen on the page in real time. Without a live region, screen reader users might miss important content updates available to sighted users, since a sighted user has the ability to scan the entire page. \n+\n+There are three possible values for this attribute, based on the priority of the information.\n+\n+If you set `aria-live` to the value `assertive` that means that the update is very important. It has the highest priority, so the user should be notified immediately.\n+\n+This means that the screen reader will interrupt any announcement it is currently making to announce the content change in the live region. Such interruptions can be extremely disruptive, so the `assertive` value should only be used for time-sensitive or critical notifications.\n+\n+```html\n+<div aria-live=\"assertive\">\n+  <p>Your session will expire in 30 seconds.</p>\n+</div>\n+```\n+\n+The next value in order of priority is `polite`.\n+\n+This value means that the update is not urgent, so the screen reader can wait until any current announcement is finished or until the user stops typing before announcing the update. Most live regions will use the `polite` value.\n+\n+```html\n+<div aria-live=\"polite\">\n+  <p>File successfully uploaded</p>\n+</div>\n+```\n+\n+The lowest priority value for `aria-live` is `off` which means that the update will not be announced unless the content is in an element that currently has keyboard focus. Realistically, this value is almost never used as the use case is very narrow and it is not implemented consistently (if at all) across screen readers. If you need live regions, plan on using `polite` for everything except critical messages that need `assertive`.\n+\n+It's also important to note that the `aria-live` attribute is not required if the updated information is contained in an element with an ARIA role of `alert`, `log`, `marquee`, `status`, or `timer`, as these roles already have default `aria-live` values. But the default value can be changed by explicitly setting `aria-live` on the element.\n+\n+Choosing the right `aria-live` value depends on the priority of the updated information.\n+\n+If the updates are urgent, you should notify the user immediately with `assertive`. But you should use this only if the updates are really urgent because sudden interruptions can potentially disorient users and affect the user experience.\n+\n+If the update can wait until the current task is finished, you should use `polite` instead.\n+\n+The `aria-live` attribute lets assistive technologies know when the content is changing dynamically on a web page. This helps users with disabilities stay updated on important announcements and updates.\n+\n+By using `aria-live` appropriately, you can ensure that users are aware of these updates based on their priority.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "58600800e2536fb2c81a6c5afda3ae23a6348072",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a54f29d783890d1f94740.md",
            "status": "modified",
            "additions": 94,
            "deletions": 0,
            "changes": 94,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a54f29d783890d1f94740.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a54f29d783890d1f94740.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a54f29d783890d1f94740.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,100 @@ dashedName: what-are-some-common-aria-states-used-on-custom-control-elements\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are some common ARIA states used on custom control elements?\n+\n+Semantic form control elements like `input`, `select`, `textarea`, `button`, and `fieldset` have built-in states that are conveyed to assistive technologies.\n+\n+For example, you could use the `disabled` attribute to disable a button or the `checked` attribute to indicate that a checkbox is checked.\n+\n+But if you are creating a custom control element, you need to use ARIA attributes to convey the state of the control to assistive technologies.\n+\n+In this lecture video, we will discuss a few common ARIA states that you can use on custom control elements.\n+\n+The first ARIA state we will discuss is `aria-selected`. This state is used to indicate that an element is selected. You can use this state on custom controls like a tabbed interface, a listbox, or a grid.\n+\n+Here is an example of how you can use `aria-selected` on a custom tab control:\n+\n+```html\n+<div role=\"tablist\">\n+  <button role=\"tab\" aria-selected=\"true\">Tab 1</button>\n+  <button role=\"tab\" aria-selected=\"false\">Tab 2</button>\n+  <button role=\"tab\" aria-selected=\"false\">Tab 3</button>\n+</div>\n+```\n+\n+Tabs are used to display multiple panels of content in a limited space. The `aria-selected` state is used to indicate which tab is currently selected.\n+\n+When the user selects a tab, the `aria-selected` state of the selected tab is set to `true`, and the `aria-selected` state of the other tabs is set to `false`.\n+\n+Another common ARIA state is `aria-disabled`. This state is used to indicate that an element is disabled only to people using assistive technologies, such as screen readers. It is important to note that `aria-disabled` does not actually disable the element. It is up to you, the developer, to make it look and act like a disabled element. This attribute is also commonly used on native HTML elements in place of the `disabled` attribute. Which one you choose will depend on the context the button is being used.\n+\n+Here is an example of how you can use `aria-disabled` on a custom edit button:\n+\n+```html\n+<div role=\"button\" tabindex=\"-1\" aria-disabled=\"true\">Edit</div>\n+```\n+\n+The `aria-disabled` attribute is used to tell screen reader users that the edit button is disabled and cannot be interacted with. Again, it does not actually disable the button. When using `aria-disabled`,you will need to apply styling and JavaScript to make the control look and behave like a disabled button.\n+\n+In most cases, you will probably use the native button element, but there are cases where you might need to use a custom control. So, it is essential to know how to convey the state of the control to assistive technologies.\n+\n+The next ARIA state we will discuss is `aria-haspopup`. This state is used to indicate that an interactive element will trigger a popup element when activated. You can only use the `aria-haspopup` attribute when the popup has one of the following roles: `menu`, `listbox`, `tree`, `grid`, or `dialog`. The value of `aria-haspopup` must be either one of these roles or `true`, which defaults to the `menu` role. \n+\n+Here is an example of a file editor menu  that uses `aria-haspopup`:\n+\n+```html\n+<button id=\"menubutton\" aria-haspopup=\"menu\" aria-controls=\"filemenu\" aria-expanded=\"false\">File</button>\n+<ul id=\"filemenu\" role=\"menu\" aria-labelledby=\"menubutton\" hidden>\n+  <li role=\"menuitem\" tabindex=\"-1\">Open</li>\n+  <li role=\"menuitem\" tabindex=\"-1\">New</li>\n+  <li role=\"menuitem\" tabindex=\"-1\">Save</li>\n+  <li role=\"menuitem\" tabindex=\"-1\">Delete</li>\n+</ul>\n+```\n+\n+The `aria-haspopup` state is used to indicate that the `File` menu button will open a popup menu when activated. Screen reader users may hear this additional information when they navigate to the button.\n+\n+You will need to use JavaScript to show and hide the popup menu, and to implement proper keyboard support for interacting with the menu. Also, please note that the ARIA `menu` role refers to a very specific type of menu. It generally refers to a list of actions that the user can invoke, similar to a menu on a desktop application. It does not include more common uses of what we typically refer to as \"menus\", such as navigation menus. Realistically, most \"menus\" you create on the web will not be ARIA menus and you will not use `aria-haspopup` with them.\n+\n+The next ARIA state we will discuss is `aria-required`. The `aria-required` attribute is used to indicate that a field needs to be filled out before the form is submitted.\n+Here is an example of working with the `aria-required` attribute for a custom form control.\n+\n+```html\n+<div id=\"name-label\">Full Name*</div>\n+<div role=\"textbox\" contenteditable aria-labelledby=\"name-label\" aria-required=\"true\" id=\"name\"></div>\n+```\n+\n+We need to use the `contenteditable` attribute so users can type in their input. We are also using the `aria-required` attribute set to `true` to indicate that this custom form control is required.\n+\n+To make the form control look like a normal form control, you would need to add CSS. You would also need to add JavaScript to prevent the form from being submitted without content.\n+\n+If the label already has the word `required`, then you should omit the `aria-required` attribute. This ensures that screen readers only announce the word required once.\n+\n+In most cases, you will probably use the native `label` and `form` elements with the `required` attribute. But if you need to create a custom form control, then it is important to add the `aria-required` attribute when necessary.\n+\n+Additionally, the `aria-required` attribute can also be used on native form inputs, such as the `input`, `textarea`, and `select` elements. This is often preferred to the native required attribute, since the required attribute may have potential usability and accessibility concerns, particularly with the default error handling provided by the browser. Ultimately, you will need to test in order to determine which attribute is best for your situation.\n+\n+The last ARIA state we will discuss is `aria-checked`. This attribute is used to indicate whether an element is in the checked state. It is most commonly used when creating custom checkboxes, radio buttons, switches, and listboxes.\n+\n+Here is an example of how you can use `aria-checked` on a custom checkbox control:\n+\n+```html\n+<div role=\"checkbox\" aria-checked=\"true\" tabindex=\"0\">Checkbox</div>\n+```\n+\n+Native checkbox elements have a built-in `checked` state that is conveyed to assistive technologies. But if you are creating a custom checkbox control, you will need to use the `aria-checked` attribute to indicate its state.\n+\n+When the user interacts with the custom checkbox control, you will need to use the `aria-checked` state to reflect the new state of the checkbox. When the checkbox is checked, the `aria-checked` attribute is set to `true`. When it is unchecked, it is set to `false`.\n+\n+Native elements typically have better support and built-in accessibility features.\n+\n+However, if you must create custom controls, using ARIA attributes is essential to convey the state of these controls to assistive technologies effectively.\n+\n+As always, test your work to ensure that ARIA attributes are applied correctly and that the custom control functions in a way that is both accessible and user-friendly.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "5bac4111ef849eaf4afa92d8b8462382ca21cf2b",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a5507d857a891139abc7f.md",
            "status": "modified",
            "additions": 49,
            "deletions": 0,
            "changes": 49,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a5507d857a891139abc7f.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a5507d857a891139abc7f.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a5507d857a891139abc7f.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,55 @@ dashedName: what-is-the-aria-controls-attribute\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What is the `aria-controls` attribute, and how does it work?\n+\n+The `aria-controls` attribute is used to create a programmatic relationship between an element that controls the presence of another element on the page, and the element it controls. This relationship can help screen reader users better understand how the control works. Common uses include a set of tabs that control the visibility of different sections of content, or a button that toggles the visibility of a menu.\n+\n+Let's take a look at an example to see how this works.\n+In this example of a tabbed interface, we have a `div` element with a set of three buttons:\n+\n+```html\n+<div role=\"tablist\">\n+  <button role=\"tab\" id=\"tab1\" aria-controls=\"section1\" aria-selected=\"true\">\n+    Tab 1\n+  </button>\n+  <button role=\"tab\" id=\"tab2\" aria-controls=\"section2\" aria-selected=\"false\">\n+    Tab 2\n+  </button>\n+  <button role=\"tab\" id=\"tab3\" aria-controls=\"section3\" aria-selected=\"false\">\n+    Tab 3\n+  </button>\n+</div>\n+```\n+\n+Each button represents a tab and has a `role` attribute set to `tab`. In most tabbed interfaces, the first tab panel is visible by default, so the first tab button has an `aria-selected` attribute set to `true` to indicate that its associated section of content is currently visible The `aria-controls` attribute is used to associate each button with the section of content that it controls.\n+\n+Here are the three sections of content that correspond to the tabs:\n+\n+```html\n+<div id=\"section1\" role=\"tabpanel\" aria-labelledby=\"tab1\">\n+  Section 1 content\n+</div>\n+\n+<div id=\"section2\" role=\"tabpanel\" aria-labelledby=\"tab2\" hidden>\n+  Section 2 content\n+</div>\n+\n+<div id=\"section3\" role=\"tabpanel\" aria-labelledby=\"tab3\" hidden>\n+  Section 3 content\n+</div>\n+```\n+\n+Each section of content has a `role` attribute set to `tabpanel` and an `aria-labelledby` attribute that points to the corresponding tab to give the panel an accessible name. The `hidden` attribute is used to hide the sections of content that are not currently selected. Each section id matches the value of the `aria-controls` attribute on the corresponding button. The `section1` id matches the `aria-controls` attribute on the first button, `section2` matches the `aria-controls` attribute on the second button, and `section3` matches the `aria-controls` attribute on the third button. This is how the association between the tabs and their sections of content is established.\n+\n+To switch between the different sections you will need to use JavaScript to update the `hidden` attribute on the section and the `aria-selected` attribute on the button based on which section is currently visible. Only one section can be visible at a time and it should not have the `hidden` attribute and `aria-selected` should be set to `true` on its button. The remaining hidden sections should all have the `hidden` attribute and `aria-selected` should be set to `false` on their buttons.\n+\n+Tabs are a common use case for the `aria-controls` attribute, but it can be used in other scenarios where one element controls the visibility or behavior of another element. Other examples include accordions, dropdown menus, and modals.\n+\n+The next time you design a user interface that involves controlling the visibility  of elements, consider using the `aria-controls` attribute to establish the relationship between the controlling element and the controlled element.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "f2344e82e2b2bed4c117b2cf8f492112a13ed9ed",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a551975938a916c74802c.md",
            "status": "modified",
            "additions": 34,
            "deletions": 0,
            "changes": 34,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a551975938a916c74802c.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a551975938a916c74802c.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a551975938a916c74802c.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,40 @@ dashedName: what-is-the-aria-describedby-attribute\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What is the `aria-describedby` attribute, and how does it work?\n+\n+The `aria-describedby` attribute is used to provide additional information about an element to screen reader users by referencing existing content on the page. It creates a programmatic association between the element and the content (technically referred to as an accessible description), which screen readers can use to inform users of the additional information when they interact with the element. \n+\n+The most common use for `aria-describedby` is to associate instructions and error messages with form inputs. Due to the various methods screen reader users have for navigating a page, they may miss these messages when navigating between inputs. Using `aria-describedby` helps ensure that they will hear them.\n+\n+Let's take a look at a few examples to understand how it works. In this first example, we have a `form` element that accepts a password:\n+\n+```html\n+<form>\n+  <label for=\"password\">Password:</label>\n+  <input type=\"password\" id=\"password\" aria-describedby=\"password-help\" />\n+  <p id=\"password-help\">Your password must be at least 8 characters long.</p>\n+</form>\n+```\n+\n+We are using a `label` element for the `Password` text and associating that with the password `input` field.\n+\n+We also have a paragraph element that describes the password requirements. We are using the `aria-describedby` attribute to associate the password `input` field with the password requirements in the paragraph element. When a screen reader user interacts with this `input`, their screen reader will announce the name of the `input` (`Password`) and may then also announce the password requirements. This is not an absolute guarantee however as some screen readers may not automatically announce the additional content, or may only announce it in specific circumstances. This is not uncommon. Each screen reader is different and handles ARIA attributes in their own way. This does not negate the use of `aria-describedby`, as it will benefit screen reader users in general.\n+\n+Another good use case for the `aria-describedby` attribute is when you have a delete `button`. Here is an example of a delete `button` followed by a message describing what will happen when the button is clicked:\n+\n+```html\n+<button aria-describedby=\"delete-message\">Delete</button>\n+\n+<p id=\"delete-message\">Warning! All deletions are permanent.</p>\n+```\n+\n+Just like in the earlier example, we associate the delete button with the message using the `aria-describedby` attribute. The `id` value and the value of the `aria-describedby` attribute must match. \n+\n+The `aria-describedby` attribute is a powerful attribute that can be used to help ensure that additional information about an element is provided to screen reader users when they interact with the element. It is most commonly used to associate instructions and error messages with form inputs in order to reduce the chance that screen reader users will miss these messages as they navigate the form. \n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "7e6e3b3cf4cbd592662d90dd05ae8afa27999783",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a55b5c0c14493328fe36e.md",
            "status": "modified",
            "additions": 75,
            "deletions": 0,
            "changes": 75,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a55b5c0c14493328fe36e.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a55b5c0c14493328fe36e.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a55b5c0c14493328fe36e.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,81 @@ dashedName: when-is-the-alt-attribute-needed\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+When is the `alt` attribute needed, and what are some examples of good `alt` text?\n+\n+Alternative text, often abbreviated as `alt` text, is a brief text description of an image. It provides essential information about the image for users who cannot see it, such as people who use screen readers and other assistive technologies.\n+\n+It's essential for making websites accessible to people with visual disabilities.\n+\n+Alternative text is also used by search engines to understand images. Some browsers may also display it when an image is not loaded properly. This can happen when the image file is missing or when the user has connectivity issues. So it's helpful for many different purposes.\n+\n+A person with a visual disability will not be able to know what's in the image unless it's described in the alt text.  An example of bad alt text for an image of a puppy would be \"A cute puppy.\" This text is not specific enough to convey the important details of the image, like what does the puppy look like? Where is the puppy? Are there any important objects around the puppy?\n+\n+Let's improve this. An example of good alternative text would be: \"A black and white puppy with an orange collar lies on its belly in the sand, looking off to the side. A bright orange ball rests near its front paws.\"\n+\n+Here you can see this in HTML with an image element, the `alt` attribute, and a more detailed description:\n+\n+```html\n+<img src=\"puppy.png\" alt=\"A black and white puppy with an orange collar lies on its belly in the sand, looking off to the side. A bright orange ball rests near its front paws.\" />\n+```\n+\n+It is important to note that there is no one correct way to write alt text for an image. What you include in your description will depend on the context the picture is used in. For example, if the puppy picture was on a website about dog breeds, you might want to include more specifics about the physical description of the puppy and possibly ignore the fact that the puppy is at the beach playing with an orange ball. Ultimately, the `alt` text you use for an image should reflect the primary purpose for including the image on the page, and the information you provide should give people who can't see the image the necessary details to understand that purpose.\n+\n+Here we have another example of a beautiful tropical resort. Let's describe it.\n+\n+An example of bad `alt` text for this image would be \"Resort.\"\n+\n+This is too short and it doesn't provide enough information about the image. To improve this description, you could expand it to include the most important elements of the image:\n+\n+\"Tropical resort featuring a swimming pool surrounded by palm trees and bungalows.\"\n+\n+You can use the alt attribute in HTML like this:\n+\n+```html\n+<img src=\"resort.png\" alt=\"Tropical resort featuring a swimming pool surrounded by palm trees and bungalows.\" />\n+```\n+\n+Now that you know what makes good and bad `alt` text, let's see some of the best practices.\n+\n+- You should try to keep `alt` text short. It should be detailed enough to understand the image but not so long that it becomes confusing.\n+- You should not try to describe every little detail. Focus on the most important aspects of the image.\n+- Generally, you don't need to start with \"image of\" or \"picture of.\" You can just start the description directly.\n+- Also, if there's similar text around the image, you don't need to write it again.\n+- It's usually recommended to end the alt text with a period for consistency.\n+- If the image is a link to another page, instead of describing the image itself, the `alt` text should describe what will happen if users click on it.\n+\n+For example, if your website has a right arrow icon that takes the user to the next page, instead of writing an alt text that only says \"right arrow\", like in this example, where you can see the alt attribute with this description:\n+\n+```html\n+<a href=\"about.html\">\n+  <img src=\"arrow-right.png\" alt=\"Right arrow.\" />\n+</a>\n+```\n+\n+You should write something like this instead, where the `alt` text describes what will happen if users clicks on the image. They will go to the next page.\n+\n+```html\n+<a href=\"about.html\">\n+  <img src=\"arrow-right.png\" alt=\"Go to next page.\" />\n+</a>\n+```\n+\n+Only images that convey important information should have `alt` text. If an image is only used for decorative purposes, it should have `null` (empty) `alt` text, so it can be ignored by screen readers and other assistive technologies.\n+\n+Here is an example of an empty `alt` attribute is empty:\n+\n+```html\n+<img src=\"decorative_image.jpg\" alt=\"\" />\n+```\n+\n+Every image on your website should have an `alt` attribute, even if it's empty. If you omit the `alt` attribute completely, some screen readers will read the file name instead, which can be distracting for people who use assistive technologies, so this is not recommended.\n+\n+Finally, before your website is live, you should carefully test if screen readers can read the `alt` text correctly.\n+\n+Writing effective `alt` text is essential for creating accessible web content. As a web developer, by providing clear descriptions of your images, you can make sure that everyone can engage with your website in an inclusive online experience.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "007481acee34276d59089e80f60ab2e94da784d8",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a55dd1d86bc939606e204.md",
            "status": "modified",
            "additions": 77,
            "deletions": 0,
            "changes": 77,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a55dd1d86bc939606e204.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a55dd1d86bc939606e204.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a55dd1d86bc939606e204.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,83 @@ dashedName: what-are-the-accessibility-benefits-for-good-link-text\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are the accessibility benefits for good link text, and what are examples of good link text?\n+\n+Let's take a look at the benefits of writing good link texts in the context of accessibility, and some examples of good link texts.\n+\n+The first visible benefit of a good link text is that it makes it easier for everyone to find information quickly. Descriptive links help users know where they're headed and what they'll access. This ensures the user doesn't feel lost and improves the overall user experience.\n+\n+For those using screen readers, a clear and descriptive link text is a must. Screen readers read the link text aloud, so a text like \"Read our accessibility guide\" is way better than \"Click here.\"\n+\n+Making link text clear and descriptive isn't just beneficial for those living with visual impairments. Descriptive links also help people with cognitive disabilities by providing clear context.\n+\n+Here are some best practices to keep in mind while writing link texts:\n+\n+- Make sure links are visually distinct by using underlining and other visual cues, so users can easily identify and navigate them.\n+- Avoid generic link texts like \"here\", \"click here\", and \"more-info\" as they don't provide any useful information.\n+- Aim for concise and descriptive link texts, ideally between 2-5 words, that convey the link's purpose.\n+- Avoid jargon and abbreviations that users may not understand.\n+- Focus on the destination, not the action. For example, \"user behavior results\", instead of \"click here to read more\".\n+- Don’t repeat the same link text for different destinations.\n+- Place links in a way that they make sense within the surrounding text. For example, \"for more details, visit our events page\" instead of \"Click here for more\".\n+\n+Here are some examples of good link texts for specific use cases, compared to less helpful ones.\n+Let's say you want to link to a page providing details about an event like this:\n+\n+```html\n+<a href=\"webinar-details-link\">Details</a>\n+```\n+\n+`Details` is vague and doesn’t provide specific information about what the user will find if they click the link. Without additional context, users might not know if the link leads to details about a webinar, a product, a policy, or something else.\n+\n+Now, here is an example of good link text:\n+\n+```html\n+<a href=\"webinar-details-link\">\n+  Get details about our upcoming webinar\n+</a>\n+```\n+\n+This link text gives users context about the content they will find, making it easier to decide whether they want to click on it. It reduces ambiguity by specifying that the link is related to a webinar.\n+\n+Here is an another example linking to a post in a blog:\n+\n+```html\n+<a href=\"/blog-post-link\">Read more</a>\n+```\n+\n+The link text `Read more` is not ideal in terms of accessibility because it lacks context.\n+\n+Here is a better link text example:\n+\n+```html\n+<a href=\"/blog-post-link\">\n+   Read our latest blog post on web accessibility\n+</a>\n+```\n+\n+This updated link text provides users with a clearer idea of what to expect and why they might want to click the link, which is particularly important for those using screen readers.\n+\n+Let's take a look at one more example. Let's say you want to provide more information about a certain topic:\n+\n+```html\n+<a href=\"/link-to-topic\">More info</a>\n+```\n+\n+`More info` is also vague and can be problematic for accessibility. It doesn't provide specific details about the link's destination, which can be confusing for users relying on screen readers or those who might be navigating the site in a non-linear way.\n+\n+Here is a better example for link text:\n+\n+```html\n+<a href=\"/link-to-topic\">\n+   Learn more about our accessibiltiy efforts\n+</a>\n+```\n+\n+This updated link text is better because it clearly describes what the user will find if they click the link. Users can immediately understand that the link leads to information about your accessibility efforts.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "df87dec3af5613e47c0d71e78a3ba89dbb51b236",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a55eb7791559421ff0cd3.md",
            "status": "modified",
            "additions": 73,
            "deletions": 0,
            "changes": 73,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a55eb7791559421ff0cd3.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a55eb7791559421ff0cd3.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a55eb7791559421ff0cd3.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,79 @@ dashedName: what-are-good-ways-to-make-audio-and-video-content-accessible\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are good ways to make audio and video content accessible?\n+\n+Multimedia, especially video, has become the go-to format for sharing information online.\n+\n+With this surge in content, there's a growing need to ensure everyone can access and enjoy video and audio content online, irrespective of their abilities or environment.\n+\n+Making your audio and video content accessible isn't just a nice-to-have, it's essential for reaching a wider audience. Let's look at some inexpensive ways to make your video and audio content more accessible.\n+\n+A video is not just about visuals but also audio, so the first thing you should consider doing is adding captions or subtitles to your video content.\n+\n+Captions provide the text version of spoken words and important non-verbal sounds, like music or laughter, synchronized with the video. \n+\n+Subtitles on the other hand are essential for people who don't understand the language you're speaking. This helps not only people who are deaf or hard of hearing but also those watching videos in noisy or quiet environments.\n+\n+To add captions or subtitles to your video or audio content, you can use the `track` element inside your `video` or `audio` element:\n+\n+```html\n+<!-- Video -->\n+<video controls src=\"video.mp4\">\n+  <track\n+      src=\"captions.vtt\" \n+      kind=\"captions\"\n+      srclang=\"en\"\n+      label=\"English\" \n+  />\n+</video>\n+\n+<!-- Audio -->\n+<audio controls src=\"audio.mp3\">\n+   <track\n+       src=\"captions.vtt\"\n+       kind=\"captions\"\n+       srclang=\"en\"\n+       label=\"English\"\n+   />\n+</audio>\n+```\n+\n+The `kind` attribute is used to tell the track element how it should be used. Valid values for the `kind` attribute include `captions`, `subtitles`, `chapters`, and `metadata`.\n+\n+The `srclang` attribute represents the language for the `track` content. The `label` attribute is a descriptive title for the text track that browsers use to identify and display it in the list of available text tracks.\n+\n+Another important thing to consider is providing a transcript for your audio and video content. A transcript is a text version of all the spoken words in your audio or video. Unlike captions, transcripts don’t need to be synchronized with the media. Transcripts are useful for deaf people and those hard of hearing. They're also beneficial for people who prefer reading instead of watching or listening. Transcripts also make your content searchable, allowing users to quickly find specific parts of your audio or video. If you have a video or audio on a website, you can simply add the captions below the audio or video:\n+\n+```html\n+<audio controls>\n+  <source src=\"audio.mp3\" />\n+  Your browser does not support the audio element.\n+</audio>\n+\n+<!-- Transcript -->\n+<h3>Transcript</h3>\n+<p>\n+  [Speaker 1]: Welcome to the tutorial on making accessible content\n+</p>\n+<p>\n+  [Speaker 2]: Today, we'll cover captions, transcripts, and more.\n+</p>\n+\n+<!-- Rest of transcript -->\n+```\n+\n+If you're publishing videos on a video-sharing platform like YouTube or Vimeo, they have automatic captions and transcripts for videos. But if you're not satisfied, you can use services like veed.io, Rev, Amara, and Descript.\n+\n+Other ways to make your video and audio content accessible include:\n+\n+- Adding a sign language overlay for videos for deaf people and those hard of hearing.\n+- Providing volume and speed controls.\n+- Ensuring good contrast for on-screen text.\n+- Offering multiple formats.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "34730d0fddf0eca49472e0fe4565b291c5098973",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-importance-of-accessibility-and-good-html-structure/672a55fbc2d95a9453151caf.md",
            "status": "modified",
            "additions": 61,
            "deletions": 0,
            "changes": 61,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a55fbc2d95a9453151caf.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b157a216c09110c5b67a277159f1a900822f42b6/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a55fbc2d95a9453151caf.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-importance-of-accessibility-and-good-html-structure%2F672a55fbc2d95a9453151caf.md?ref=b157a216c09110c5b67a277159f1a900822f42b6",
            "patch": "@@ -10,6 +10,67 @@ dashedName: what-are-some-ways-to-make-web-applications-keyboard-accessible\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What are some ways to make web applications keyboard accessible?\n+\n+Many users rely on keyboards instead of mice due to physical disabilities, repetitive strain injuries, or personal preference. This includes users of screen readers and those who may not have a working mouse.\n+Keyboard accessibility ensures these users can navigate web applications effectively without barriers.\n+\n+Let's look at some practical techniques you can employ to make web applications keyboard accessible.\n+\n+Many users use the `Tab` key to navigate through interactive elements on a webpage. The `tabindex` attribute is used to make elements focusable and define the relative order in which they should be navigated using the keyboard. It takes a numerical value, which can be positive, zero, or negative.\n+\n+Here is the basic syntax:\n+\n+```html\n+<element tabindex=\"number\">Element Text</element>\n+```\n+\n+It is important to never use the `tabindex` attribute with a value greater than `0`. Instead, you should either use a value of `0` or `-1`.\n+\n+You can set the `tabindex` to `-1` to allow it to receive programmatic focus. This is used in a variety of situations for \"focus management\", such as when you need to set the focus on a heading, error message, or dialog, or you are building custom components such as tabbing interfaces or tree components.\n+\n+```html\n+<p tabindex=\"-1\">Sorry, there was an error with your submission.</p>\n+```\n+\n+Setting `tabindex` to `0` allows you to add an element that does not receive keyboard focus by default into the page's natural tab order. This allows keyboard users to `Tab` to the element. This is primarily used when building custom elements that need keyboard functionality. \n+\n+```html\n+<div role=\"combobox\" tabindex=\"0\">\n+```    \n+\n+`accesskey` is another attribute you can use to make your web project keyboard accessible. It allows you to define a key that focuses on or activates a particular element:\n+\n+```html\n+<button accesskey=\"s\">Save</button>\n+<button accesskey=\"c\">Cancel</button>\n+<a href=\"index.html\" accesskey=\"h\">Home</a>\n+```\n+\n+In the above code:\n+\n+- `accesskey=\"s\"` assigns the key `S` to the `Save` button. On most browsers, pressing `ALT + S` (on Windows) and `CTRL + Option + S` (on Mac) will activate this button.\n+- `accesskey=\"c\"` sets the key `C` to the `Cancel` button, allowing users to activate it using `ALT + C` (Windows) and `CTRL + Option + C` (Mac).\n+- `accesskey=\"h\"` assigns the key `H` to the `Home` link, allowing users to navigate to the homepage using `ALT + H` (Windows) and `CTRL + Option + H` (Mac).\n+\n+Please note that the exact key combination to activate the accesskey might vary depending on the browser and operating system. It's typically `ALT + Specified Key` on Windows and `CTRL + Option + Specified Key` on Mac.\n+\n+Another way to make the keyboard accessible in your apps is to make sure you provide clear focus indicators. If you feel the default browser focus indicator is not enough, you can override it by targeting the focus state of the element.\n+\n+Here is an example of styling the focus state for an HTML element:\n+\n+```css\n+element:focus {\n+  outline: 2px solid #005fcc;\n+}\n+```\n+\n+The `outline` property is used to define the outline around the element. This example sets the outline to a solid blue line with 2 pixels set for the thickness. The focus indicator should be styled in a way that makes it obvious which element currently has focus. In order to be accessible, the indicator must have a minimum color contrast of at least 3:1 with the background color it covers. \n+\n+You should also avoid keyboard traps, which occur when a user cannot move focus away from a certain element in components like modals and popups.\n+\n # --questions--\n \n ## --text--"
        }
    ],
    "stats": {
        "total": 1279,
        "additions": 1279,
        "deletions": 0
    }
}