{
    "author": "Ksound22",
    "message": "chore: update css lectures intros (#57544)\n\nCo-authored-by: Dario-DC <105294544+Dario-DC@users.noreply.github.com>\r\nCo-authored-by: Oliver Eyton-Williams <ojeytonwilliams@gmail.com>\r\nCo-authored-by: Naomi <accounts+github@nhcarrigan.com>",
    "sha": "b88a6fe200d48d34021e8b543d784e5289fa3623",
    "files": [
        {
            "sha": "c039ed57a2d7cd2d6b281d8a2251ec649964a4e2",
            "filename": "client/i18n/locales/english/intro.json",
            "status": "modified",
            "additions": 26,
            "deletions": 24,
            "changes": 50,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/b88a6fe200d48d34021e8b543d784e5289fa3623/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/b88a6fe200d48d34021e8b543d784e5289fa3623/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json?ref=b88a6fe200d48d34021e8b543d784e5289fa3623",
            "patch": "@@ -1969,19 +1969,19 @@\n       \"lecture-understanding-computer-internet-and-tooling-basics\": {\n         \"title\": \"Understanding Computer, Internet, and Tooling Basics\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about computer, internet, and tooling basics.\"\n+          \"In these lecture videos, you will learn about the computer, its different parts, internet service providers (ISPs), and the tools professional developers use.\"\n         ]\n       },\n       \"lecture-working-with-file-systems\": {\n         \"title\": \"Working with File Systems\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with file systems.\"\n+          \"In these lecture videos, you will learn how to work with file and folder systems on your computers. You will learn how to create, move, and delete files and folders, the best practices for naming and organizing files and folders, and more.\"\n         ]\n       },\n       \"lecture-browsing-the-web-effectively\": {\n         \"title\": \"Browsing the Web Effectively\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn how to browse the web effectively.\"\n+          \"In these lecture videos, you will learn about what websites, search engine, and web browsers are, the different browsers available, and how to get the best out of a search engine.\"\n         ]\n       },\n       \"review-computer-basics\": {\n@@ -1999,7 +1999,9 @@\n       },\n       \"lecture-what-is-css\": {\n         \"title\": \"What Is CSS?\",\n-        \"intro\": [\"In these lecture videos, you will learn what CSS is.\"]\n+        \"intro\": [\n+          \"The following lecture videos are all about CSS. You will learn what CSS is and its role on the web, a CSS rule and its anatomy, the three ways to write CSS and when to use each, inline and block elements, and many more.\"\n+        ]\n       },\n       \"workshop-cafe-menu\": {\n         \"title\": \"Design a Cafe Menu\",\n@@ -2018,7 +2020,7 @@\n       \"lecture-css-specificity-the-cascade-algorithm-and-inheritance\": {\n         \"title\": \"CSS Specificity, the Cascade Algorithm, and Inheritance\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about CSS specificity, the cascade algorithm, and inheritance.\"\n+          \"In these lecture videos, you will learn about CSS specificity, the common selectors and their specificities, the cascade algorithm, inheritance, and more.\"\n         ]\n       },\n       \"review-basic-css\": {\n@@ -2037,7 +2039,7 @@\n       \"lecture-styling-lists-and-links\": {\n         \"title\": \"Styling Lists and Links\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about styling lists and links.\"\n+          \"In these lecture videos, you will learn the properties you need to know to effectively style lists and links, including link states like <code>link</code>, <code>visited</code>, <code>hover</code>, and <code>active</code>.\"\n         ]\n       },\n       \"lab-stylized-to-do-list\": {\n@@ -2050,7 +2052,7 @@\n       \"lecture-working-with-backgrounds-and-borders\": {\n         \"title\": \"Working with Backgrounds and Borders\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with backgrounds and borders.\"\n+          \"In these lecture videos, you will learn about the properties and values you need to know to style backgrounds and borders of elements, alongside the accessibility considerations for backgrounds.\"\n         ]\n       },\n       \"lab-blog-post-card\": {\n@@ -2076,19 +2078,19 @@\n       \"lecture-user-interface-design-fundamentals\": {\n         \"title\": \"User Interface Design Fundamentals\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about user interface design fundamentals.\"\n+          \"In these lecture videos, you will learn about the fundamentals of user interface (UI) design. You will learn about the terms you need to know to communicate with designers, visual heirarchy, scaling, alignment, whitespace, and much more.\"\n         ]\n       },\n       \"lecture-user-centered-design\": {\n         \"title\": \"User-Centered Design\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about user-centered design.\"\n+          \"In these lecture videos, you will learn about best practices for designing user-facing features like dark mode, breadcrumbs, modal dialogs, and much more. You will also learn how to conduct user research, user requirements and testing.\"\n         ]\n       },\n       \"lecture-common-design-tools\": {\n         \"title\": \"Common Design Tools\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about common design tools.\"\n+          \"In these lecture videos, you will learn about the common design tools developers should know. You will also learn about design briefs and how developers work with them.\"\n         ]\n       },\n       \"review-design-fundamentals\": {\n@@ -2107,7 +2109,7 @@\n       \"lecture-working-with-relative-and-absolute-units\": {\n         \"title\": \"Working with Relative and Absolute Units\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with relative and absolute units.\"\n+          \"In these lecture videos, you will learn about relative and absolute units, and how they both impact what you see in the browser.\"\n         ]\n       },\n       \"lab-event-flyer-page\": {\n@@ -2133,7 +2135,7 @@\n       \"lecture-working-with-pseudo-classes-and-pseudo-elements-in-css\": {\n         \"title\": \"Working with Pseudo-Classes and Pseudo-Elements in CSS\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with pseudo-classes and pseudo-elements in CSS.\"\n+          \"In these lecture videos, you will learn about pseudo-classes and pseudo-elements, alongisde their examples and how they work.\"\n         ]\n       },\n       \"workshop-greeting-card\": {\n@@ -2166,7 +2168,7 @@\n       \"lecture-working-with-colors-in-css\": {\n         \"title\": \"Working with Colors in CSS\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with colors in CSS.\"\n+          \"In these lecture videos, you will learn about linear and radial gradients, the color theory, different kinds of colors like named, RGB, Hex, and HSL colors. You will learn how these colors work, and which to use in specific cases.\"\n         ]\n       },\n       \"workshop-colored-markers\": {\n@@ -2197,7 +2199,7 @@\n       \"lecture-best-practices-for-styling-forms\": {\n         \"title\": \"Best Practices for Styling Forms\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about the best practices for styling forms.\"\n+          \"In these lecture videos, you will learn about the best practices for styling forms and issues you can encounter while styling special inputs like <code>color</code> and <code>datetime-local</code>.\"\n         ]\n       },\n       \"workshop-registration-form\": {\n@@ -2229,7 +2231,7 @@\n       \"lecture-working-with-css-transforms-overflow-and-filters\": {\n         \"title\": \"Working with CSS Transforms, Overflow, and Filters\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with CSS transforms, overflow, and filters.\"\n+          \"In these lecture videos, you will learn about working with CSS transforms, overflow, and filters. You will also learn about the box model and how it works.\"\n         ]\n       },\n       \"workshop-rothko-painting\": {\n@@ -2261,7 +2263,7 @@\n       \"lecture-working-with-css-flexbox\": {\n         \"title\": \"Working with CSS Flexbox\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with CSS flexbox.\"\n+          \"In these lecture videos, you will learn how CSS flexbox works, its properties, and when you should use it.\"\n         ]\n       },\n       \"workshop-flexbox-photo-gallery\": {\n@@ -2294,7 +2296,7 @@\n       \"lecture-working-with-css-fonts\": {\n         \"title\": \"Working with CSS Fonts\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with CSS fonts.\"\n+          \"In these lecture videos, you will learn about typography and its best practices, fonts, and the <code>text-shadow</code> property.\"\n         ]\n       },\n       \"workshop-nutritional-label\": {\n@@ -2325,7 +2327,7 @@\n       \"lecture-best-practices-for-accessibility-and-css\": {\n         \"title\": \"Best Practices for Accessibility and CSS\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about best practices for accessibility in CSS.\"\n+          \"In these lecture videos, you will learn about best practices for accessibility in CSS, and the tools for checking good color contrast on websites.\"\n         ]\n       },\n       \"workshop-accessibility-quiz\": {\n@@ -2357,7 +2359,7 @@\n       \"lecture-working-with-attribute-selectors\": {\n         \"title\": \"Working with Attribute Selectors\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with attribute selectors.\"\n+          \"In these lecture videos, you will learn about attribute selectors and how to use them to target elements like links and lists.\"\n         ]\n       },\n       \"workshop-balance-sheet\": {\n@@ -2390,7 +2392,7 @@\n       \"lecture-understanding-how-to-work-with-floats-and-positioning-in-css\": {\n         \"title\": \"Understanding How to Work with Floats and Positioning in CSS\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about how to work with floats and positioning in CSS.\"\n+          \"In these lecture videos, you will learn how to use CSS positioning and floats. You will learn about <code>absolute</code>, <code>relative</code>, <code>fixed</code>, and <code>sticky</code> positioning. You will also use the <code>z-index</code> property.\"\n         ]\n       },\n       \"workshop-cat-painting\": {\n@@ -2423,7 +2425,7 @@\n       \"lecture-best-practices-for-responsive-web-design\": {\n         \"title\": \"Best Practices for Responsive Web Design\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about the best practices for responsive web design.\"\n+          \"In these lecture videos, you will learn about the best practices for responsive web design, the roles concepts like grid, flexbox, media queries, and media breakpoints play in responsive design, and more.\"\n         ]\n       },\n       \"workshop-piano\": {\n@@ -2456,7 +2458,7 @@\n       \"lecture-working-with-css-variables\": {\n         \"title\": \"Working with CSS Variables\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with CSS variables.\"\n+          \"In these lecture videos, you will learn how to define and use custom properties (also known as CSS variables). You will also learn about the <code>@property</code> rule and how it works.\"\n         ]\n       },\n       \"workshop-city-skyline\": {\n@@ -2489,7 +2491,7 @@\n       \"lecture-working-with-css-grid\": {\n         \"title\": \"Working with CSS Grid\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about working with CSS grid.\"\n+          \"In these lecture videos, you will learn about CSS grid, its several properties and how to use them, and how CSS grid differs from flexbox.\"\n         ]\n       },\n       \"workshop-magazine\": {\n@@ -2531,7 +2533,7 @@\n       \"lecture-animations-and-accessibility\": {\n         \"title\": \"Animations and Accessibility\",\n         \"intro\": [\n-          \"In these lecture videos, you will learn about animations and accessibility.\"\n+          \"In these lecture videos, you will learn about CSS animations and their accessibility concerns. You will also learn how <code>prefers-reduced-motion</code> can help address those accessibility concerns.\"\n         ]\n       },\n       \"workshop-ferris-wheel\": {"
        }
    ],
    "stats": {
        "total": 50,
        "additions": 26,
        "deletions": 24
    }
}