{
    "author": "mochammadkevin",
    "message": "fix(curriculum): typo in explanation of spaced repetition (#59351)",
    "sha": "bdf9819d731fdea32dd34c0204b98f960f23adb3",
    "files": [
        {
            "sha": "e6d395e88e7b849f942e25d2ac236027be2b5aad",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-welcome-to-freecodecamp/6763500bd5a85d5898cc21a9.md",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/bdf9819d731fdea32dd34c0204b98f960f23adb3/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-welcome-to-freecodecamp%2F6763500bd5a85d5898cc21a9.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/bdf9819d731fdea32dd34c0204b98f960f23adb3/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-welcome-to-freecodecamp%2F6763500bd5a85d5898cc21a9.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-welcome-to-freecodecamp%2F6763500bd5a85d5898cc21a9.md?ref=bdf9819d731fdea32dd34c0204b98f960f23adb3",
            "patch": "@@ -16,7 +16,7 @@ Learning is a skill all its own. And I'm going to quickly introduce you to key o\n \n These come from engineering professor Barbara Oakley's book, *Learning how to Learn.*\n \n-Concept number 1: spaced repetition. Learning for half an hour each day for a week is much more effective than learning for three and a half hours all in one day. This is because the of role that sleep plays in memory. When you sleep, your brain builds and reinforces neural structures. With spaced repetition, you review concepts regularly — first every few days, then every few weeks, then every few months. Each time, your retention of those concepts improves. freeCodeCamp has spaced repetition baked right into the curriculum.\n+Concept number 1: spaced repetition. Learning for half an hour each day for a week is much more effective than learning for three and a half hours all in one day. This is because of the role that sleep plays in memory. When you sleep, your brain builds and reinforces neural structures. With spaced repetition, you review concepts regularly — first every few days, then every few weeks, then every few months. Each time, your retention of those concepts improves. freeCodeCamp has spaced repetition baked right into the curriculum.\n \n Concept number 2: interleaving practice. Rather than just studying one concept for an entire study session, it's better to get a little exposure to lots of concepts. This shakes up your brain, and forces you to continually reframe what you know. Through interleaving practice, you train yourself to be more agile in your thinking. For this reason, the freeCodeCamp curriculum covers a ton of ground quickly, then circles back to reinforce everything over and over.\n "
        }
    ],
    "stats": {
        "total": 2,
        "additions": 1,
        "deletions": 1
    }
}