{
    "author": "pdtrang",
    "message": "fix(curriculum): add data types explanation for python lesson (#64541)\n\nCo-authored-by: Dario <105294544+Dario-DC@users.noreply.github.com>\nCo-authored-by: Krzysztof G. <60067306+gikf@users.noreply.github.com>",
    "sha": "d828d5a076e558d16e280eb21957e5a1249c0f56",
    "files": [
        {
            "sha": "9fc87db9f9e8e191963c5cb0f04f158e8618e4bb",
            "filename": "curriculum/challenges/english/blocks/lecture-introduction-to-python/67fe859a00971c34a23abd43.md",
            "status": "modified",
            "additions": 14,
            "deletions": 0,
            "changes": 14,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/d828d5a076e558d16e280eb21957e5a1249c0f56/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-introduction-to-python%2F67fe859a00971c34a23abd43.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/d828d5a076e558d16e280eb21957e5a1249c0f56/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-introduction-to-python%2F67fe859a00971c34a23abd43.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-introduction-to-python%2F67fe859a00971c34a23abd43.md?ref=d828d5a076e558d16e280eb21957e5a1249c0f56",
            "patch": "@@ -7,6 +7,8 @@ dashedName: what-are-common-data-types-in-python-and-how-do-you-get-the-type-of-\n \n # --description--\n \n+Before working with Python variables, it's important to understand data types. A data type describes the kind of value a variable holds. For example, a number, a piece of text, or a list of items. Programming languages use data types so they know how to store and work with different kinds of information.\n+\n Python is a dynamically-typed language like JavaScript, meaning you don't need to explicitly declare types for variables. The language knows what data type a variable is based on what you assign to it.\n \n Here are some examples:\n@@ -25,6 +27,18 @@ int age = 25\n \n The dynamic-typing nature of Python makes coding really fast and more flexible, but it can lead to unexpected bugs because type errors are detected only when a program runs, not when the program compiles.\n \n+Since Python determines data types while your program is **running**, type-related mistakes are only discovered at that moment. When a program runs, Python executes your code line by line. If it reaches a line where a certain object is expected to behave in a way it's not able to, Python will stop and show an error.\n+\n+In contrast, some languages **compile** your program before it runs. Compiling means the computer checks your code in advance and prepares it to run. During this step, those languages can catch type errors before the program even starts.\n+\n+You don't need to know those languages yet. The important idea is simply:\n+\n+- **In Python type errors can reveal themselves during execution**, when the program is actually running and using your code.\n+\n+- **Compiled languages catch type errors during the compile step**, before the program is allowed to run.\n+\n+Because of this, you might not learn about a type mistake in Python until the program reaches that specific line of code while running.\n+\n Here are the most common data types you'll use in Python:\n \n - Integer: A whole number without decimals, for example, `10` or `-5`."
        }
    ],
    "stats": {
        "total": 14,
        "additions": 14,
        "deletions": 0
    }
}