{
    "author": "jdwilkin4",
    "message": "chore(curriculum): update JS data type lesson (#64132)\n\nCo-authored-by: majestic-owl448 <26656284+majestic-owl448@users.noreply.github.com>",
    "sha": "d921d1de2bed37920f50cd216d00a082b2716564",
    "files": [
        {
            "sha": "0d1bae5f0eb0cf4b41dfcd9c4c743a6adc2a8bdf",
            "filename": "curriculum/challenges/english/blocks/lecture-introduction-to-javascript/672d496eca926b5df8176a67.md",
            "status": "modified",
            "additions": 72,
            "deletions": 22,
            "changes": 94,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/d921d1de2bed37920f50cd216d00a082b2716564/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-introduction-to-javascript%2F672d496eca926b5df8176a67.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/d921d1de2bed37920f50cd216d00a082b2716564/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-introduction-to-javascript%2F672d496eca926b5df8176a67.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2Fblocks%2Flecture-introduction-to-javascript%2F672d496eca926b5df8176a67.md?ref=d921d1de2bed37920f50cd216d00a082b2716564",
            "patch": "@@ -5,55 +5,105 @@ challengeType: 19\n dashedName: what-is-a-data-type\n ---\n \n-# --description--\n+# --interactive--\n \n-In JavaScript, a data type refers to the kind of value a variable holds.\n+In JavaScript, a data type is the kind of value you store like a number or piece of text.\n \n-A variable is a named container that stores a value of a specific data type, allowing you to reference and manipulate it throughout your code. Data types help the program understand the kind of data it's working with, whether it's a number, text, or something else.\n+A variable is a named container that stores a value of a specific data type, allowing you to reference and manipulate it throughout your code. \n+\n+You might remember in math class working with variables like this:\n+\n+```md\n+x = 2\n+y = 4\n+\n+x + y\n+```\n+\n+You were able to create variables like `x` and `y` and then reference those throughout your program and do mathematical operations like addition. It is a similar concept in programming. You can create your own variable names and assign values to them. These values will be different data types.\n+\n+Data types help the program understand the kind of data it's working with, whether it's a number, text, or something else.\n \n JavaScript has several basic data types that you'll use in your programs. We'll explore each data type in greater detail in future lessons. For now, here is a brief introduction of the different data types in JavaScript.\n \n The first data type we will look at is the `Number` type.\n \n-A `Number` represents both integers and floating-point values. Examples of integers include `7`, `19`, and `90`. Examples of floating point numbers include `3.14` and `5.2`. A floating point number is a number with a decimal point.\n+A `Number` represents both integers and floating-point values. Examples of integers include `7`, `19`, and `90`. \n+\n+**NOTE**: `console.log()` is a function that outputs information to the console, which is a part of your web browser used for debugging code. You will learn more about `console.log()` in future lessons. Also, the `//` symbols are used to add comments in your code. Comments are notes for yourself or other programmers that are ignored when the code runs.\n+\n+Enable the interactive editor and try changing some of the integers to see it update in the console.\n+\n+:::interactive_editor\n+\n+```js\n+// Examples of integers\n+console.log(3);\n+console.log(5);\n+console.log(-67);\n+```\n+\n+:::\n+\n+A floating point number is a number with a decimal point. Examples of floating point numbers include `3.14` and `5.2`. \n+\n+:::interactive_editor\n+\n+```js\n+// Examples of floating point numbers\n+console.log(3.14);\n+console.log(7.2);\n+console.log(-14.5);\n+```\n+\n+:::\n \n The next data type is a `String`.\n \n-A `String` is a sequence of characters, or text, enclosed in quotes. Here are two examples:\n+A `String` is a sequence of characters, or text, enclosed in quotes. Here is an example string using double quotes: \n \n-```md\n-\"Hello, world\"\n+:::interactive_editor\n+\n+```js\n+console.log(\"I love to code!\");\n ```\n \n-```md\n-'JavaScript'\n+:::\n+\n+Here is an example using single quotes:\n+\n+:::interactive_editor\n+\n+```js\n+console.log('I love to code!');\n ```\n \n+:::\n+\n+Oftentimes you will use strings to represent names, labels, alert messages, etc.\n+\n Another data type used in JavaScript is the `Boolean` type.\n \n-A `Boolean` represents one of two possible values: `true` or `false`. You can use a boolean to check if a page is loading, or if a user is logged in or not.\n+A `Boolean` represents one of two values: `true` or `false`. For example, a program might check whether a user is logged in (`true`) or not (`false`) and change the page based on that. If the user is logged in, you probably want to show them the dashboard page. Otherwise, you will want to show them the login page.\n \n The next two data types used in JavaScript are `undefined` and `null`.\n \n-`undefined` means a variable has been declared but hasn't been given a value yet. `null` means the variable has been intentionally set to \"nothing\" and does not hold any value. We will explore more on how this works in future lessons.\n+`undefined` means a variable has been declared but hasn't been given a value yet. You will learn more about this in the next lesson.\n+\n+`null` means the variable has been intentionally set to \"nothing\" and does not hold any value. We will explore more on how this works in future lessons.\n \n-The next data type we will look at is the `Object` type.\n+The last three data types are more complex in nature. These are objects, symbols and `BigInt`. \n \n-An `Object` is a more complex data type that can hold collections of key-value pairs. Let's break this down. The key (also called a property name), is like a label for the data, whereas the value, is the actual data you want to store. Here is an example:\n+An `Object` is a collection of key-value pairs. \n \n ```js\n-let book = {\n-  title: \"The Great Gatsby\",\n-  author: \"F. Scott Fitzgerald\",\n-  year: 1925\n+{\n+  name: \"Alice\",\n+  age: 30\n };\n ```\n \n-In this object, `title`, `author`, and `year` are the keys (or property names). `The Great Gatsby`, `F. Scott Fitzgerald`, and `1925` are the corresponding values.\n-\n-Each key-value pair in an object is called a property. So we can say that this book object has three properties. This is just a basic introduction to objects and their properties. In future lessons, we'll go deeper into more advanced concepts.\n-\n-The last two data types are the `Symbol` and `BigInt` data types.\n+Objects are great for grouping related information together. You will learn more about how to work with objects in a future module.\n \n A `Symbol` is a special type of value in JavaScript that is always unique and cannot be changed. It's often used to create unique labels or identifiers for properties:\n "
        }
    ],
    "stats": {
        "total": 94,
        "additions": 72,
        "deletions": 22
    }
}