{
    "author": "jdwilkin4",
    "message": "feat(curriculum): adding content for design fundamentals review (#57033)",
    "sha": "dd7906d25693c9d1f79c0551b2d53b525bee54c5",
    "files": [
        {
            "sha": "3e84dd9cdd3a7643c58ddaf0a8c195aa77f54f34",
            "filename": "client/i18n/locales/english/intro.json",
            "status": "modified",
            "additions": 2,
            "deletions": 1,
            "changes": 3,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/dd7906d25693c9d1f79c0551b2d53b525bee54c5/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/dd7906d25693c9d1f79c0551b2d53b525bee54c5/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fenglish%2Fintro.json?ref=dd7906d25693c9d1f79c0551b2d53b525bee54c5",
            "patch": "@@ -1930,7 +1930,8 @@\n       \"review-design-fundamentals\": {\n         \"title\": \"Design Fundamentals Review\",\n         \"intro\": [\n-          \"Review the Design Fundamentals concepts to prepare for the upcoming quiz.\"\n+          \"Before you are quizzed on the design fundamentals you have learned so far, you first need to review.\",\n+          \"Open up this page to review concepts like user-centered design, scale, alignment, good visual hierarchy and more.\"\n         ]\n       },\n       \"quiz-design-fundamentals\": {"
        },
        {
            "sha": "b922c318ea4d1a35803dd765c1ee0675f1e55e30",
            "filename": "curriculum/challenges/english/25-front-end-development/review-design-fundamentals/671a892927fdba60db05edfe.md",
            "status": "modified",
            "additions": 45,
            "deletions": 0,
            "changes": 45,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/dd7906d25693c9d1f79c0551b2d53b525bee54c5/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-design-fundamentals%2F671a892927fdba60db05edfe.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/dd7906d25693c9d1f79c0551b2d53b525bee54c5/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-design-fundamentals%2F671a892927fdba60db05edfe.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-design-fundamentals%2F671a892927fdba60db05edfe.md?ref=dd7906d25693c9d1f79c0551b2d53b525bee54c5",
            "patch": "@@ -9,7 +9,52 @@ dashedName: review-design-fundamentals\n \n Review the concepts below to prepare for the upcoming quiz.\n \n+## Design Terminology\n \n+- **Layout**: This is how visual elements are arranged on a page or screen to communicate a message. These elements may include text, images, and white space.\n+- **Alignment**: This is how the elements are placed in relation to one another. Using alignment correctly is helpful for making the design look clean and organized.\n+- **Composition**: This is the act of arranging elements to create a harmonious design. It determines how elements like images, text, and shapes relate to each other and contribute to the design in an artistic way.\n+- **Balance**: This is how visual weight is distributed within a composition. Designers aim to create an equilibrium through symmetrical or asymmetrical arrangements.\n+- **Scale**: This refers to comparing the dimensions or size of one element to that of another.\n+- **Hierarchy**: This establishes the order of importance of the elements in a design. It's about making sure that the most important information is noticed first. \n+- **Contrast**: This is the process of creating clear distinctions between the elements. You can do this through variations in color, size, shape, texture, or any other visual characteristic. Strong contrast is also helpful for improving readability.\n+- **White Space(negative space)**: This is the empty space in a design. It's the area surrounding the elements.\n+- **UI(User Interface)**: UI includes the visual and interactive elements that users can see on their screens, like icons, images, text, menus, links, and buttons.\n+- **UX(User Experience)**: UX is about how users feel when using a product or service. An application with a well-design user experience is intuitive, easy to use, efficient, accessible, and enjoyable.\n+- **Design Brief**: This is a document that outlines the objectives, goals, and requirements of a project. It is a roadmap that guides the design process and ensures that the final product meets the needs of the client.\n+- **Vector Based Design**: This involves creating digital art using mathematical formulas to define lines, shapes, and colors.\n+- **Prototyping**: This refers to the process of creating an interactive model of a product or user interface.\n+\n+## UI Design Fundamentals\n+\n+- **Good Contrast for Background and Foreground Colors**: It is important to ensure that the background and foreground colors have good contrast to make the text readable. The Web Content Accessibility Guidelines (WCAG) recommend a minimum contrast ratio of 4.5:1 for normal text and 3:1 for large text.\n+- **Good Visual Hierarchy in Design**: A strong visual hierarchy can provide a clear path for the eye to follow, ensuring that the information you convey is consumed in the order that you intend.\n+- **Responsive Images**: Responsive images are images that scale to fit the size of the screen they are being viewed on. This is important because it ensures that your images look good on all devices, from desktops to mobile phones.\n+- **Progressive Enhancement**: This is a design approach that ensures all users, regardless of browser or device, can access the essential content and functionality of an application. \n+- **User-centered Design**: This is an approach that prioritizes the end user, from their needs to their preferences and limitations. The goal of user-centered design is to craft a web page that is intuitive, efficient to use, and pleasing for your users to interact with.\n+- **User Research**: This is the systematic study of the people who use your product. The goal is to measure user needs, behaviors, and pain points.\n+- **User Testing**: This refers to the practice of capturing data from users as they interface with your application.\n+- **A/B Testing**: This is the process of shipping a new feature to a randomly selected subset of your user base. You can then leverage analytics data to determine if the feature is beneficial.\n+- **User Requirements**: This refers to the stories or rubric that your application needs to follow. User requirements might be defined by user research, or industry standards. They can even be defined by stakeholder input.\n+- **Progressive Disclosure**: This is a design pattern used to only show users relevant content based on their current activity and hide the rest. This is done to reduce cognitive load and make the user experience more intuitive.\n+- **Deferred/Lazy Registration**: This is a UI design pattern that allows users to browse and interact with your application without having to register.\n+\n+## Design Best Practices\n+\n+- **Dark Mode**: This is a special feature on web applications where you can change the default light color scheme to a dark color scheme. You should use desaturated colors in dark mode. Desaturated colors are colors that are less intense and have a lower saturation level.\n+- **Breadcrumbs**: This is a navigation aid that shows the user where they are in the site's hierarchy. It is best to place breadcrumbs at the top of the page so users can easily find it. Also, you want to make sure the breadcrumbs are large enough to be easily read, but not so large that they take up too much space on the page.\n+- **Card Component**: Your card component should be simple in design, not visually cluttered or display too much information. For media, make sure to choose high-quality images and videos to enhance the user experience.\n+- **Infinite Scroll**: This is a design pattern that loads more content as the user scrolls down the page. You should consider using a load more button because it gives a user control over when they want to see more content. You can also add a back button so users have the ability to go back to the previous page without having to scroll all the way back up. \n+- **Modal Dialog**: This is a type of pop-up that will show display on top of existing page content. Usually the background content will have a dim color overlay in order to help the user better focus on the modal content. Also, it is always a good idea to allow the user to click outside of the modal to close it. When you use the HTML `dialog` element, you will get a lot of the functionality and accessibility benefits built in.\n+- **Progress Indication for Form Registration**: This is a way to show users how far they are in a process. It can be used in forms, registration, and setup processes. Your design should be simple, easy to find, and make it possible to go back to previous steps.\n+- **Shopping Cart**: Carts are a place for user to see what item they have already selected on an e-commerce platform. Your carts should always be visible to the user, use a common icon like a cart, bag or basket, and have a clear call-to-action button for users to proceed to checkout.\n+\n+## Common Design Tools\n+\n+- **Figma**: This cloud-based tool specializes in User Interface and User Experience (UI / UX) design. It enables design and development teams to collaborate from anywhere, offering built-in features including Vector-based design, automatic layout, a commenting and feedback system and more.\n+- **Sketch**: This is a popular design tool used for its intuitive interface and simplicity, making it ideal for developers who want to quickly create prototypes. It's also widely used by designers for tasks like creating UIs, icons, and web layouts.\n+- **Adobe XD**: This is a vector-based design and prototyping tool for UI/UX design, known for its seamless integration with other Adobe apps like Photoshop, Illustrator, and After Effects.\n+- **Canva**: This tool allows you to create a wide range of visual content, including posters, cover photos, presentations, short videos, and more. Its user-friendly and simple design makes it ideal for beginners.\n \n # --assignment--\n "
        }
    ],
    "stats": {
        "total": 48,
        "additions": 47,
        "deletions": 1
    }
}