{
    "author": "camperbot",
    "message": "chore(i18n,client): processed translations (#60894)",
    "sha": "e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
    "files": [
        {
            "sha": "0cd3891e01c70fed2fdd0d395ebbce577b5e89d4",
            "filename": "client/i18n/locales/chinese-traditional/intro.json",
            "status": "modified",
            "additions": 243,
            "deletions": 17,
            "changes": 260,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fchinese-traditional%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fchinese-traditional%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fchinese-traditional%2Fintro.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -884,7 +884,7 @@\n       \"learn-special-methods-by-building-a-vector-space\": {\n         \"title\": \"Learn Special Methods by Building a Vector Space\",\n         \"intro\": [\n-          \"Python special methods are called in response to specific operations and enable you to customize the behaviour of your objects in a detailed and effective way.\",\n+          \"Python special methods are called in response to specific operations and enable you to customize the behavior of your objects in a detailed and effective way.\",\n           \"In this project, you are going to explore some of the most common special methods while learning about vectors by building a vector space.\"\n         ]\n       },\n@@ -1747,7 +1747,7 @@\n       \"relational-databases\": \"Relational Databases\",\n       \"backend-javascript\": \"Backend JavaScript\",\n       \"python\": \"Python\",\n-      \"exam-certified-full-stack-developer\": \"Certified Full Stack Developer Exam\"\n+      \"career\": \"Career\"\n     },\n     \"modules\": {\n       \"basic-html\": \"Basic HTML\",\n@@ -1785,6 +1785,7 @@\n       \"review-javascript-fundamentals\": \"JavaScript Fundamentals Review\",\n       \"higher-order-functions-and-callbacks\": \"Higher Order Functions and Callbacks\",\n       \"dom-manipulation-and-events\": \"DOM Manipulation and Events\",\n+      \"js-a11y\": \"JavaScript and Accessibility\",\n       \"debugging-javascript\": \"Debugging\",\n       \"basic-regex\": \"Basic Regex\",\n       \"form-validation\": \"Form Validation\",\n@@ -1801,14 +1802,11 @@\n       \"react-fundamentals\": \"React Fundamentals\",\n       \"react-state-hooks-and-routing\": \"React State, Hooks, and Routing\",\n       \"performance\": \"Performance\",\n-      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"testing\": \"Testing\",\n+      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"typescript-fundamentals\": \"TypeScript Fundamentals\",\n       \"review-front-end-libraries\": \"Front End Libraries Review\",\n       \"exam-front-end-libraries\": \"Front End Libraries Exam\",\n-      \"sql-and-bash\": \"SQL and Bash\",\n-      \"git\": \"Git\",\n-      \"security-and-privacy\": \"Security and Privacy\",\n       \"python-basics\": \"Python Basics\",\n       \"python-loops-and-sequences\": \"Loops and Sequences\",\n       \"python-dictionaries-and-sets\": \"Dictionaries and Sets\",\n@@ -1820,7 +1818,228 @@\n       \"python-graphs-and-trees\": \"Graphs and Trees\",\n       \"python-dynamic-programming\": \"Dynamic Programming\",\n       \"review-python\": \"Python Review\",\n-      \"exam-python\": \"Python Exam\"\n+      \"exam-python\": \"Python Exam\",\n+      \"bash-fundamentals\": \"Bash Fundamentals\",\n+      \"relational-databases\": \"Relational Databases\",\n+      \"bash-scripting\": \"Bash Scripting\",\n+      \"sql-and-bash\": \"SQL and Bash\",\n+      \"git\": \"Git\",\n+      \"introduction-to-nodejs\": \"Introduction to Node.js\",\n+      \"nodejs-core-libraries\": \"Node.js Core Libraries\",\n+      \"node-package-manager\": \"Node Package Manager\",\n+      \"http-and-the-web-standards-model\": \"HTTP and the Web Standards Model\",\n+      \"rest-api-and-web-services\": \"REST API and Web Services\",\n+      \"introduction-to-express\": \"Introduction to Express\",\n+      \"express-middleware\": \"Express Middleware\",\n+      \"error-handling-in-express\": \"Error Handling in Express\",\n+      \"websockets\": \"WebSockets\",\n+      \"node-and-sql\": \"Node and SQL\",\n+      \"security-and-privacy\": \"Security and Privacy\",\n+      \"authentication\": \"Authentication\",\n+      \"tooling-and-deployment\": \"Tooling and Deployment\",\n+      \"how-to-get-a-developer-job\": \"How to Get a Developer Job\",\n+      \"capstone-project\": \"Capstone Project\",\n+      \"certified-full-stack-developer-exam\": \"Certified Full Stack Developer Exam\"\n+    },\n+    \"module-intros\": {\n+      \"css-libraries-and-frameworks\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to CSS libraries, frameworks, and preprocessors, including Tailwind CSS, Bootstrap, and Sass. You will build out various components using Tailwind CSS and test your knowledge of these tools with a short quiz.\"\n+        ]\n+      },\n+      \"typescript-fundamentals\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to TypeScript, which is a superset of JavaScript that allows you to add static typing to your JavaScript code. You will build several workshops and labs that will give you practice in working with generics, type narrowing, TSX, and more. Then you will test your knowledge of TypeScript fundamentals with a short quiz.\"\n+        ]\n+      },\n+      \"python-basics\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Python, which is used in many fields like data science, machine learning, web development, scripting and automation, embedded systems, IoT, and more. You will build out a workshop and lab to practice Python basics and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-loops-and-sequences\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with lists, tuples, lambda functions, loops, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dictionaries-and-sets\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to dictionaries, sets, and the Python standard library. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-error-handling\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will talk about common error messages, good debugging techniques, and exception handling. You will build a lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-classes-and-objects\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with classes, methods, attributes and properties. Then, you will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-object-oriented-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about Object-oriented programming concepts like encapsulation, inheritance, polymorphism, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-linear-data-structures\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about data structures including stacks, queues, linked lists, and more. You will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-algorithms\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about common algorithms including binary search, merge sort, selection sort, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-graphs-and-trees\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about graphs in computer science as well as adjacency lists, trees, tries, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dynamic-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  dynamic programming and practice these concepts by building a fibonacci sequence lab. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-fundamentals\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  the command line and common Bash commands. Then you will practice your skills with a workshop and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"relational-databases\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with relational databases which store data as collections in tables. Some of the concepts you will learn about include inserting and viewing table data, primary and foreign keys in SQL, and more. Then you will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-scripting\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about bash scripting and practice those skills by building five programs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"sql-and-bash\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about normalization, SQL injection, and the N+1 problem. Then you will get to practice working with SQL and Bash by building several workshops and labs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"git\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to use Git, Nano, and GitHub. Then you will get to practice working with Git by building several workshops and labs. You will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"introduction-to-nodejs\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Node.js, which is a JavaScript runtime environment that allows you to build backend applications using JavaScript. You will get to practice fundamental concepts by building a small workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"nodejs-core-libraries\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common Node.js core libraries including the fs, os, path and more. Then you will get to practice what you have learned through workshops and labs and test your knowledge through a short quiz.\"\n+        ]\n+      },\n+      \"node-package-manager\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to the Node Package Manager, which developers use to manage project dependencies and scripts. Then you will get to practice what you have learned through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"http-and-the-web-standards-model\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about HTTP (Hypertext Transfer Protocol) and other important concepts including the request-response model, common response codes, DNS, TCP/IP, and more. Then you will get to practice what you have learned through a build your own web server workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"rest-api-and-web-services\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about the REST API (Representational State Transfer Application Programming Interface) and how microservices work. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"introduction-to-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Express.js, which is a framework used to build RESTful APIs. Then you will practice your skills through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"express-middleware\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about middleware in Express.js, which is used to handle requests and responses between the client and server. You will then practice your skills through a workshop and lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"error-handling-in-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how error handling, debugging, and health checks work in Express.js. You will then practice what you have learned in a lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"websockets\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to websockets, which is a protocol used for real time communication with the client and server. You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"node-and-sql\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will practice building applications with Node and SQL. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"security-and-privacy\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about the differences between security and privacy as well as other concepts including  CSPs, Permissions-Policies, PII, working with CORS, and more. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"authentication\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how authentication works in web applications along with other important concepts including JWTs, CSRFs, Passport, Helmet, cryptography and encryption, and more.  You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"tooling-and-deployment\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common tools used in the industry for deploying your full stack applications. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"how-to-get-a-developer-job\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, Quincy Larson (Founder and teacher of freeCodeCamp) will talk about strategies you can use to prepare for getting a developer job. Quincy will cover key subjects including résumés, portfolios, researching the market, preparing for technical interviews, and more.\"\n+        ]\n+      },\n+      \"capstone-project\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be your opportunity to build out a full stack application encompassing what you have learned throughout this certification.\"\n+        ]\n+      },\n+      \"certified-full-stack-developer-exam\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be a 90 question exam testing what you have learned throughout this certification.\"\n+        ]\n+      }\n     },\n     \"blocks\": {\n       \"workshop-curriculum-outline\": {\n@@ -3141,6 +3360,19 @@\n           \"Test your knowledge of DOM manipulation and click events in JavaScript with this quiz.\"\n         ]\n       },\n+      \"review-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Review\",\n+        \"intro\": [\n+          \"Before you're quizzed on JavaScript and accessibility, you should review what you've learned about it.\",\n+          \"Open up this page to review concepts including how to work with the <code>aria-expanded</code>, <code>aria-live</code>, and <code>aria-controls</code> attributes.\"\n+        ]\n+      },\n+      \"quiz-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Quiz\",\n+        \"intro\": [\n+          \"Test your knowledge of JavaScript and accessibility best practices with this quiz.\"\n+        ]\n+      },\n       \"lecture-debugging-techniques\": {\n         \"title\": \"Debugging Techniques\",\n         \"intro\": [\n@@ -3778,7 +4010,9 @@\n       },\n       \"lecture-introduction-to-python\": {\n         \"title\": \"Introduction to Python\",\n-        \"intro\": [\"Learn about Introduction to Python in these lectures.\"]\n+        \"intro\": [\n+          \"In these lecture videos, you will learn the fundamentals of Python. You'll learn about variables, data types, operators, control flow, functions, and more.\"\n+        ]\n       },\n       \"workshop-caesar-cipher\": {\n         \"title\": \"Build a Caesar Cipher\",\n@@ -3796,7 +4030,7 @@\n         \"title\": \"Python Basics Review\",\n         \"intro\": [\n           \"Before you're quizzed on Python basics, you should review what you've learned about it.\",\n-          \"[Add more details]\"\n+          \"In this review page, you will review working with strings, functions, comparison operators and more.\"\n         ]\n       },\n       \"quiz-python-basics\": {\n@@ -4237,14 +4471,6 @@\n           \"In this 40-lesson workshop, you will learn how to edit files in the terminal with Nano while building a castle.\"\n         ]\n       },\n-      \"review-nano\": {\n-        \"title\": \"Nano Review\",\n-        \"intro\": [\"Review the Nano concepts to prepare for the upcoming quiz.\"]\n-      },\n-      \"quiz-nano\": {\n-        \"title\": \"Nano Quiz\",\n-        \"intro\": [\"Test what you've learned on Nano with this quiz .\"]\n-      },\n       \"rhhl\": {\n         \"title\": \"328\",\n         \"intro\": []"
        },
        {
            "sha": "a662f7ed9c85e2b58d234fe6775720c27aadec2c",
            "filename": "client/i18n/locales/chinese-traditional/translations.json",
            "status": "modified",
            "additions": 9,
            "deletions": 1,
            "changes": 10,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fchinese-traditional%2Ftranslations.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fchinese-traditional%2Ftranslations.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fchinese-traditional%2Ftranslations.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -796,7 +796,15 @@\n     \"iframe-form-submit-alert\": \"通常這個表單將被提交！工作正常，這將被提交到：{{externalLink}}\",\n     \"document-notfound\": \"找不到文件\",\n     \"slow-load-msg\": \"看起來這比平常花費更長時間，請嘗試刷新頁面。\",\n-    \"navigation-warning\": \"如果你離開這個頁面，你將丟失你的進度。你確定嗎？\"\n+    \"navigation-warning\": \"如果你離開這個頁面，你將丟失你的進度。你確定嗎？\",\n+    \"fsd-b-description\": \"This comprehensive course prepares you to become a Certified Full Stack Developer. You'll learn to build complete web applications using HTML, CSS, JavaScript, React, TypeScript, Node.js, Python, and more.\",\n+    \"fsd-b-cta\": \"Start Learning\",\n+    \"fsd-b-benefit-1-title\": \"100k+ Students\",\n+    \"fsd-b-benefit-1-description\": \"Join more than 100k students taking this certification.\",\n+    \"fsd-b-benefit-2-title\": \"Professional Certification\",\n+    \"fsd-b-benefit-2-description\": \"Prove your skills with an official, verifiable certification.\",\n+    \"fsd-b-benefit-3-title\": \"500+ Exercises\",\n+    \"fsd-b-benefit-3-description\": \"Solidify your knowledge with plenty of practice.\"\n   },\n   \"icons\": {\n     \"gold-cup\": \"金獎盃\","
        },
        {
            "sha": "f7dcd894ed11c6390ef8a85a88d7b6c06ba40415",
            "filename": "client/i18n/locales/chinese/intro.json",
            "status": "modified",
            "additions": 243,
            "deletions": 17,
            "changes": 260,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fchinese%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fchinese%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fchinese%2Fintro.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -884,7 +884,7 @@\n       \"learn-special-methods-by-building-a-vector-space\": {\n         \"title\": \"Learn Special Methods by Building a Vector Space\",\n         \"intro\": [\n-          \"Python special methods are called in response to specific operations and enable you to customize the behaviour of your objects in a detailed and effective way.\",\n+          \"Python special methods are called in response to specific operations and enable you to customize the behavior of your objects in a detailed and effective way.\",\n           \"In this project, you are going to explore some of the most common special methods while learning about vectors by building a vector space.\"\n         ]\n       },\n@@ -1747,7 +1747,7 @@\n       \"relational-databases\": \"Relational Databases\",\n       \"backend-javascript\": \"Backend JavaScript\",\n       \"python\": \"Python\",\n-      \"exam-certified-full-stack-developer\": \"Certified Full Stack Developer Exam\"\n+      \"career\": \"Career\"\n     },\n     \"modules\": {\n       \"basic-html\": \"Basic HTML\",\n@@ -1785,6 +1785,7 @@\n       \"review-javascript-fundamentals\": \"JavaScript Fundamentals Review\",\n       \"higher-order-functions-and-callbacks\": \"Higher Order Functions and Callbacks\",\n       \"dom-manipulation-and-events\": \"DOM Manipulation and Events\",\n+      \"js-a11y\": \"JavaScript and Accessibility\",\n       \"debugging-javascript\": \"Debugging\",\n       \"basic-regex\": \"Basic Regex\",\n       \"form-validation\": \"Form Validation\",\n@@ -1801,14 +1802,11 @@\n       \"react-fundamentals\": \"React Fundamentals\",\n       \"react-state-hooks-and-routing\": \"React State, Hooks, and Routing\",\n       \"performance\": \"Performance\",\n-      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"testing\": \"Testing\",\n+      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"typescript-fundamentals\": \"TypeScript Fundamentals\",\n       \"review-front-end-libraries\": \"Front End Libraries Review\",\n       \"exam-front-end-libraries\": \"Front End Libraries Exam\",\n-      \"sql-and-bash\": \"SQL and Bash\",\n-      \"git\": \"Git\",\n-      \"security-and-privacy\": \"Security and Privacy\",\n       \"python-basics\": \"Python Basics\",\n       \"python-loops-and-sequences\": \"Loops and Sequences\",\n       \"python-dictionaries-and-sets\": \"Dictionaries and Sets\",\n@@ -1820,7 +1818,228 @@\n       \"python-graphs-and-trees\": \"Graphs and Trees\",\n       \"python-dynamic-programming\": \"Dynamic Programming\",\n       \"review-python\": \"Python Review\",\n-      \"exam-python\": \"Python Exam\"\n+      \"exam-python\": \"Python Exam\",\n+      \"bash-fundamentals\": \"Bash Fundamentals\",\n+      \"relational-databases\": \"Relational Databases\",\n+      \"bash-scripting\": \"Bash Scripting\",\n+      \"sql-and-bash\": \"SQL and Bash\",\n+      \"git\": \"Git\",\n+      \"introduction-to-nodejs\": \"Introduction to Node.js\",\n+      \"nodejs-core-libraries\": \"Node.js Core Libraries\",\n+      \"node-package-manager\": \"Node Package Manager\",\n+      \"http-and-the-web-standards-model\": \"HTTP and the Web Standards Model\",\n+      \"rest-api-and-web-services\": \"REST API and Web Services\",\n+      \"introduction-to-express\": \"Introduction to Express\",\n+      \"express-middleware\": \"Express Middleware\",\n+      \"error-handling-in-express\": \"Error Handling in Express\",\n+      \"websockets\": \"WebSockets\",\n+      \"node-and-sql\": \"Node and SQL\",\n+      \"security-and-privacy\": \"Security and Privacy\",\n+      \"authentication\": \"Authentication\",\n+      \"tooling-and-deployment\": \"Tooling and Deployment\",\n+      \"how-to-get-a-developer-job\": \"How to Get a Developer Job\",\n+      \"capstone-project\": \"Capstone Project\",\n+      \"certified-full-stack-developer-exam\": \"Certified Full Stack Developer Exam\"\n+    },\n+    \"module-intros\": {\n+      \"css-libraries-and-frameworks\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to CSS libraries, frameworks, and preprocessors, including Tailwind CSS, Bootstrap, and Sass. You will build out various components using Tailwind CSS and test your knowledge of these tools with a short quiz.\"\n+        ]\n+      },\n+      \"typescript-fundamentals\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to TypeScript, which is a superset of JavaScript that allows you to add static typing to your JavaScript code. You will build several workshops and labs that will give you practice in working with generics, type narrowing, TSX, and more. Then you will test your knowledge of TypeScript fundamentals with a short quiz.\"\n+        ]\n+      },\n+      \"python-basics\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Python, which is used in many fields like data science, machine learning, web development, scripting and automation, embedded systems, IoT, and more. You will build out a workshop and lab to practice Python basics and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-loops-and-sequences\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with lists, tuples, lambda functions, loops, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dictionaries-and-sets\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to dictionaries, sets, and the Python standard library. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-error-handling\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will talk about common error messages, good debugging techniques, and exception handling. You will build a lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-classes-and-objects\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with classes, methods, attributes and properties. Then, you will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-object-oriented-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about Object-oriented programming concepts like encapsulation, inheritance, polymorphism, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-linear-data-structures\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about data structures including stacks, queues, linked lists, and more. You will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-algorithms\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about common algorithms including binary search, merge sort, selection sort, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-graphs-and-trees\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about graphs in computer science as well as adjacency lists, trees, tries, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dynamic-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  dynamic programming and practice these concepts by building a fibonacci sequence lab. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-fundamentals\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  the command line and common Bash commands. Then you will practice your skills with a workshop and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"relational-databases\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with relational databases which store data as collections in tables. Some of the concepts you will learn about include inserting and viewing table data, primary and foreign keys in SQL, and more. Then you will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-scripting\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about bash scripting and practice those skills by building five programs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"sql-and-bash\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about normalization, SQL injection, and the N+1 problem. Then you will get to practice working with SQL and Bash by building several workshops and labs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"git\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to use Git, Nano, and GitHub. Then you will get to practice working with Git by building several workshops and labs. You will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"introduction-to-nodejs\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Node.js, which is a JavaScript runtime environment that allows you to build backend applications using JavaScript. You will get to practice fundamental concepts by building a small workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"nodejs-core-libraries\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common Node.js core libraries including the fs, os, path and more. Then you will get to practice what you have learned through workshops and labs and test your knowledge through a short quiz.\"\n+        ]\n+      },\n+      \"node-package-manager\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to the Node Package Manager, which developers use to manage project dependencies and scripts. Then you will get to practice what you have learned through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"http-and-the-web-standards-model\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about HTTP (Hypertext Transfer Protocol) and other important concepts including the request-response model, common response codes, DNS, TCP/IP, and more. Then you will get to practice what you have learned through a build your own web server workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"rest-api-and-web-services\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about the REST API (Representational State Transfer Application Programming Interface) and how microservices work. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"introduction-to-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Express.js, which is a framework used to build RESTful APIs. Then you will practice your skills through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"express-middleware\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about middleware in Express.js, which is used to handle requests and responses between the client and server. You will then practice your skills through a workshop and lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"error-handling-in-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how error handling, debugging, and health checks work in Express.js. You will then practice what you have learned in a lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"websockets\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to websockets, which is a protocol used for real time communication with the client and server. You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"node-and-sql\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will practice building applications with Node and SQL. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"security-and-privacy\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about the differences between security and privacy as well as other concepts including  CSPs, Permissions-Policies, PII, working with CORS, and more. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"authentication\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how authentication works in web applications along with other important concepts including JWTs, CSRFs, Passport, Helmet, cryptography and encryption, and more.  You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"tooling-and-deployment\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common tools used in the industry for deploying your full stack applications. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"how-to-get-a-developer-job\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, Quincy Larson (Founder and teacher of freeCodeCamp) will talk about strategies you can use to prepare for getting a developer job. Quincy will cover key subjects including résumés, portfolios, researching the market, preparing for technical interviews, and more.\"\n+        ]\n+      },\n+      \"capstone-project\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be your opportunity to build out a full stack application encompassing what you have learned throughout this certification.\"\n+        ]\n+      },\n+      \"certified-full-stack-developer-exam\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be a 90 question exam testing what you have learned throughout this certification.\"\n+        ]\n+      }\n     },\n     \"blocks\": {\n       \"workshop-curriculum-outline\": {\n@@ -3141,6 +3360,19 @@\n           \"Test your knowledge of DOM manipulation and click events in JavaScript with this quiz.\"\n         ]\n       },\n+      \"review-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Review\",\n+        \"intro\": [\n+          \"Before you're quizzed on JavaScript and accessibility, you should review what you've learned about it.\",\n+          \"Open up this page to review concepts including how to work with the <code>aria-expanded</code>, <code>aria-live</code>, and <code>aria-controls</code> attributes.\"\n+        ]\n+      },\n+      \"quiz-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Quiz\",\n+        \"intro\": [\n+          \"Test your knowledge of JavaScript and accessibility best practices with this quiz.\"\n+        ]\n+      },\n       \"lecture-debugging-techniques\": {\n         \"title\": \"Debugging Techniques\",\n         \"intro\": [\n@@ -3778,7 +4010,9 @@\n       },\n       \"lecture-introduction-to-python\": {\n         \"title\": \"Introduction to Python\",\n-        \"intro\": [\"Learn about Introduction to Python in these lectures.\"]\n+        \"intro\": [\n+          \"In these lecture videos, you will learn the fundamentals of Python. You'll learn about variables, data types, operators, control flow, functions, and more.\"\n+        ]\n       },\n       \"workshop-caesar-cipher\": {\n         \"title\": \"Build a Caesar Cipher\",\n@@ -3796,7 +4030,7 @@\n         \"title\": \"Python Basics Review\",\n         \"intro\": [\n           \"Before you're quizzed on Python basics, you should review what you've learned about it.\",\n-          \"[Add more details]\"\n+          \"In this review page, you will review working with strings, functions, comparison operators and more.\"\n         ]\n       },\n       \"quiz-python-basics\": {\n@@ -4237,14 +4471,6 @@\n           \"In this 40-lesson workshop, you will learn how to edit files in the terminal with Nano while building a castle.\"\n         ]\n       },\n-      \"review-nano\": {\n-        \"title\": \"Nano Review\",\n-        \"intro\": [\"Review the Nano concepts to prepare for the upcoming quiz.\"]\n-      },\n-      \"quiz-nano\": {\n-        \"title\": \"Nano Quiz\",\n-        \"intro\": [\"Test what you've learned on Nano with this quiz .\"]\n-      },\n       \"rhhl\": {\n         \"title\": \"328\",\n         \"intro\": []"
        },
        {
            "sha": "9f4aacc3d65fe58bf9c039a45a5050366e4a8ff3",
            "filename": "client/i18n/locales/chinese/translations.json",
            "status": "modified",
            "additions": 9,
            "deletions": 1,
            "changes": 10,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fchinese%2Ftranslations.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fchinese%2Ftranslations.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fchinese%2Ftranslations.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -796,7 +796,15 @@\n     \"iframe-form-submit-alert\": \"通常这个表单将被提交！工作正常，这将被提交到：{{externalLink}}\",\n     \"document-notfound\": \"找不到文件\",\n     \"slow-load-msg\": \"看起来这比平常花费更长时间，请尝试刷新页面。\",\n-    \"navigation-warning\": \"如果你离开这个页面，你将丢失你的进度。你确定吗？\"\n+    \"navigation-warning\": \"如果你离开这个页面，你将丢失你的进度。你确定吗？\",\n+    \"fsd-b-description\": \"This comprehensive course prepares you to become a Certified Full Stack Developer. You'll learn to build complete web applications using HTML, CSS, JavaScript, React, TypeScript, Node.js, Python, and more.\",\n+    \"fsd-b-cta\": \"Start Learning\",\n+    \"fsd-b-benefit-1-title\": \"100k+ Students\",\n+    \"fsd-b-benefit-1-description\": \"Join more than 100k students taking this certification.\",\n+    \"fsd-b-benefit-2-title\": \"Professional Certification\",\n+    \"fsd-b-benefit-2-description\": \"Prove your skills with an official, verifiable certification.\",\n+    \"fsd-b-benefit-3-title\": \"500+ Exercises\",\n+    \"fsd-b-benefit-3-description\": \"Solidify your knowledge with plenty of practice.\"\n   },\n   \"icons\": {\n     \"gold-cup\": \"金奖杯\","
        },
        {
            "sha": "ea2cad3914ac4c19c11d7ede014a6f0ae1bb9b98",
            "filename": "client/i18n/locales/espanol/intro.json",
            "status": "modified",
            "additions": 243,
            "deletions": 17,
            "changes": 260,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fespanol%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fespanol%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fespanol%2Fintro.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -890,7 +890,7 @@\n       \"learn-special-methods-by-building-a-vector-space\": {\n         \"title\": \"Aprender métodos especiales construyendo un espacio vectorial\",\n         \"intro\": [\n-          \"Los métodos especiales de Python se llaman en respuesta a operaciones específicas y permiten personalizar el comportamiento de los objetos de forma detallada y eficaz.\",\n+          \"Python special methods are called in response to specific operations and enable you to customize the behavior of your objects in a detailed and effective way.\",\n           \"En este proyecto, vas a explorar algunos de los métodos especiales más comunes mientras aprendes sobre vectores construyendo un espacio vectorial.\"\n         ]\n       },\n@@ -1761,7 +1761,7 @@\n       \"relational-databases\": \"Bases de datos relacionales\",\n       \"backend-javascript\": \"JavaScript de back-end\",\n       \"python\": \"Python\",\n-      \"exam-certified-full-stack-developer\": \"Examen de desarrollador certificado Full Stack\"\n+      \"career\": \"Career\"\n     },\n     \"modules\": {\n       \"basic-html\": \"HTML básico\",\n@@ -1799,6 +1799,7 @@\n       \"review-javascript-fundamentals\": \"JavaScript Fundamentals Review\",\n       \"higher-order-functions-and-callbacks\": \"Higher Order Functions and Callbacks\",\n       \"dom-manipulation-and-events\": \"DOM Manipulation and Events\",\n+      \"js-a11y\": \"JavaScript and Accessibility\",\n       \"debugging-javascript\": \"Debugging\",\n       \"basic-regex\": \"Basic Regex\",\n       \"form-validation\": \"Form Validation\",\n@@ -1815,14 +1816,11 @@\n       \"react-fundamentals\": \"React Fundamentals\",\n       \"react-state-hooks-and-routing\": \"React State, Hooks, and Routing\",\n       \"performance\": \"Performance\",\n-      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"testing\": \"Testing\",\n+      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"typescript-fundamentals\": \"TypeScript Fundamentals\",\n       \"review-front-end-libraries\": \"Front End Libraries Review\",\n       \"exam-front-end-libraries\": \"Front End Libraries Exam\",\n-      \"sql-and-bash\": \"SQL and Bash\",\n-      \"git\": \"Git\",\n-      \"security-and-privacy\": \"Security and Privacy\",\n       \"python-basics\": \"Python Basics\",\n       \"python-loops-and-sequences\": \"Loops and Sequences\",\n       \"python-dictionaries-and-sets\": \"Dictionaries and Sets\",\n@@ -1834,7 +1832,228 @@\n       \"python-graphs-and-trees\": \"Graphs and Trees\",\n       \"python-dynamic-programming\": \"Dynamic Programming\",\n       \"review-python\": \"Python Review\",\n-      \"exam-python\": \"Python Exam\"\n+      \"exam-python\": \"Python Exam\",\n+      \"bash-fundamentals\": \"Bash Fundamentals\",\n+      \"relational-databases\": \"Relational Databases\",\n+      \"bash-scripting\": \"Bash Scripting\",\n+      \"sql-and-bash\": \"SQL and Bash\",\n+      \"git\": \"Git\",\n+      \"introduction-to-nodejs\": \"Introduction to Node.js\",\n+      \"nodejs-core-libraries\": \"Node.js Core Libraries\",\n+      \"node-package-manager\": \"Node Package Manager\",\n+      \"http-and-the-web-standards-model\": \"HTTP and the Web Standards Model\",\n+      \"rest-api-and-web-services\": \"REST API and Web Services\",\n+      \"introduction-to-express\": \"Introduction to Express\",\n+      \"express-middleware\": \"Express Middleware\",\n+      \"error-handling-in-express\": \"Error Handling in Express\",\n+      \"websockets\": \"WebSockets\",\n+      \"node-and-sql\": \"Node and SQL\",\n+      \"security-and-privacy\": \"Security and Privacy\",\n+      \"authentication\": \"Authentication\",\n+      \"tooling-and-deployment\": \"Tooling and Deployment\",\n+      \"how-to-get-a-developer-job\": \"How to Get a Developer Job\",\n+      \"capstone-project\": \"Capstone Project\",\n+      \"certified-full-stack-developer-exam\": \"Certified Full Stack Developer Exam\"\n+    },\n+    \"module-intros\": {\n+      \"css-libraries-and-frameworks\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to CSS libraries, frameworks, and preprocessors, including Tailwind CSS, Bootstrap, and Sass. You will build out various components using Tailwind CSS and test your knowledge of these tools with a short quiz.\"\n+        ]\n+      },\n+      \"typescript-fundamentals\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to TypeScript, which is a superset of JavaScript that allows you to add static typing to your JavaScript code. You will build several workshops and labs that will give you practice in working with generics, type narrowing, TSX, and more. Then you will test your knowledge of TypeScript fundamentals with a short quiz.\"\n+        ]\n+      },\n+      \"python-basics\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Python, which is used in many fields like data science, machine learning, web development, scripting and automation, embedded systems, IoT, and more. You will build out a workshop and lab to practice Python basics and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-loops-and-sequences\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with lists, tuples, lambda functions, loops, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dictionaries-and-sets\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to dictionaries, sets, and the Python standard library. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-error-handling\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will talk about common error messages, good debugging techniques, and exception handling. You will build a lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-classes-and-objects\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with classes, methods, attributes and properties. Then, you will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-object-oriented-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about Object-oriented programming concepts like encapsulation, inheritance, polymorphism, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-linear-data-structures\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about data structures including stacks, queues, linked lists, and more. You will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-algorithms\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about common algorithms including binary search, merge sort, selection sort, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-graphs-and-trees\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about graphs in computer science as well as adjacency lists, trees, tries, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dynamic-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  dynamic programming and practice these concepts by building a fibonacci sequence lab. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-fundamentals\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  the command line and common Bash commands. Then you will practice your skills with a workshop and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"relational-databases\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with relational databases which store data as collections in tables. Some of the concepts you will learn about include inserting and viewing table data, primary and foreign keys in SQL, and more. Then you will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-scripting\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about bash scripting and practice those skills by building five programs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"sql-and-bash\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about normalization, SQL injection, and the N+1 problem. Then you will get to practice working with SQL and Bash by building several workshops and labs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"git\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to use Git, Nano, and GitHub. Then you will get to practice working with Git by building several workshops and labs. You will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"introduction-to-nodejs\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Node.js, which is a JavaScript runtime environment that allows you to build backend applications using JavaScript. You will get to practice fundamental concepts by building a small workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"nodejs-core-libraries\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common Node.js core libraries including the fs, os, path and more. Then you will get to practice what you have learned through workshops and labs and test your knowledge through a short quiz.\"\n+        ]\n+      },\n+      \"node-package-manager\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to the Node Package Manager, which developers use to manage project dependencies and scripts. Then you will get to practice what you have learned through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"http-and-the-web-standards-model\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about HTTP (Hypertext Transfer Protocol) and other important concepts including the request-response model, common response codes, DNS, TCP/IP, and more. Then you will get to practice what you have learned through a build your own web server workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"rest-api-and-web-services\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about the REST API (Representational State Transfer Application Programming Interface) and how microservices work. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"introduction-to-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Express.js, which is a framework used to build RESTful APIs. Then you will practice your skills through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"express-middleware\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about middleware in Express.js, which is used to handle requests and responses between the client and server. You will then practice your skills through a workshop and lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"error-handling-in-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how error handling, debugging, and health checks work in Express.js. You will then practice what you have learned in a lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"websockets\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to websockets, which is a protocol used for real time communication with the client and server. You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"node-and-sql\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will practice building applications with Node and SQL. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"security-and-privacy\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about the differences between security and privacy as well as other concepts including  CSPs, Permissions-Policies, PII, working with CORS, and more. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"authentication\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how authentication works in web applications along with other important concepts including JWTs, CSRFs, Passport, Helmet, cryptography and encryption, and more.  You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"tooling-and-deployment\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common tools used in the industry for deploying your full stack applications. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"how-to-get-a-developer-job\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, Quincy Larson (Founder and teacher of freeCodeCamp) will talk about strategies you can use to prepare for getting a developer job. Quincy will cover key subjects including résumés, portfolios, researching the market, preparing for technical interviews, and more.\"\n+        ]\n+      },\n+      \"capstone-project\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be your opportunity to build out a full stack application encompassing what you have learned throughout this certification.\"\n+        ]\n+      },\n+      \"certified-full-stack-developer-exam\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be a 90 question exam testing what you have learned throughout this certification.\"\n+        ]\n+      }\n     },\n     \"blocks\": {\n       \"workshop-curriculum-outline\": {\n@@ -3155,6 +3374,19 @@\n           \"Test your knowledge of DOM manipulation and click events in JavaScript with this quiz.\"\n         ]\n       },\n+      \"review-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Review\",\n+        \"intro\": [\n+          \"Before you're quizzed on JavaScript and accessibility, you should review what you've learned about it.\",\n+          \"Open up this page to review concepts including how to work with the <code>aria-expanded</code>, <code>aria-live</code>, and <code>aria-controls</code> attributes.\"\n+        ]\n+      },\n+      \"quiz-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Quiz\",\n+        \"intro\": [\n+          \"Test your knowledge of JavaScript and accessibility best practices with this quiz.\"\n+        ]\n+      },\n       \"lecture-debugging-techniques\": {\n         \"title\": \"Debugging Techniques\",\n         \"intro\": [\n@@ -3792,7 +4024,9 @@\n       },\n       \"lecture-introduction-to-python\": {\n         \"title\": \"Introduction to Python\",\n-        \"intro\": [\"Learn about Introduction to Python in these lectures.\"]\n+        \"intro\": [\n+          \"In these lecture videos, you will learn the fundamentals of Python. You'll learn about variables, data types, operators, control flow, functions, and more.\"\n+        ]\n       },\n       \"workshop-caesar-cipher\": {\n         \"title\": \"Build a Caesar Cipher\",\n@@ -3810,7 +4044,7 @@\n         \"title\": \"Python Basics Review\",\n         \"intro\": [\n           \"Before you're quizzed on Python basics, you should review what you've learned about it.\",\n-          \"[Add more details]\"\n+          \"In this review page, you will review working with strings, functions, comparison operators and more.\"\n         ]\n       },\n       \"quiz-python-basics\": {\n@@ -4251,14 +4485,6 @@\n           \"In this 40-lesson workshop, you will learn how to edit files in the terminal with Nano while building a castle.\"\n         ]\n       },\n-      \"review-nano\": {\n-        \"title\": \"Nano Review\",\n-        \"intro\": [\"Review the Nano concepts to prepare for the upcoming quiz.\"]\n-      },\n-      \"quiz-nano\": {\n-        \"title\": \"Nano Quiz\",\n-        \"intro\": [\"Test what you've learned on Nano with this quiz .\"]\n-      },\n       \"rhhl\": {\n         \"title\": \"328\",\n         \"intro\": []"
        },
        {
            "sha": "48a1d1f1640d1dfb8fa8fa9380d9210876bca50a",
            "filename": "client/i18n/locales/espanol/translations.json",
            "status": "modified",
            "additions": 9,
            "deletions": 1,
            "changes": 10,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fespanol%2Ftranslations.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fespanol%2Ftranslations.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fespanol%2Ftranslations.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -796,7 +796,15 @@\n     \"iframe-form-submit-alert\": \"¡Normalmente, se enviaría este formulario! Funciona. Esto se enviará a: {{externalLink}}\",\n     \"document-notfound\": \"documento no encontrado\",\n     \"slow-load-msg\": \"Parece que esto está tardando más de lo habitual, por favor intente actualizar la página.\",\n-    \"navigation-warning\": \"Si abandonas esta página, perderás tu progreso. ¿Estás seguro?\"\n+    \"navigation-warning\": \"Si abandonas esta página, perderás tu progreso. ¿Estás seguro?\",\n+    \"fsd-b-description\": \"This comprehensive course prepares you to become a Certified Full Stack Developer. You'll learn to build complete web applications using HTML, CSS, JavaScript, React, TypeScript, Node.js, Python, and more.\",\n+    \"fsd-b-cta\": \"Start Learning\",\n+    \"fsd-b-benefit-1-title\": \"100k+ Students\",\n+    \"fsd-b-benefit-1-description\": \"Join more than 100k students taking this certification.\",\n+    \"fsd-b-benefit-2-title\": \"Professional Certification\",\n+    \"fsd-b-benefit-2-description\": \"Prove your skills with an official, verifiable certification.\",\n+    \"fsd-b-benefit-3-title\": \"500+ Exercises\",\n+    \"fsd-b-benefit-3-description\": \"Solidify your knowledge with plenty of practice.\"\n   },\n   \"icons\": {\n     \"gold-cup\": \"Copa de Oro\","
        },
        {
            "sha": "d82f07c63575df370e4f11d275f18fb8d3eb9de2",
            "filename": "client/i18n/locales/german/intro.json",
            "status": "modified",
            "additions": 243,
            "deletions": 17,
            "changes": 260,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fgerman%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fgerman%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fgerman%2Fintro.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -890,7 +890,7 @@\n       \"learn-special-methods-by-building-a-vector-space\": {\n         \"title\": \"Learn Special Methods by Building a Vector Space\",\n         \"intro\": [\n-          \"Python special methods are called in response to specific operations and enable you to customize the behaviour of your objects in a detailed and effective way.\",\n+          \"Python special methods are called in response to specific operations and enable you to customize the behavior of your objects in a detailed and effective way.\",\n           \"In this project, you are going to explore some of the most common special methods while learning about vectors by building a vector space.\"\n         ]\n       },\n@@ -1761,7 +1761,7 @@\n       \"relational-databases\": \"Relational Databases\",\n       \"backend-javascript\": \"Backend JavaScript\",\n       \"python\": \"Python\",\n-      \"exam-certified-full-stack-developer\": \"Certified Full Stack Developer Exam\"\n+      \"career\": \"Career\"\n     },\n     \"modules\": {\n       \"basic-html\": \"Basic HTML\",\n@@ -1799,6 +1799,7 @@\n       \"review-javascript-fundamentals\": \"JavaScript Fundamentals Review\",\n       \"higher-order-functions-and-callbacks\": \"Higher Order Functions and Callbacks\",\n       \"dom-manipulation-and-events\": \"DOM Manipulation and Events\",\n+      \"js-a11y\": \"JavaScript and Accessibility\",\n       \"debugging-javascript\": \"Debugging\",\n       \"basic-regex\": \"Basic Regex\",\n       \"form-validation\": \"Form Validation\",\n@@ -1815,14 +1816,11 @@\n       \"react-fundamentals\": \"React Fundamentals\",\n       \"react-state-hooks-and-routing\": \"React State, Hooks, and Routing\",\n       \"performance\": \"Performance\",\n-      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"testing\": \"Testing\",\n+      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"typescript-fundamentals\": \"TypeScript Fundamentals\",\n       \"review-front-end-libraries\": \"Front End Libraries Review\",\n       \"exam-front-end-libraries\": \"Front End Libraries Exam\",\n-      \"sql-and-bash\": \"SQL and Bash\",\n-      \"git\": \"Git\",\n-      \"security-and-privacy\": \"Security and Privacy\",\n       \"python-basics\": \"Python Basics\",\n       \"python-loops-and-sequences\": \"Loops and Sequences\",\n       \"python-dictionaries-and-sets\": \"Dictionaries and Sets\",\n@@ -1834,7 +1832,228 @@\n       \"python-graphs-and-trees\": \"Graphs and Trees\",\n       \"python-dynamic-programming\": \"Dynamic Programming\",\n       \"review-python\": \"Python Review\",\n-      \"exam-python\": \"Python Exam\"\n+      \"exam-python\": \"Python Exam\",\n+      \"bash-fundamentals\": \"Bash Fundamentals\",\n+      \"relational-databases\": \"Relational Databases\",\n+      \"bash-scripting\": \"Bash Scripting\",\n+      \"sql-and-bash\": \"SQL and Bash\",\n+      \"git\": \"Git\",\n+      \"introduction-to-nodejs\": \"Introduction to Node.js\",\n+      \"nodejs-core-libraries\": \"Node.js Core Libraries\",\n+      \"node-package-manager\": \"Node Package Manager\",\n+      \"http-and-the-web-standards-model\": \"HTTP and the Web Standards Model\",\n+      \"rest-api-and-web-services\": \"REST API and Web Services\",\n+      \"introduction-to-express\": \"Introduction to Express\",\n+      \"express-middleware\": \"Express Middleware\",\n+      \"error-handling-in-express\": \"Error Handling in Express\",\n+      \"websockets\": \"WebSockets\",\n+      \"node-and-sql\": \"Node and SQL\",\n+      \"security-and-privacy\": \"Security and Privacy\",\n+      \"authentication\": \"Authentication\",\n+      \"tooling-and-deployment\": \"Tooling and Deployment\",\n+      \"how-to-get-a-developer-job\": \"How to Get a Developer Job\",\n+      \"capstone-project\": \"Capstone Project\",\n+      \"certified-full-stack-developer-exam\": \"Certified Full Stack Developer Exam\"\n+    },\n+    \"module-intros\": {\n+      \"css-libraries-and-frameworks\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to CSS libraries, frameworks, and preprocessors, including Tailwind CSS, Bootstrap, and Sass. You will build out various components using Tailwind CSS and test your knowledge of these tools with a short quiz.\"\n+        ]\n+      },\n+      \"typescript-fundamentals\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to TypeScript, which is a superset of JavaScript that allows you to add static typing to your JavaScript code. You will build several workshops and labs that will give you practice in working with generics, type narrowing, TSX, and more. Then you will test your knowledge of TypeScript fundamentals with a short quiz.\"\n+        ]\n+      },\n+      \"python-basics\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Python, which is used in many fields like data science, machine learning, web development, scripting and automation, embedded systems, IoT, and more. You will build out a workshop and lab to practice Python basics and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-loops-and-sequences\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with lists, tuples, lambda functions, loops, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dictionaries-and-sets\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to dictionaries, sets, and the Python standard library. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-error-handling\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will talk about common error messages, good debugging techniques, and exception handling. You will build a lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-classes-and-objects\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with classes, methods, attributes and properties. Then, you will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-object-oriented-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about Object-oriented programming concepts like encapsulation, inheritance, polymorphism, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-linear-data-structures\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about data structures including stacks, queues, linked lists, and more. You will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-algorithms\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about common algorithms including binary search, merge sort, selection sort, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-graphs-and-trees\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about graphs in computer science as well as adjacency lists, trees, tries, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dynamic-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  dynamic programming and practice these concepts by building a fibonacci sequence lab. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-fundamentals\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  the command line and common Bash commands. Then you will practice your skills with a workshop and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"relational-databases\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with relational databases which store data as collections in tables. Some of the concepts you will learn about include inserting and viewing table data, primary and foreign keys in SQL, and more. Then you will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-scripting\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about bash scripting and practice those skills by building five programs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"sql-and-bash\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about normalization, SQL injection, and the N+1 problem. Then you will get to practice working with SQL and Bash by building several workshops and labs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"git\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to use Git, Nano, and GitHub. Then you will get to practice working with Git by building several workshops and labs. You will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"introduction-to-nodejs\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Node.js, which is a JavaScript runtime environment that allows you to build backend applications using JavaScript. You will get to practice fundamental concepts by building a small workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"nodejs-core-libraries\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common Node.js core libraries including the fs, os, path and more. Then you will get to practice what you have learned through workshops and labs and test your knowledge through a short quiz.\"\n+        ]\n+      },\n+      \"node-package-manager\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to the Node Package Manager, which developers use to manage project dependencies and scripts. Then you will get to practice what you have learned through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"http-and-the-web-standards-model\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about HTTP (Hypertext Transfer Protocol) and other important concepts including the request-response model, common response codes, DNS, TCP/IP, and more. Then you will get to practice what you have learned through a build your own web server workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"rest-api-and-web-services\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about the REST API (Representational State Transfer Application Programming Interface) and how microservices work. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"introduction-to-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Express.js, which is a framework used to build RESTful APIs. Then you will practice your skills through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"express-middleware\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about middleware in Express.js, which is used to handle requests and responses between the client and server. You will then practice your skills through a workshop and lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"error-handling-in-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how error handling, debugging, and health checks work in Express.js. You will then practice what you have learned in a lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"websockets\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to websockets, which is a protocol used for real time communication with the client and server. You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"node-and-sql\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will practice building applications with Node and SQL. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"security-and-privacy\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about the differences between security and privacy as well as other concepts including  CSPs, Permissions-Policies, PII, working with CORS, and more. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"authentication\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how authentication works in web applications along with other important concepts including JWTs, CSRFs, Passport, Helmet, cryptography and encryption, and more.  You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"tooling-and-deployment\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common tools used in the industry for deploying your full stack applications. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"how-to-get-a-developer-job\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, Quincy Larson (Founder and teacher of freeCodeCamp) will talk about strategies you can use to prepare for getting a developer job. Quincy will cover key subjects including résumés, portfolios, researching the market, preparing for technical interviews, and more.\"\n+        ]\n+      },\n+      \"capstone-project\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be your opportunity to build out a full stack application encompassing what you have learned throughout this certification.\"\n+        ]\n+      },\n+      \"certified-full-stack-developer-exam\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be a 90 question exam testing what you have learned throughout this certification.\"\n+        ]\n+      }\n     },\n     \"blocks\": {\n       \"workshop-curriculum-outline\": {\n@@ -3155,6 +3374,19 @@\n           \"Test your knowledge of DOM manipulation and click events in JavaScript with this quiz.\"\n         ]\n       },\n+      \"review-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Review\",\n+        \"intro\": [\n+          \"Before you're quizzed on JavaScript and accessibility, you should review what you've learned about it.\",\n+          \"Open up this page to review concepts including how to work with the <code>aria-expanded</code>, <code>aria-live</code>, and <code>aria-controls</code> attributes.\"\n+        ]\n+      },\n+      \"quiz-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Quiz\",\n+        \"intro\": [\n+          \"Test your knowledge of JavaScript and accessibility best practices with this quiz.\"\n+        ]\n+      },\n       \"lecture-debugging-techniques\": {\n         \"title\": \"Debugging Techniques\",\n         \"intro\": [\n@@ -3792,7 +4024,9 @@\n       },\n       \"lecture-introduction-to-python\": {\n         \"title\": \"Introduction to Python\",\n-        \"intro\": [\"Learn about Introduction to Python in these lectures.\"]\n+        \"intro\": [\n+          \"In these lecture videos, you will learn the fundamentals of Python. You'll learn about variables, data types, operators, control flow, functions, and more.\"\n+        ]\n       },\n       \"workshop-caesar-cipher\": {\n         \"title\": \"Build a Caesar Cipher\",\n@@ -3810,7 +4044,7 @@\n         \"title\": \"Python Basics Review\",\n         \"intro\": [\n           \"Before you're quizzed on Python basics, you should review what you've learned about it.\",\n-          \"[Add more details]\"\n+          \"In this review page, you will review working with strings, functions, comparison operators and more.\"\n         ]\n       },\n       \"quiz-python-basics\": {\n@@ -4251,14 +4485,6 @@\n           \"In this 40-lesson workshop, you will learn how to edit files in the terminal with Nano while building a castle.\"\n         ]\n       },\n-      \"review-nano\": {\n-        \"title\": \"Nano Review\",\n-        \"intro\": [\"Review the Nano concepts to prepare for the upcoming quiz.\"]\n-      },\n-      \"quiz-nano\": {\n-        \"title\": \"Nano Quiz\",\n-        \"intro\": [\"Test what you've learned on Nano with this quiz .\"]\n-      },\n       \"rhhl\": {\n         \"title\": \"328\",\n         \"intro\": []"
        },
        {
            "sha": "e96e3a29d73e5edf3294b56b55bf05651b46406e",
            "filename": "client/i18n/locales/german/translations.json",
            "status": "modified",
            "additions": 9,
            "deletions": 1,
            "changes": 10,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fgerman%2Ftranslations.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fgerman%2Ftranslations.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fgerman%2Ftranslations.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -796,7 +796,15 @@\n     \"iframe-form-submit-alert\": \"Normalerweise würde dieses Formular übermittelt werden! Es funktioniert. Dies wird übermittelt an: {{externalLink}}\",\n     \"document-notfound\": \"Dokument wurde nicht gefunden\",\n     \"slow-load-msg\": \"Looks like this is taking longer than usual, please try refreshing the page.\",\n-    \"navigation-warning\": \"If you leave this page, you will lose your progress. Are you sure?\"\n+    \"navigation-warning\": \"If you leave this page, you will lose your progress. Are you sure?\",\n+    \"fsd-b-description\": \"This comprehensive course prepares you to become a Certified Full Stack Developer. You'll learn to build complete web applications using HTML, CSS, JavaScript, React, TypeScript, Node.js, Python, and more.\",\n+    \"fsd-b-cta\": \"Start Learning\",\n+    \"fsd-b-benefit-1-title\": \"100k+ Students\",\n+    \"fsd-b-benefit-1-description\": \"Join more than 100k students taking this certification.\",\n+    \"fsd-b-benefit-2-title\": \"Professional Certification\",\n+    \"fsd-b-benefit-2-description\": \"Prove your skills with an official, verifiable certification.\",\n+    \"fsd-b-benefit-3-title\": \"500+ Exercises\",\n+    \"fsd-b-benefit-3-description\": \"Solidify your knowledge with plenty of practice.\"\n   },\n   \"icons\": {\n     \"gold-cup\": \"Goldpokal\","
        },
        {
            "sha": "063ca6171c4f3a1b87571eee52f4b938a874549a",
            "filename": "client/i18n/locales/italian/intro.json",
            "status": "modified",
            "additions": 243,
            "deletions": 17,
            "changes": 260,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fitalian%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fitalian%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fitalian%2Fintro.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -890,7 +890,7 @@\n       \"learn-special-methods-by-building-a-vector-space\": {\n         \"title\": \"Learn Special Methods by Building a Vector Space\",\n         \"intro\": [\n-          \"Python special methods are called in response to specific operations and enable you to customize the behaviour of your objects in a detailed and effective way.\",\n+          \"Python special methods are called in response to specific operations and enable you to customize the behavior of your objects in a detailed and effective way.\",\n           \"In this project, you are going to explore some of the most common special methods while learning about vectors by building a vector space.\"\n         ]\n       },\n@@ -1761,7 +1761,7 @@\n       \"relational-databases\": \"Relational Databases\",\n       \"backend-javascript\": \"Backend JavaScript\",\n       \"python\": \"Python\",\n-      \"exam-certified-full-stack-developer\": \"Certified Full Stack Developer Exam\"\n+      \"career\": \"Career\"\n     },\n     \"modules\": {\n       \"basic-html\": \"Basic HTML\",\n@@ -1799,6 +1799,7 @@\n       \"review-javascript-fundamentals\": \"JavaScript Fundamentals Review\",\n       \"higher-order-functions-and-callbacks\": \"Higher Order Functions and Callbacks\",\n       \"dom-manipulation-and-events\": \"DOM Manipulation and Events\",\n+      \"js-a11y\": \"JavaScript and Accessibility\",\n       \"debugging-javascript\": \"Debugging\",\n       \"basic-regex\": \"Basic Regex\",\n       \"form-validation\": \"Form Validation\",\n@@ -1815,14 +1816,11 @@\n       \"react-fundamentals\": \"React Fundamentals\",\n       \"react-state-hooks-and-routing\": \"React State, Hooks, and Routing\",\n       \"performance\": \"Performance\",\n-      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"testing\": \"Testing\",\n+      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"typescript-fundamentals\": \"TypeScript Fundamentals\",\n       \"review-front-end-libraries\": \"Front End Libraries Review\",\n       \"exam-front-end-libraries\": \"Front End Libraries Exam\",\n-      \"sql-and-bash\": \"SQL and Bash\",\n-      \"git\": \"Git\",\n-      \"security-and-privacy\": \"Security and Privacy\",\n       \"python-basics\": \"Python Basics\",\n       \"python-loops-and-sequences\": \"Loops and Sequences\",\n       \"python-dictionaries-and-sets\": \"Dictionaries and Sets\",\n@@ -1834,7 +1832,228 @@\n       \"python-graphs-and-trees\": \"Graphs and Trees\",\n       \"python-dynamic-programming\": \"Dynamic Programming\",\n       \"review-python\": \"Python Review\",\n-      \"exam-python\": \"Python Exam\"\n+      \"exam-python\": \"Python Exam\",\n+      \"bash-fundamentals\": \"Bash Fundamentals\",\n+      \"relational-databases\": \"Relational Databases\",\n+      \"bash-scripting\": \"Bash Scripting\",\n+      \"sql-and-bash\": \"SQL and Bash\",\n+      \"git\": \"Git\",\n+      \"introduction-to-nodejs\": \"Introduction to Node.js\",\n+      \"nodejs-core-libraries\": \"Node.js Core Libraries\",\n+      \"node-package-manager\": \"Node Package Manager\",\n+      \"http-and-the-web-standards-model\": \"HTTP and the Web Standards Model\",\n+      \"rest-api-and-web-services\": \"REST API and Web Services\",\n+      \"introduction-to-express\": \"Introduction to Express\",\n+      \"express-middleware\": \"Express Middleware\",\n+      \"error-handling-in-express\": \"Error Handling in Express\",\n+      \"websockets\": \"WebSockets\",\n+      \"node-and-sql\": \"Node and SQL\",\n+      \"security-and-privacy\": \"Security and Privacy\",\n+      \"authentication\": \"Authentication\",\n+      \"tooling-and-deployment\": \"Tooling and Deployment\",\n+      \"how-to-get-a-developer-job\": \"How to Get a Developer Job\",\n+      \"capstone-project\": \"Capstone Project\",\n+      \"certified-full-stack-developer-exam\": \"Certified Full Stack Developer Exam\"\n+    },\n+    \"module-intros\": {\n+      \"css-libraries-and-frameworks\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to CSS libraries, frameworks, and preprocessors, including Tailwind CSS, Bootstrap, and Sass. You will build out various components using Tailwind CSS and test your knowledge of these tools with a short quiz.\"\n+        ]\n+      },\n+      \"typescript-fundamentals\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to TypeScript, which is a superset of JavaScript that allows you to add static typing to your JavaScript code. You will build several workshops and labs that will give you practice in working with generics, type narrowing, TSX, and more. Then you will test your knowledge of TypeScript fundamentals with a short quiz.\"\n+        ]\n+      },\n+      \"python-basics\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Python, which is used in many fields like data science, machine learning, web development, scripting and automation, embedded systems, IoT, and more. You will build out a workshop and lab to practice Python basics and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-loops-and-sequences\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with lists, tuples, lambda functions, loops, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dictionaries-and-sets\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to dictionaries, sets, and the Python standard library. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-error-handling\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will talk about common error messages, good debugging techniques, and exception handling. You will build a lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-classes-and-objects\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with classes, methods, attributes and properties. Then, you will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-object-oriented-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about Object-oriented programming concepts like encapsulation, inheritance, polymorphism, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-linear-data-structures\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about data structures including stacks, queues, linked lists, and more. You will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-algorithms\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about common algorithms including binary search, merge sort, selection sort, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-graphs-and-trees\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about graphs in computer science as well as adjacency lists, trees, tries, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dynamic-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  dynamic programming and practice these concepts by building a fibonacci sequence lab. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-fundamentals\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  the command line and common Bash commands. Then you will practice your skills with a workshop and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"relational-databases\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with relational databases which store data as collections in tables. Some of the concepts you will learn about include inserting and viewing table data, primary and foreign keys in SQL, and more. Then you will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-scripting\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about bash scripting and practice those skills by building five programs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"sql-and-bash\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about normalization, SQL injection, and the N+1 problem. Then you will get to practice working with SQL and Bash by building several workshops and labs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"git\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to use Git, Nano, and GitHub. Then you will get to practice working with Git by building several workshops and labs. You will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"introduction-to-nodejs\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Node.js, which is a JavaScript runtime environment that allows you to build backend applications using JavaScript. You will get to practice fundamental concepts by building a small workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"nodejs-core-libraries\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common Node.js core libraries including the fs, os, path and more. Then you will get to practice what you have learned through workshops and labs and test your knowledge through a short quiz.\"\n+        ]\n+      },\n+      \"node-package-manager\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to the Node Package Manager, which developers use to manage project dependencies and scripts. Then you will get to practice what you have learned through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"http-and-the-web-standards-model\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about HTTP (Hypertext Transfer Protocol) and other important concepts including the request-response model, common response codes, DNS, TCP/IP, and more. Then you will get to practice what you have learned through a build your own web server workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"rest-api-and-web-services\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about the REST API (Representational State Transfer Application Programming Interface) and how microservices work. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"introduction-to-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Express.js, which is a framework used to build RESTful APIs. Then you will practice your skills through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"express-middleware\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about middleware in Express.js, which is used to handle requests and responses between the client and server. You will then practice your skills through a workshop and lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"error-handling-in-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how error handling, debugging, and health checks work in Express.js. You will then practice what you have learned in a lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"websockets\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to websockets, which is a protocol used for real time communication with the client and server. You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"node-and-sql\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will practice building applications with Node and SQL. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"security-and-privacy\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about the differences between security and privacy as well as other concepts including  CSPs, Permissions-Policies, PII, working with CORS, and more. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"authentication\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how authentication works in web applications along with other important concepts including JWTs, CSRFs, Passport, Helmet, cryptography and encryption, and more.  You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"tooling-and-deployment\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common tools used in the industry for deploying your full stack applications. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"how-to-get-a-developer-job\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, Quincy Larson (Founder and teacher of freeCodeCamp) will talk about strategies you can use to prepare for getting a developer job. Quincy will cover key subjects including résumés, portfolios, researching the market, preparing for technical interviews, and more.\"\n+        ]\n+      },\n+      \"capstone-project\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be your opportunity to build out a full stack application encompassing what you have learned throughout this certification.\"\n+        ]\n+      },\n+      \"certified-full-stack-developer-exam\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be a 90 question exam testing what you have learned throughout this certification.\"\n+        ]\n+      }\n     },\n     \"blocks\": {\n       \"workshop-curriculum-outline\": {\n@@ -3155,6 +3374,19 @@\n           \"Test your knowledge of DOM manipulation and click events in JavaScript with this quiz.\"\n         ]\n       },\n+      \"review-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Review\",\n+        \"intro\": [\n+          \"Before you're quizzed on JavaScript and accessibility, you should review what you've learned about it.\",\n+          \"Open up this page to review concepts including how to work with the <code>aria-expanded</code>, <code>aria-live</code>, and <code>aria-controls</code> attributes.\"\n+        ]\n+      },\n+      \"quiz-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Quiz\",\n+        \"intro\": [\n+          \"Test your knowledge of JavaScript and accessibility best practices with this quiz.\"\n+        ]\n+      },\n       \"lecture-debugging-techniques\": {\n         \"title\": \"Debugging Techniques\",\n         \"intro\": [\n@@ -3792,7 +4024,9 @@\n       },\n       \"lecture-introduction-to-python\": {\n         \"title\": \"Introduction to Python\",\n-        \"intro\": [\"Learn about Introduction to Python in these lectures.\"]\n+        \"intro\": [\n+          \"In these lecture videos, you will learn the fundamentals of Python. You'll learn about variables, data types, operators, control flow, functions, and more.\"\n+        ]\n       },\n       \"workshop-caesar-cipher\": {\n         \"title\": \"Build a Caesar Cipher\",\n@@ -3810,7 +4044,7 @@\n         \"title\": \"Python Basics Review\",\n         \"intro\": [\n           \"Before you're quizzed on Python basics, you should review what you've learned about it.\",\n-          \"[Add more details]\"\n+          \"In this review page, you will review working with strings, functions, comparison operators and more.\"\n         ]\n       },\n       \"quiz-python-basics\": {\n@@ -4251,14 +4485,6 @@\n           \"In this 40-lesson workshop, you will learn how to edit files in the terminal with Nano while building a castle.\"\n         ]\n       },\n-      \"review-nano\": {\n-        \"title\": \"Nano Review\",\n-        \"intro\": [\"Review the Nano concepts to prepare for the upcoming quiz.\"]\n-      },\n-      \"quiz-nano\": {\n-        \"title\": \"Nano Quiz\",\n-        \"intro\": [\"Test what you've learned on Nano with this quiz .\"]\n-      },\n       \"rhhl\": {\n         \"title\": \"328\",\n         \"intro\": []"
        },
        {
            "sha": "aff2ad859d791b3f4d28abb6d38da2d4fb0c6ad9",
            "filename": "client/i18n/locales/italian/translations.json",
            "status": "modified",
            "additions": 9,
            "deletions": 1,
            "changes": 10,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fitalian%2Ftranslations.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fitalian%2Ftranslations.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fitalian%2Ftranslations.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -796,7 +796,15 @@\n     \"iframe-form-submit-alert\": \"Normalmente questo modulo sarebbe stato inviato! Funziona. Sarà inviato a: {{externalLink}}\",\n     \"document-notfound\": \"documento non trovato\",\n     \"slow-load-msg\": \"Sembra che sia necessario più tempo del solito, per favore prova ad aggiornare la pagina.\",\n-    \"navigation-warning\": \"If you leave this page, you will lose your progress. Are you sure?\"\n+    \"navigation-warning\": \"If you leave this page, you will lose your progress. Are you sure?\",\n+    \"fsd-b-description\": \"This comprehensive course prepares you to become a Certified Full Stack Developer. You'll learn to build complete web applications using HTML, CSS, JavaScript, React, TypeScript, Node.js, Python, and more.\",\n+    \"fsd-b-cta\": \"Start Learning\",\n+    \"fsd-b-benefit-1-title\": \"100k+ Students\",\n+    \"fsd-b-benefit-1-description\": \"Join more than 100k students taking this certification.\",\n+    \"fsd-b-benefit-2-title\": \"Professional Certification\",\n+    \"fsd-b-benefit-2-description\": \"Prove your skills with an official, verifiable certification.\",\n+    \"fsd-b-benefit-3-title\": \"500+ Exercises\",\n+    \"fsd-b-benefit-3-description\": \"Solidify your knowledge with plenty of practice.\"\n   },\n   \"icons\": {\n     \"gold-cup\": \"Coppa d'Oro\","
        },
        {
            "sha": "8c7f2f55826e1f6fd9220212a75a6e93abb510e4",
            "filename": "client/i18n/locales/japanese/intro.json",
            "status": "modified",
            "additions": 243,
            "deletions": 17,
            "changes": 260,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fjapanese%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fjapanese%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fjapanese%2Fintro.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -890,7 +890,7 @@\n       \"learn-special-methods-by-building-a-vector-space\": {\n         \"title\": \"Learn Special Methods by Building a Vector Space\",\n         \"intro\": [\n-          \"Python special methods are called in response to specific operations and enable you to customize the behaviour of your objects in a detailed and effective way.\",\n+          \"Python special methods are called in response to specific operations and enable you to customize the behavior of your objects in a detailed and effective way.\",\n           \"In this project, you are going to explore some of the most common special methods while learning about vectors by building a vector space.\"\n         ]\n       },\n@@ -1761,7 +1761,7 @@\n       \"relational-databases\": \"Relational Databases\",\n       \"backend-javascript\": \"Backend JavaScript\",\n       \"python\": \"Python\",\n-      \"exam-certified-full-stack-developer\": \"Certified Full Stack Developer Exam\"\n+      \"career\": \"Career\"\n     },\n     \"modules\": {\n       \"basic-html\": \"Basic HTML\",\n@@ -1799,6 +1799,7 @@\n       \"review-javascript-fundamentals\": \"JavaScript Fundamentals Review\",\n       \"higher-order-functions-and-callbacks\": \"Higher Order Functions and Callbacks\",\n       \"dom-manipulation-and-events\": \"DOM Manipulation and Events\",\n+      \"js-a11y\": \"JavaScript and Accessibility\",\n       \"debugging-javascript\": \"Debugging\",\n       \"basic-regex\": \"Basic Regex\",\n       \"form-validation\": \"Form Validation\",\n@@ -1815,14 +1816,11 @@\n       \"react-fundamentals\": \"React Fundamentals\",\n       \"react-state-hooks-and-routing\": \"React State, Hooks, and Routing\",\n       \"performance\": \"Performance\",\n-      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"testing\": \"Testing\",\n+      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"typescript-fundamentals\": \"TypeScript Fundamentals\",\n       \"review-front-end-libraries\": \"Front End Libraries Review\",\n       \"exam-front-end-libraries\": \"Front End Libraries Exam\",\n-      \"sql-and-bash\": \"SQL and Bash\",\n-      \"git\": \"Git\",\n-      \"security-and-privacy\": \"Security and Privacy\",\n       \"python-basics\": \"Python Basics\",\n       \"python-loops-and-sequences\": \"Loops and Sequences\",\n       \"python-dictionaries-and-sets\": \"Dictionaries and Sets\",\n@@ -1834,7 +1832,228 @@\n       \"python-graphs-and-trees\": \"Graphs and Trees\",\n       \"python-dynamic-programming\": \"Dynamic Programming\",\n       \"review-python\": \"Python Review\",\n-      \"exam-python\": \"Python Exam\"\n+      \"exam-python\": \"Python Exam\",\n+      \"bash-fundamentals\": \"Bash Fundamentals\",\n+      \"relational-databases\": \"Relational Databases\",\n+      \"bash-scripting\": \"Bash Scripting\",\n+      \"sql-and-bash\": \"SQL and Bash\",\n+      \"git\": \"Git\",\n+      \"introduction-to-nodejs\": \"Introduction to Node.js\",\n+      \"nodejs-core-libraries\": \"Node.js Core Libraries\",\n+      \"node-package-manager\": \"Node Package Manager\",\n+      \"http-and-the-web-standards-model\": \"HTTP and the Web Standards Model\",\n+      \"rest-api-and-web-services\": \"REST API and Web Services\",\n+      \"introduction-to-express\": \"Introduction to Express\",\n+      \"express-middleware\": \"Express Middleware\",\n+      \"error-handling-in-express\": \"Error Handling in Express\",\n+      \"websockets\": \"WebSockets\",\n+      \"node-and-sql\": \"Node and SQL\",\n+      \"security-and-privacy\": \"Security and Privacy\",\n+      \"authentication\": \"Authentication\",\n+      \"tooling-and-deployment\": \"Tooling and Deployment\",\n+      \"how-to-get-a-developer-job\": \"How to Get a Developer Job\",\n+      \"capstone-project\": \"Capstone Project\",\n+      \"certified-full-stack-developer-exam\": \"Certified Full Stack Developer Exam\"\n+    },\n+    \"module-intros\": {\n+      \"css-libraries-and-frameworks\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to CSS libraries, frameworks, and preprocessors, including Tailwind CSS, Bootstrap, and Sass. You will build out various components using Tailwind CSS and test your knowledge of these tools with a short quiz.\"\n+        ]\n+      },\n+      \"typescript-fundamentals\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to TypeScript, which is a superset of JavaScript that allows you to add static typing to your JavaScript code. You will build several workshops and labs that will give you practice in working with generics, type narrowing, TSX, and more. Then you will test your knowledge of TypeScript fundamentals with a short quiz.\"\n+        ]\n+      },\n+      \"python-basics\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Python, which is used in many fields like data science, machine learning, web development, scripting and automation, embedded systems, IoT, and more. You will build out a workshop and lab to practice Python basics and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-loops-and-sequences\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with lists, tuples, lambda functions, loops, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dictionaries-and-sets\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to dictionaries, sets, and the Python standard library. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-error-handling\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will talk about common error messages, good debugging techniques, and exception handling. You will build a lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-classes-and-objects\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with classes, methods, attributes and properties. Then, you will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-object-oriented-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about Object-oriented programming concepts like encapsulation, inheritance, polymorphism, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-linear-data-structures\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about data structures including stacks, queues, linked lists, and more. You will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-algorithms\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about common algorithms including binary search, merge sort, selection sort, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-graphs-and-trees\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about graphs in computer science as well as adjacency lists, trees, tries, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dynamic-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  dynamic programming and practice these concepts by building a fibonacci sequence lab. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-fundamentals\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  the command line and common Bash commands. Then you will practice your skills with a workshop and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"relational-databases\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with relational databases which store data as collections in tables. Some of the concepts you will learn about include inserting and viewing table data, primary and foreign keys in SQL, and more. Then you will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-scripting\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about bash scripting and practice those skills by building five programs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"sql-and-bash\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about normalization, SQL injection, and the N+1 problem. Then you will get to practice working with SQL and Bash by building several workshops and labs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"git\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to use Git, Nano, and GitHub. Then you will get to practice working with Git by building several workshops and labs. You will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"introduction-to-nodejs\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Node.js, which is a JavaScript runtime environment that allows you to build backend applications using JavaScript. You will get to practice fundamental concepts by building a small workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"nodejs-core-libraries\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common Node.js core libraries including the fs, os, path and more. Then you will get to practice what you have learned through workshops and labs and test your knowledge through a short quiz.\"\n+        ]\n+      },\n+      \"node-package-manager\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to the Node Package Manager, which developers use to manage project dependencies and scripts. Then you will get to practice what you have learned through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"http-and-the-web-standards-model\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about HTTP (Hypertext Transfer Protocol) and other important concepts including the request-response model, common response codes, DNS, TCP/IP, and more. Then you will get to practice what you have learned through a build your own web server workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"rest-api-and-web-services\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about the REST API (Representational State Transfer Application Programming Interface) and how microservices work. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"introduction-to-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Express.js, which is a framework used to build RESTful APIs. Then you will practice your skills through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"express-middleware\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about middleware in Express.js, which is used to handle requests and responses between the client and server. You will then practice your skills through a workshop and lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"error-handling-in-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how error handling, debugging, and health checks work in Express.js. You will then practice what you have learned in a lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"websockets\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to websockets, which is a protocol used for real time communication with the client and server. You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"node-and-sql\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will practice building applications with Node and SQL. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"security-and-privacy\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about the differences between security and privacy as well as other concepts including  CSPs, Permissions-Policies, PII, working with CORS, and more. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"authentication\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how authentication works in web applications along with other important concepts including JWTs, CSRFs, Passport, Helmet, cryptography and encryption, and more.  You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"tooling-and-deployment\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common tools used in the industry for deploying your full stack applications. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"how-to-get-a-developer-job\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, Quincy Larson (Founder and teacher of freeCodeCamp) will talk about strategies you can use to prepare for getting a developer job. Quincy will cover key subjects including résumés, portfolios, researching the market, preparing for technical interviews, and more.\"\n+        ]\n+      },\n+      \"capstone-project\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be your opportunity to build out a full stack application encompassing what you have learned throughout this certification.\"\n+        ]\n+      },\n+      \"certified-full-stack-developer-exam\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be a 90 question exam testing what you have learned throughout this certification.\"\n+        ]\n+      }\n     },\n     \"blocks\": {\n       \"workshop-curriculum-outline\": {\n@@ -3155,6 +3374,19 @@\n           \"Test your knowledge of DOM manipulation and click events in JavaScript with this quiz.\"\n         ]\n       },\n+      \"review-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Review\",\n+        \"intro\": [\n+          \"Before you're quizzed on JavaScript and accessibility, you should review what you've learned about it.\",\n+          \"Open up this page to review concepts including how to work with the <code>aria-expanded</code>, <code>aria-live</code>, and <code>aria-controls</code> attributes.\"\n+        ]\n+      },\n+      \"quiz-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Quiz\",\n+        \"intro\": [\n+          \"Test your knowledge of JavaScript and accessibility best practices with this quiz.\"\n+        ]\n+      },\n       \"lecture-debugging-techniques\": {\n         \"title\": \"Debugging Techniques\",\n         \"intro\": [\n@@ -3792,7 +4024,9 @@\n       },\n       \"lecture-introduction-to-python\": {\n         \"title\": \"Introduction to Python\",\n-        \"intro\": [\"Learn about Introduction to Python in these lectures.\"]\n+        \"intro\": [\n+          \"In these lecture videos, you will learn the fundamentals of Python. You'll learn about variables, data types, operators, control flow, functions, and more.\"\n+        ]\n       },\n       \"workshop-caesar-cipher\": {\n         \"title\": \"Build a Caesar Cipher\",\n@@ -3810,7 +4044,7 @@\n         \"title\": \"Python Basics Review\",\n         \"intro\": [\n           \"Before you're quizzed on Python basics, you should review what you've learned about it.\",\n-          \"[Add more details]\"\n+          \"In this review page, you will review working with strings, functions, comparison operators and more.\"\n         ]\n       },\n       \"quiz-python-basics\": {\n@@ -4251,14 +4485,6 @@\n           \"In this 40-lesson workshop, you will learn how to edit files in the terminal with Nano while building a castle.\"\n         ]\n       },\n-      \"review-nano\": {\n-        \"title\": \"Nano Review\",\n-        \"intro\": [\"Review the Nano concepts to prepare for the upcoming quiz.\"]\n-      },\n-      \"quiz-nano\": {\n-        \"title\": \"Nano Quiz\",\n-        \"intro\": [\"Test what you've learned on Nano with this quiz .\"]\n-      },\n       \"rhhl\": {\n         \"title\": \"328\",\n         \"intro\": []"
        },
        {
            "sha": "7d373249ef6ac52cbe341430d49e9091620f8a70",
            "filename": "client/i18n/locales/japanese/translations.json",
            "status": "modified",
            "additions": 9,
            "deletions": 1,
            "changes": 10,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fjapanese%2Ftranslations.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fjapanese%2Ftranslations.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fjapanese%2Ftranslations.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -796,7 +796,15 @@\n     \"iframe-form-submit-alert\": \"通常はこれでフォームが送信されます。正しく動作しています。フォームは {{externalLink}} へ送信されます。\",\n     \"document-notfound\": \"ドキュメントが見つかりませんでした\",\n     \"slow-load-msg\": \"通常より処理に時間がかかっているようです。ページの再読み込みをお試しください。\",\n-    \"navigation-warning\": \"このページを離れると、進捗状況が失われます。よろしいですか？\"\n+    \"navigation-warning\": \"このページを離れると、進捗状況が失われます。よろしいですか？\",\n+    \"fsd-b-description\": \"This comprehensive course prepares you to become a Certified Full Stack Developer. You'll learn to build complete web applications using HTML, CSS, JavaScript, React, TypeScript, Node.js, Python, and more.\",\n+    \"fsd-b-cta\": \"Start Learning\",\n+    \"fsd-b-benefit-1-title\": \"100k+ Students\",\n+    \"fsd-b-benefit-1-description\": \"Join more than 100k students taking this certification.\",\n+    \"fsd-b-benefit-2-title\": \"Professional Certification\",\n+    \"fsd-b-benefit-2-description\": \"Prove your skills with an official, verifiable certification.\",\n+    \"fsd-b-benefit-3-title\": \"500+ Exercises\",\n+    \"fsd-b-benefit-3-description\": \"Solidify your knowledge with plenty of practice.\"\n   },\n   \"icons\": {\n     \"gold-cup\": \"ゴールドカップ\","
        },
        {
            "sha": "c186673346356c6b8aa8077393ac567c874c14f1",
            "filename": "client/i18n/locales/korean/intro.json",
            "status": "modified",
            "additions": 243,
            "deletions": 17,
            "changes": 260,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fkorean%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fkorean%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fkorean%2Fintro.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -890,7 +890,7 @@\n       \"learn-special-methods-by-building-a-vector-space\": {\n         \"title\": \"Learn Special Methods by Building a Vector Space\",\n         \"intro\": [\n-          \"Python special methods are called in response to specific operations and enable you to customize the behaviour of your objects in a detailed and effective way.\",\n+          \"Python special methods are called in response to specific operations and enable you to customize the behavior of your objects in a detailed and effective way.\",\n           \"In this project, you are going to explore some of the most common special methods while learning about vectors by building a vector space.\"\n         ]\n       },\n@@ -1761,7 +1761,7 @@\n       \"relational-databases\": \"Relational Databases\",\n       \"backend-javascript\": \"Backend JavaScript\",\n       \"python\": \"Python\",\n-      \"exam-certified-full-stack-developer\": \"Certified Full Stack Developer Exam\"\n+      \"career\": \"Career\"\n     },\n     \"modules\": {\n       \"basic-html\": \"Basic HTML\",\n@@ -1799,6 +1799,7 @@\n       \"review-javascript-fundamentals\": \"JavaScript Fundamentals Review\",\n       \"higher-order-functions-and-callbacks\": \"Higher Order Functions and Callbacks\",\n       \"dom-manipulation-and-events\": \"DOM Manipulation and Events\",\n+      \"js-a11y\": \"JavaScript and Accessibility\",\n       \"debugging-javascript\": \"Debugging\",\n       \"basic-regex\": \"Basic Regex\",\n       \"form-validation\": \"Form Validation\",\n@@ -1815,14 +1816,11 @@\n       \"react-fundamentals\": \"React Fundamentals\",\n       \"react-state-hooks-and-routing\": \"React State, Hooks, and Routing\",\n       \"performance\": \"Performance\",\n-      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"testing\": \"Testing\",\n+      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"typescript-fundamentals\": \"TypeScript Fundamentals\",\n       \"review-front-end-libraries\": \"Front End Libraries Review\",\n       \"exam-front-end-libraries\": \"Front End Libraries Exam\",\n-      \"sql-and-bash\": \"SQL and Bash\",\n-      \"git\": \"Git\",\n-      \"security-and-privacy\": \"Security and Privacy\",\n       \"python-basics\": \"Python Basics\",\n       \"python-loops-and-sequences\": \"Loops and Sequences\",\n       \"python-dictionaries-and-sets\": \"Dictionaries and Sets\",\n@@ -1834,7 +1832,228 @@\n       \"python-graphs-and-trees\": \"Graphs and Trees\",\n       \"python-dynamic-programming\": \"Dynamic Programming\",\n       \"review-python\": \"Python Review\",\n-      \"exam-python\": \"Python Exam\"\n+      \"exam-python\": \"Python Exam\",\n+      \"bash-fundamentals\": \"Bash Fundamentals\",\n+      \"relational-databases\": \"Relational Databases\",\n+      \"bash-scripting\": \"Bash Scripting\",\n+      \"sql-and-bash\": \"SQL and Bash\",\n+      \"git\": \"Git\",\n+      \"introduction-to-nodejs\": \"Introduction to Node.js\",\n+      \"nodejs-core-libraries\": \"Node.js Core Libraries\",\n+      \"node-package-manager\": \"Node Package Manager\",\n+      \"http-and-the-web-standards-model\": \"HTTP and the Web Standards Model\",\n+      \"rest-api-and-web-services\": \"REST API and Web Services\",\n+      \"introduction-to-express\": \"Introduction to Express\",\n+      \"express-middleware\": \"Express Middleware\",\n+      \"error-handling-in-express\": \"Error Handling in Express\",\n+      \"websockets\": \"WebSockets\",\n+      \"node-and-sql\": \"Node and SQL\",\n+      \"security-and-privacy\": \"Security and Privacy\",\n+      \"authentication\": \"Authentication\",\n+      \"tooling-and-deployment\": \"Tooling and Deployment\",\n+      \"how-to-get-a-developer-job\": \"How to Get a Developer Job\",\n+      \"capstone-project\": \"Capstone Project\",\n+      \"certified-full-stack-developer-exam\": \"Certified Full Stack Developer Exam\"\n+    },\n+    \"module-intros\": {\n+      \"css-libraries-and-frameworks\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to CSS libraries, frameworks, and preprocessors, including Tailwind CSS, Bootstrap, and Sass. You will build out various components using Tailwind CSS and test your knowledge of these tools with a short quiz.\"\n+        ]\n+      },\n+      \"typescript-fundamentals\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to TypeScript, which is a superset of JavaScript that allows you to add static typing to your JavaScript code. You will build several workshops and labs that will give you practice in working with generics, type narrowing, TSX, and more. Then you will test your knowledge of TypeScript fundamentals with a short quiz.\"\n+        ]\n+      },\n+      \"python-basics\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Python, which is used in many fields like data science, machine learning, web development, scripting and automation, embedded systems, IoT, and more. You will build out a workshop and lab to practice Python basics and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-loops-and-sequences\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with lists, tuples, lambda functions, loops, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dictionaries-and-sets\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to dictionaries, sets, and the Python standard library. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-error-handling\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will talk about common error messages, good debugging techniques, and exception handling. You will build a lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-classes-and-objects\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with classes, methods, attributes and properties. Then, you will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-object-oriented-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about Object-oriented programming concepts like encapsulation, inheritance, polymorphism, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-linear-data-structures\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about data structures including stacks, queues, linked lists, and more. You will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-algorithms\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about common algorithms including binary search, merge sort, selection sort, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-graphs-and-trees\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about graphs in computer science as well as adjacency lists, trees, tries, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dynamic-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  dynamic programming and practice these concepts by building a fibonacci sequence lab. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-fundamentals\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  the command line and common Bash commands. Then you will practice your skills with a workshop and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"relational-databases\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with relational databases which store data as collections in tables. Some of the concepts you will learn about include inserting and viewing table data, primary and foreign keys in SQL, and more. Then you will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-scripting\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about bash scripting and practice those skills by building five programs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"sql-and-bash\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about normalization, SQL injection, and the N+1 problem. Then you will get to practice working with SQL and Bash by building several workshops and labs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"git\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to use Git, Nano, and GitHub. Then you will get to practice working with Git by building several workshops and labs. You will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"introduction-to-nodejs\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Node.js, which is a JavaScript runtime environment that allows you to build backend applications using JavaScript. You will get to practice fundamental concepts by building a small workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"nodejs-core-libraries\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common Node.js core libraries including the fs, os, path and more. Then you will get to practice what you have learned through workshops and labs and test your knowledge through a short quiz.\"\n+        ]\n+      },\n+      \"node-package-manager\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to the Node Package Manager, which developers use to manage project dependencies and scripts. Then you will get to practice what you have learned through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"http-and-the-web-standards-model\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about HTTP (Hypertext Transfer Protocol) and other important concepts including the request-response model, common response codes, DNS, TCP/IP, and more. Then you will get to practice what you have learned through a build your own web server workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"rest-api-and-web-services\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about the REST API (Representational State Transfer Application Programming Interface) and how microservices work. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"introduction-to-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Express.js, which is a framework used to build RESTful APIs. Then you will practice your skills through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"express-middleware\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about middleware in Express.js, which is used to handle requests and responses between the client and server. You will then practice your skills through a workshop and lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"error-handling-in-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how error handling, debugging, and health checks work in Express.js. You will then practice what you have learned in a lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"websockets\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to websockets, which is a protocol used for real time communication with the client and server. You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"node-and-sql\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will practice building applications with Node and SQL. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"security-and-privacy\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about the differences between security and privacy as well as other concepts including  CSPs, Permissions-Policies, PII, working with CORS, and more. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"authentication\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how authentication works in web applications along with other important concepts including JWTs, CSRFs, Passport, Helmet, cryptography and encryption, and more.  You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"tooling-and-deployment\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common tools used in the industry for deploying your full stack applications. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"how-to-get-a-developer-job\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, Quincy Larson (Founder and teacher of freeCodeCamp) will talk about strategies you can use to prepare for getting a developer job. Quincy will cover key subjects including résumés, portfolios, researching the market, preparing for technical interviews, and more.\"\n+        ]\n+      },\n+      \"capstone-project\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be your opportunity to build out a full stack application encompassing what you have learned throughout this certification.\"\n+        ]\n+      },\n+      \"certified-full-stack-developer-exam\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be a 90 question exam testing what you have learned throughout this certification.\"\n+        ]\n+      }\n     },\n     \"blocks\": {\n       \"workshop-curriculum-outline\": {\n@@ -3155,6 +3374,19 @@\n           \"Test your knowledge of DOM manipulation and click events in JavaScript with this quiz.\"\n         ]\n       },\n+      \"review-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Review\",\n+        \"intro\": [\n+          \"Before you're quizzed on JavaScript and accessibility, you should review what you've learned about it.\",\n+          \"Open up this page to review concepts including how to work with the <code>aria-expanded</code>, <code>aria-live</code>, and <code>aria-controls</code> attributes.\"\n+        ]\n+      },\n+      \"quiz-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Quiz\",\n+        \"intro\": [\n+          \"Test your knowledge of JavaScript and accessibility best practices with this quiz.\"\n+        ]\n+      },\n       \"lecture-debugging-techniques\": {\n         \"title\": \"Debugging Techniques\",\n         \"intro\": [\n@@ -3792,7 +4024,9 @@\n       },\n       \"lecture-introduction-to-python\": {\n         \"title\": \"Introduction to Python\",\n-        \"intro\": [\"Learn about Introduction to Python in these lectures.\"]\n+        \"intro\": [\n+          \"In these lecture videos, you will learn the fundamentals of Python. You'll learn about variables, data types, operators, control flow, functions, and more.\"\n+        ]\n       },\n       \"workshop-caesar-cipher\": {\n         \"title\": \"Build a Caesar Cipher\",\n@@ -3810,7 +4044,7 @@\n         \"title\": \"Python Basics Review\",\n         \"intro\": [\n           \"Before you're quizzed on Python basics, you should review what you've learned about it.\",\n-          \"[Add more details]\"\n+          \"In this review page, you will review working with strings, functions, comparison operators and more.\"\n         ]\n       },\n       \"quiz-python-basics\": {\n@@ -4251,14 +4485,6 @@\n           \"In this 40-lesson workshop, you will learn how to edit files in the terminal with Nano while building a castle.\"\n         ]\n       },\n-      \"review-nano\": {\n-        \"title\": \"Nano Review\",\n-        \"intro\": [\"Review the Nano concepts to prepare for the upcoming quiz.\"]\n-      },\n-      \"quiz-nano\": {\n-        \"title\": \"Nano Quiz\",\n-        \"intro\": [\"Test what you've learned on Nano with this quiz .\"]\n-      },\n       \"rhhl\": {\n         \"title\": \"328\",\n         \"intro\": []"
        },
        {
            "sha": "2f270ef0552bbdaa5735f3faa08ab6f2062e1e2a",
            "filename": "client/i18n/locales/korean/translations.json",
            "status": "modified",
            "additions": 9,
            "deletions": 1,
            "changes": 10,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fkorean%2Ftranslations.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fkorean%2Ftranslations.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fkorean%2Ftranslations.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -796,7 +796,15 @@\n     \"iframe-form-submit-alert\": \"Normally this form would be submitted! It works. This will be submitted to: {{externalLink}}\",\n     \"document-notfound\": \"document not found\",\n     \"slow-load-msg\": \"Looks like this is taking longer than usual, please try refreshing the page.\",\n-    \"navigation-warning\": \"If you leave this page, you will lose your progress. Are you sure?\"\n+    \"navigation-warning\": \"If you leave this page, you will lose your progress. Are you sure?\",\n+    \"fsd-b-description\": \"This comprehensive course prepares you to become a Certified Full Stack Developer. You'll learn to build complete web applications using HTML, CSS, JavaScript, React, TypeScript, Node.js, Python, and more.\",\n+    \"fsd-b-cta\": \"Start Learning\",\n+    \"fsd-b-benefit-1-title\": \"100k+ Students\",\n+    \"fsd-b-benefit-1-description\": \"Join more than 100k students taking this certification.\",\n+    \"fsd-b-benefit-2-title\": \"Professional Certification\",\n+    \"fsd-b-benefit-2-description\": \"Prove your skills with an official, verifiable certification.\",\n+    \"fsd-b-benefit-3-title\": \"500+ Exercises\",\n+    \"fsd-b-benefit-3-description\": \"Solidify your knowledge with plenty of practice.\"\n   },\n   \"icons\": {\n     \"gold-cup\": \"Gold Cup\","
        },
        {
            "sha": "e6916015b7a86ec12b08c6c9c3280bf67957b2b9",
            "filename": "client/i18n/locales/portuguese/intro.json",
            "status": "modified",
            "additions": 243,
            "deletions": 17,
            "changes": 260,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fportuguese%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fportuguese%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fportuguese%2Fintro.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -890,7 +890,7 @@\n       \"learn-special-methods-by-building-a-vector-space\": {\n         \"title\": \"Aprenda métodos especiais criando um espaço vetorial\",\n         \"intro\": [\n-          \"Os métodos especiais do Python são chamados em resposta a operações específicas e permitem que você personalize o comportamento dos objetos de modo detalhado e eficaz.\",\n+          \"Python special methods are called in response to specific operations and enable you to customize the behavior of your objects in a detailed and effective way.\",\n           \"Neste projeto, você vai explorar alguns dos métodos especiais mais comuns enquanto aprende sobre vetores criando um espaço vetorial.\"\n         ]\n       },\n@@ -1761,7 +1761,7 @@\n       \"relational-databases\": \"Relational Databases\",\n       \"backend-javascript\": \"Backend JavaScript\",\n       \"python\": \"Python\",\n-      \"exam-certified-full-stack-developer\": \"Certified Full Stack Developer Exam\"\n+      \"career\": \"Career\"\n     },\n     \"modules\": {\n       \"basic-html\": \"Basic HTML\",\n@@ -1799,6 +1799,7 @@\n       \"review-javascript-fundamentals\": \"JavaScript Fundamentals Review\",\n       \"higher-order-functions-and-callbacks\": \"Higher Order Functions and Callbacks\",\n       \"dom-manipulation-and-events\": \"DOM Manipulation and Events\",\n+      \"js-a11y\": \"JavaScript and Accessibility\",\n       \"debugging-javascript\": \"Debugging\",\n       \"basic-regex\": \"Basic Regex\",\n       \"form-validation\": \"Form Validation\",\n@@ -1815,14 +1816,11 @@\n       \"react-fundamentals\": \"React Fundamentals\",\n       \"react-state-hooks-and-routing\": \"React State, Hooks, and Routing\",\n       \"performance\": \"Performance\",\n-      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"testing\": \"Testing\",\n+      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"typescript-fundamentals\": \"TypeScript Fundamentals\",\n       \"review-front-end-libraries\": \"Front End Libraries Review\",\n       \"exam-front-end-libraries\": \"Front End Libraries Exam\",\n-      \"sql-and-bash\": \"SQL and Bash\",\n-      \"git\": \"Git\",\n-      \"security-and-privacy\": \"Security and Privacy\",\n       \"python-basics\": \"Python Basics\",\n       \"python-loops-and-sequences\": \"Loops and Sequences\",\n       \"python-dictionaries-and-sets\": \"Dictionaries and Sets\",\n@@ -1834,7 +1832,228 @@\n       \"python-graphs-and-trees\": \"Graphs and Trees\",\n       \"python-dynamic-programming\": \"Dynamic Programming\",\n       \"review-python\": \"Python Review\",\n-      \"exam-python\": \"Python Exam\"\n+      \"exam-python\": \"Python Exam\",\n+      \"bash-fundamentals\": \"Bash Fundamentals\",\n+      \"relational-databases\": \"Relational Databases\",\n+      \"bash-scripting\": \"Bash Scripting\",\n+      \"sql-and-bash\": \"SQL and Bash\",\n+      \"git\": \"Git\",\n+      \"introduction-to-nodejs\": \"Introduction to Node.js\",\n+      \"nodejs-core-libraries\": \"Node.js Core Libraries\",\n+      \"node-package-manager\": \"Node Package Manager\",\n+      \"http-and-the-web-standards-model\": \"HTTP and the Web Standards Model\",\n+      \"rest-api-and-web-services\": \"REST API and Web Services\",\n+      \"introduction-to-express\": \"Introduction to Express\",\n+      \"express-middleware\": \"Express Middleware\",\n+      \"error-handling-in-express\": \"Error Handling in Express\",\n+      \"websockets\": \"WebSockets\",\n+      \"node-and-sql\": \"Node and SQL\",\n+      \"security-and-privacy\": \"Security and Privacy\",\n+      \"authentication\": \"Authentication\",\n+      \"tooling-and-deployment\": \"Tooling and Deployment\",\n+      \"how-to-get-a-developer-job\": \"How to Get a Developer Job\",\n+      \"capstone-project\": \"Capstone Project\",\n+      \"certified-full-stack-developer-exam\": \"Certified Full Stack Developer Exam\"\n+    },\n+    \"module-intros\": {\n+      \"css-libraries-and-frameworks\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to CSS libraries, frameworks, and preprocessors, including Tailwind CSS, Bootstrap, and Sass. You will build out various components using Tailwind CSS and test your knowledge of these tools with a short quiz.\"\n+        ]\n+      },\n+      \"typescript-fundamentals\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to TypeScript, which is a superset of JavaScript that allows you to add static typing to your JavaScript code. You will build several workshops and labs that will give you practice in working with generics, type narrowing, TSX, and more. Then you will test your knowledge of TypeScript fundamentals with a short quiz.\"\n+        ]\n+      },\n+      \"python-basics\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Python, which is used in many fields like data science, machine learning, web development, scripting and automation, embedded systems, IoT, and more. You will build out a workshop and lab to practice Python basics and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-loops-and-sequences\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with lists, tuples, lambda functions, loops, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dictionaries-and-sets\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to dictionaries, sets, and the Python standard library. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-error-handling\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will talk about common error messages, good debugging techniques, and exception handling. You will build a lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-classes-and-objects\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with classes, methods, attributes and properties. Then, you will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-object-oriented-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about Object-oriented programming concepts like encapsulation, inheritance, polymorphism, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-linear-data-structures\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about data structures including stacks, queues, linked lists, and more. You will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-algorithms\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about common algorithms including binary search, merge sort, selection sort, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-graphs-and-trees\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about graphs in computer science as well as adjacency lists, trees, tries, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dynamic-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  dynamic programming and practice these concepts by building a fibonacci sequence lab. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-fundamentals\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  the command line and common Bash commands. Then you will practice your skills with a workshop and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"relational-databases\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with relational databases which store data as collections in tables. Some of the concepts you will learn about include inserting and viewing table data, primary and foreign keys in SQL, and more. Then you will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-scripting\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about bash scripting and practice those skills by building five programs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"sql-and-bash\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about normalization, SQL injection, and the N+1 problem. Then you will get to practice working with SQL and Bash by building several workshops and labs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"git\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to use Git, Nano, and GitHub. Then you will get to practice working with Git by building several workshops and labs. You will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"introduction-to-nodejs\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Node.js, which is a JavaScript runtime environment that allows you to build backend applications using JavaScript. You will get to practice fundamental concepts by building a small workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"nodejs-core-libraries\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common Node.js core libraries including the fs, os, path and more. Then you will get to practice what you have learned through workshops and labs and test your knowledge through a short quiz.\"\n+        ]\n+      },\n+      \"node-package-manager\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to the Node Package Manager, which developers use to manage project dependencies and scripts. Then you will get to practice what you have learned through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"http-and-the-web-standards-model\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about HTTP (Hypertext Transfer Protocol) and other important concepts including the request-response model, common response codes, DNS, TCP/IP, and more. Then you will get to practice what you have learned through a build your own web server workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"rest-api-and-web-services\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about the REST API (Representational State Transfer Application Programming Interface) and how microservices work. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"introduction-to-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Express.js, which is a framework used to build RESTful APIs. Then you will practice your skills through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"express-middleware\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about middleware in Express.js, which is used to handle requests and responses between the client and server. You will then practice your skills through a workshop and lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"error-handling-in-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how error handling, debugging, and health checks work in Express.js. You will then practice what you have learned in a lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"websockets\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to websockets, which is a protocol used for real time communication with the client and server. You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"node-and-sql\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will practice building applications with Node and SQL. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"security-and-privacy\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about the differences between security and privacy as well as other concepts including  CSPs, Permissions-Policies, PII, working with CORS, and more. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"authentication\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how authentication works in web applications along with other important concepts including JWTs, CSRFs, Passport, Helmet, cryptography and encryption, and more.  You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"tooling-and-deployment\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common tools used in the industry for deploying your full stack applications. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"how-to-get-a-developer-job\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, Quincy Larson (Founder and teacher of freeCodeCamp) will talk about strategies you can use to prepare for getting a developer job. Quincy will cover key subjects including résumés, portfolios, researching the market, preparing for technical interviews, and more.\"\n+        ]\n+      },\n+      \"capstone-project\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be your opportunity to build out a full stack application encompassing what you have learned throughout this certification.\"\n+        ]\n+      },\n+      \"certified-full-stack-developer-exam\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be a 90 question exam testing what you have learned throughout this certification.\"\n+        ]\n+      }\n     },\n     \"blocks\": {\n       \"workshop-curriculum-outline\": {\n@@ -3155,6 +3374,19 @@\n           \"Test your knowledge of DOM manipulation and click events in JavaScript with this quiz.\"\n         ]\n       },\n+      \"review-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Review\",\n+        \"intro\": [\n+          \"Before you're quizzed on JavaScript and accessibility, you should review what you've learned about it.\",\n+          \"Open up this page to review concepts including how to work with the <code>aria-expanded</code>, <code>aria-live</code>, and <code>aria-controls</code> attributes.\"\n+        ]\n+      },\n+      \"quiz-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Quiz\",\n+        \"intro\": [\n+          \"Test your knowledge of JavaScript and accessibility best practices with this quiz.\"\n+        ]\n+      },\n       \"lecture-debugging-techniques\": {\n         \"title\": \"Debugging Techniques\",\n         \"intro\": [\n@@ -3792,7 +4024,9 @@\n       },\n       \"lecture-introduction-to-python\": {\n         \"title\": \"Introduction to Python\",\n-        \"intro\": [\"Learn about Introduction to Python in these lectures.\"]\n+        \"intro\": [\n+          \"In these lecture videos, you will learn the fundamentals of Python. You'll learn about variables, data types, operators, control flow, functions, and more.\"\n+        ]\n       },\n       \"workshop-caesar-cipher\": {\n         \"title\": \"Build a Caesar Cipher\",\n@@ -3810,7 +4044,7 @@\n         \"title\": \"Python Basics Review\",\n         \"intro\": [\n           \"Before you're quizzed on Python basics, you should review what you've learned about it.\",\n-          \"[Add more details]\"\n+          \"In this review page, you will review working with strings, functions, comparison operators and more.\"\n         ]\n       },\n       \"quiz-python-basics\": {\n@@ -4251,14 +4485,6 @@\n           \"In this 40-lesson workshop, you will learn how to edit files in the terminal with Nano while building a castle.\"\n         ]\n       },\n-      \"review-nano\": {\n-        \"title\": \"Nano Review\",\n-        \"intro\": [\"Review the Nano concepts to prepare for the upcoming quiz.\"]\n-      },\n-      \"quiz-nano\": {\n-        \"title\": \"Nano Quiz\",\n-        \"intro\": [\"Test what you've learned on Nano with this quiz .\"]\n-      },\n       \"rhhl\": {\n         \"title\": \"328\",\n         \"intro\": []"
        },
        {
            "sha": "0091e598c4d61e2579aee55a38e02e7b61efa5aa",
            "filename": "client/i18n/locales/portuguese/translations.json",
            "status": "modified",
            "additions": 9,
            "deletions": 1,
            "changes": 10,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fportuguese%2Ftranslations.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fportuguese%2Ftranslations.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fportuguese%2Ftranslations.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -796,7 +796,15 @@\n     \"iframe-form-submit-alert\": \"Normalmente, esse formulário seria enviado! Funciona. Ele será enviado para: {{externalLink}}\",\n     \"document-notfound\": \"documento não encontrado\",\n     \"slow-load-msg\": \"Parece que está demorando mais do que o normal. Tente atualizar a página.\",\n-    \"navigation-warning\": \"Se sair desta página, perderá o seu progresso. Tem certeza?\"\n+    \"navigation-warning\": \"Se sair desta página, perderá o seu progresso. Tem certeza?\",\n+    \"fsd-b-description\": \"This comprehensive course prepares you to become a Certified Full Stack Developer. You'll learn to build complete web applications using HTML, CSS, JavaScript, React, TypeScript, Node.js, Python, and more.\",\n+    \"fsd-b-cta\": \"Start Learning\",\n+    \"fsd-b-benefit-1-title\": \"100k+ Students\",\n+    \"fsd-b-benefit-1-description\": \"Join more than 100k students taking this certification.\",\n+    \"fsd-b-benefit-2-title\": \"Professional Certification\",\n+    \"fsd-b-benefit-2-description\": \"Prove your skills with an official, verifiable certification.\",\n+    \"fsd-b-benefit-3-title\": \"500+ Exercises\",\n+    \"fsd-b-benefit-3-description\": \"Solidify your knowledge with plenty of practice.\"\n   },\n   \"icons\": {\n     \"gold-cup\": \"Taça de ouro\","
        },
        {
            "sha": "8c967b7725a5b4dd76a890b81e3392e1dcae9dd3",
            "filename": "client/i18n/locales/swahili/intro.json",
            "status": "modified",
            "additions": 243,
            "deletions": 17,
            "changes": 260,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fswahili%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fswahili%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fswahili%2Fintro.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -890,7 +890,7 @@\n       \"learn-special-methods-by-building-a-vector-space\": {\n         \"title\": \"Learn Special Methods by Building a Vector Space\",\n         \"intro\": [\n-          \"Python special methods are called in response to specific operations and enable you to customize the behaviour of your objects in a detailed and effective way.\",\n+          \"Python special methods are called in response to specific operations and enable you to customize the behavior of your objects in a detailed and effective way.\",\n           \"In this project, you are going to explore some of the most common special methods while learning about vectors by building a vector space.\"\n         ]\n       },\n@@ -1761,7 +1761,7 @@\n       \"relational-databases\": \"Relational Databases\",\n       \"backend-javascript\": \"Backend JavaScript\",\n       \"python\": \"Python\",\n-      \"exam-certified-full-stack-developer\": \"Certified Full Stack Developer Exam\"\n+      \"career\": \"Career\"\n     },\n     \"modules\": {\n       \"basic-html\": \"Basic HTML\",\n@@ -1799,6 +1799,7 @@\n       \"review-javascript-fundamentals\": \"JavaScript Fundamentals Review\",\n       \"higher-order-functions-and-callbacks\": \"Higher Order Functions and Callbacks\",\n       \"dom-manipulation-and-events\": \"DOM Manipulation and Events\",\n+      \"js-a11y\": \"JavaScript and Accessibility\",\n       \"debugging-javascript\": \"Debugging\",\n       \"basic-regex\": \"Basic Regex\",\n       \"form-validation\": \"Form Validation\",\n@@ -1815,14 +1816,11 @@\n       \"react-fundamentals\": \"React Fundamentals\",\n       \"react-state-hooks-and-routing\": \"React State, Hooks, and Routing\",\n       \"performance\": \"Performance\",\n-      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"testing\": \"Testing\",\n+      \"css-libraries-and-frameworks\": \"CSS Libraries and Frameworks\",\n       \"typescript-fundamentals\": \"TypeScript Fundamentals\",\n       \"review-front-end-libraries\": \"Front End Libraries Review\",\n       \"exam-front-end-libraries\": \"Front End Libraries Exam\",\n-      \"sql-and-bash\": \"SQL and Bash\",\n-      \"git\": \"Git\",\n-      \"security-and-privacy\": \"Security and Privacy\",\n       \"python-basics\": \"Python Basics\",\n       \"python-loops-and-sequences\": \"Loops and Sequences\",\n       \"python-dictionaries-and-sets\": \"Dictionaries and Sets\",\n@@ -1834,7 +1832,228 @@\n       \"python-graphs-and-trees\": \"Graphs and Trees\",\n       \"python-dynamic-programming\": \"Dynamic Programming\",\n       \"review-python\": \"Python Review\",\n-      \"exam-python\": \"Python Exam\"\n+      \"exam-python\": \"Python Exam\",\n+      \"bash-fundamentals\": \"Bash Fundamentals\",\n+      \"relational-databases\": \"Relational Databases\",\n+      \"bash-scripting\": \"Bash Scripting\",\n+      \"sql-and-bash\": \"SQL and Bash\",\n+      \"git\": \"Git\",\n+      \"introduction-to-nodejs\": \"Introduction to Node.js\",\n+      \"nodejs-core-libraries\": \"Node.js Core Libraries\",\n+      \"node-package-manager\": \"Node Package Manager\",\n+      \"http-and-the-web-standards-model\": \"HTTP and the Web Standards Model\",\n+      \"rest-api-and-web-services\": \"REST API and Web Services\",\n+      \"introduction-to-express\": \"Introduction to Express\",\n+      \"express-middleware\": \"Express Middleware\",\n+      \"error-handling-in-express\": \"Error Handling in Express\",\n+      \"websockets\": \"WebSockets\",\n+      \"node-and-sql\": \"Node and SQL\",\n+      \"security-and-privacy\": \"Security and Privacy\",\n+      \"authentication\": \"Authentication\",\n+      \"tooling-and-deployment\": \"Tooling and Deployment\",\n+      \"how-to-get-a-developer-job\": \"How to Get a Developer Job\",\n+      \"capstone-project\": \"Capstone Project\",\n+      \"certified-full-stack-developer-exam\": \"Certified Full Stack Developer Exam\"\n+    },\n+    \"module-intros\": {\n+      \"css-libraries-and-frameworks\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to CSS libraries, frameworks, and preprocessors, including Tailwind CSS, Bootstrap, and Sass. You will build out various components using Tailwind CSS and test your knowledge of these tools with a short quiz.\"\n+        ]\n+      },\n+      \"typescript-fundamentals\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to TypeScript, which is a superset of JavaScript that allows you to add static typing to your JavaScript code. You will build several workshops and labs that will give you practice in working with generics, type narrowing, TSX, and more. Then you will test your knowledge of TypeScript fundamentals with a short quiz.\"\n+        ]\n+      },\n+      \"python-basics\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Python, which is used in many fields like data science, machine learning, web development, scripting and automation, embedded systems, IoT, and more. You will build out a workshop and lab to practice Python basics and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-loops-and-sequences\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with lists, tuples, lambda functions, loops, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dictionaries-and-sets\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to dictionaries, sets, and the Python standard library. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-error-handling\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will talk about common error messages, good debugging techniques, and exception handling. You will build a lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-classes-and-objects\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with classes, methods, attributes and properties. Then, you will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-object-oriented-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about Object-oriented programming concepts like encapsulation, inheritance, polymorphism, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-linear-data-structures\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about data structures including stacks, queues, linked lists, and more. You will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-algorithms\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about common algorithms including binary search, merge sort, selection sort, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-graphs-and-trees\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about graphs in computer science as well as adjacency lists, trees, tries, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dynamic-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  dynamic programming and practice these concepts by building a fibonacci sequence lab. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-fundamentals\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  the command line and common Bash commands. Then you will practice your skills with a workshop and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"relational-databases\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with relational databases which store data as collections in tables. Some of the concepts you will learn about include inserting and viewing table data, primary and foreign keys in SQL, and more. Then you will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-scripting\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about bash scripting and practice those skills by building five programs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"sql-and-bash\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about normalization, SQL injection, and the N+1 problem. Then you will get to practice working with SQL and Bash by building several workshops and labs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"git\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to use Git, Nano, and GitHub. Then you will get to practice working with Git by building several workshops and labs. You will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"introduction-to-nodejs\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Node.js, which is a JavaScript runtime environment that allows you to build backend applications using JavaScript. You will get to practice fundamental concepts by building a small workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"nodejs-core-libraries\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common Node.js core libraries including the fs, os, path and more. Then you will get to practice what you have learned through workshops and labs and test your knowledge through a short quiz.\"\n+        ]\n+      },\n+      \"node-package-manager\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to the Node Package Manager, which developers use to manage project dependencies and scripts. Then you will get to practice what you have learned through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"http-and-the-web-standards-model\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about HTTP (Hypertext Transfer Protocol) and other important concepts including the request-response model, common response codes, DNS, TCP/IP, and more. Then you will get to practice what you have learned through a build your own web server workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"rest-api-and-web-services\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about the REST API (Representational State Transfer Application Programming Interface) and how microservices work. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"introduction-to-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Express.js, which is a framework used to build RESTful APIs. Then you will practice your skills through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"express-middleware\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about middleware in Express.js, which is used to handle requests and responses between the client and server. You will then practice your skills through a workshop and lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"error-handling-in-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how error handling, debugging, and health checks work in Express.js. You will then practice what you have learned in a lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"websockets\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to websockets, which is a protocol used for real time communication with the client and server. You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"node-and-sql\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will practice building applications with Node and SQL. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"security-and-privacy\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about the differences between security and privacy as well as other concepts including  CSPs, Permissions-Policies, PII, working with CORS, and more. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"authentication\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how authentication works in web applications along with other important concepts including JWTs, CSRFs, Passport, Helmet, cryptography and encryption, and more.  You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"tooling-and-deployment\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common tools used in the industry for deploying your full stack applications. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"how-to-get-a-developer-job\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, Quincy Larson (Founder and teacher of freeCodeCamp) will talk about strategies you can use to prepare for getting a developer job. Quincy will cover key subjects including résumés, portfolios, researching the market, preparing for technical interviews, and more.\"\n+        ]\n+      },\n+      \"capstone-project\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be your opportunity to build out a full stack application encompassing what you have learned throughout this certification.\"\n+        ]\n+      },\n+      \"certified-full-stack-developer-exam\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be a 90 question exam testing what you have learned throughout this certification.\"\n+        ]\n+      }\n     },\n     \"blocks\": {\n       \"workshop-curriculum-outline\": {\n@@ -3155,6 +3374,19 @@\n           \"Test your knowledge of DOM manipulation and click events in JavaScript with this quiz.\"\n         ]\n       },\n+      \"review-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Review\",\n+        \"intro\": [\n+          \"Before you're quizzed on JavaScript and accessibility, you should review what you've learned about it.\",\n+          \"Open up this page to review concepts including how to work with the <code>aria-expanded</code>, <code>aria-live</code>, and <code>aria-controls</code> attributes.\"\n+        ]\n+      },\n+      \"quiz-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Quiz\",\n+        \"intro\": [\n+          \"Test your knowledge of JavaScript and accessibility best practices with this quiz.\"\n+        ]\n+      },\n       \"lecture-debugging-techniques\": {\n         \"title\": \"Debugging Techniques\",\n         \"intro\": [\n@@ -3792,7 +4024,9 @@\n       },\n       \"lecture-introduction-to-python\": {\n         \"title\": \"Introduction to Python\",\n-        \"intro\": [\"Learn about Introduction to Python in these lectures.\"]\n+        \"intro\": [\n+          \"In these lecture videos, you will learn the fundamentals of Python. You'll learn about variables, data types, operators, control flow, functions, and more.\"\n+        ]\n       },\n       \"workshop-caesar-cipher\": {\n         \"title\": \"Build a Caesar Cipher\",\n@@ -3810,7 +4044,7 @@\n         \"title\": \"Python Basics Review\",\n         \"intro\": [\n           \"Before you're quizzed on Python basics, you should review what you've learned about it.\",\n-          \"[Add more details]\"\n+          \"In this review page, you will review working with strings, functions, comparison operators and more.\"\n         ]\n       },\n       \"quiz-python-basics\": {\n@@ -4251,14 +4485,6 @@\n           \"In this 40-lesson workshop, you will learn how to edit files in the terminal with Nano while building a castle.\"\n         ]\n       },\n-      \"review-nano\": {\n-        \"title\": \"Nano Review\",\n-        \"intro\": [\"Review the Nano concepts to prepare for the upcoming quiz.\"]\n-      },\n-      \"quiz-nano\": {\n-        \"title\": \"Nano Quiz\",\n-        \"intro\": [\"Test what you've learned on Nano with this quiz .\"]\n-      },\n       \"rhhl\": {\n         \"title\": \"328\",\n         \"intro\": []"
        },
        {
            "sha": "26adebdf3c1cf4e84224490adca3bec1133a656f",
            "filename": "client/i18n/locales/swahili/translations.json",
            "status": "modified",
            "additions": 9,
            "deletions": 1,
            "changes": 10,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fswahili%2Ftranslations.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fswahili%2Ftranslations.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fswahili%2Ftranslations.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -796,7 +796,15 @@\n     \"iframe-form-submit-alert\": \"Kwa kawaida fomu hii ingewasilishwa! Inafanya kazi. Hii itawasilishwa kwa: {{externalLink}}\",\n     \"document-notfound\": \"hati haijapatikana\",\n     \"slow-load-msg\": \"Inaonekana hii inachukua muda mrefu kuliko kawaida, tafadhali jaribu pakia upya ukurasa.\",\n-    \"navigation-warning\": \"Ukiondoka kwenye ukurasa huu, utapoteza maendeleo yako. Una uhakika?\"\n+    \"navigation-warning\": \"Ukiondoka kwenye ukurasa huu, utapoteza maendeleo yako. Una uhakika?\",\n+    \"fsd-b-description\": \"This comprehensive course prepares you to become a Certified Full Stack Developer. You'll learn to build complete web applications using HTML, CSS, JavaScript, React, TypeScript, Node.js, Python, and more.\",\n+    \"fsd-b-cta\": \"Start Learning\",\n+    \"fsd-b-benefit-1-title\": \"100k+ Students\",\n+    \"fsd-b-benefit-1-description\": \"Join more than 100k students taking this certification.\",\n+    \"fsd-b-benefit-2-title\": \"Professional Certification\",\n+    \"fsd-b-benefit-2-description\": \"Prove your skills with an official, verifiable certification.\",\n+    \"fsd-b-benefit-3-title\": \"500+ Exercises\",\n+    \"fsd-b-benefit-3-description\": \"Solidify your knowledge with plenty of practice.\"\n   },\n   \"icons\": {\n     \"gold-cup\": \"Kombe la dhahabu\","
        },
        {
            "sha": "c0a2d9e4e38e879d3b255b8a28ebf84f95cb3de7",
            "filename": "client/i18n/locales/ukrainian/intro.json",
            "status": "modified",
            "additions": 243,
            "deletions": 19,
            "changes": 262,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fukrainian%2Fintro.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fukrainian%2Fintro.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fukrainian%2Fintro.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -880,7 +880,7 @@\n       \"learn-special-methods-by-building-a-vector-space\": {\n         \"title\": \"Вивчіть спеціальні методи, створивши векторний простір\",\n         \"intro\": [\n-          \"Спеціальні методи в Python викликаються у відповідь на конкретні операції та дозволяють налаштувати поведінку об’єктів у деталізований й ефективний спосіб.\",\n+          \"Python special methods are called in response to specific operations and enable you to customize the behavior of your objects in a detailed and effective way.\",\n           \"У цьому проєкті ви дослідите деякі з найпоширеніших спеціальних методів, вивчаючи вектори через створення векторного простору.\"\n         ]\n       },\n@@ -1747,7 +1747,7 @@\n       \"relational-databases\": \"Реляційні бази даних\",\n       \"backend-javascript\": \"Back End JavaScript\",\n       \"python\": \"Python\",\n-      \"exam-certified-full-stack-developer\": \"Екзамен «Сертифікований Full Stack розробник»\"\n+      \"career\": \"Career\"\n     },\n     \"modules\": {\n       \"basic-html\": \"Основи HTML\",\n@@ -1785,6 +1785,7 @@\n       \"review-javascript-fundamentals\": \"Повторення основ JavaScript\",\n       \"higher-order-functions-and-callbacks\": \"Функції вищого порядку та зворотного виклику\",\n       \"dom-manipulation-and-events\": \"Маніпуляція DOM та події Click в JavaScript\",\n+      \"js-a11y\": \"JavaScript and Accessibility\",\n       \"debugging-javascript\": \"Налагодження\",\n       \"basic-regex\": \"Основи регулярних виразів\",\n       \"form-validation\": \"Валідація форм\",\n@@ -1801,14 +1802,11 @@\n       \"react-fundamentals\": \"Основи React\",\n       \"react-state-hooks-and-routing\": \"Стани, хуки та маршрутизація в React\",\n       \"performance\": \"Продуктивність\",\n-      \"css-libraries-and-frameworks\": \"Бібліотеки та фреймворки CSS\",\n       \"testing\": \"Тестування\",\n+      \"css-libraries-and-frameworks\": \"Бібліотеки та фреймворки CSS\",\n       \"typescript-fundamentals\": \"Основи TypeScript\",\n       \"review-front-end-libraries\": \"Повторення бібліотек для Front End\",\n       \"exam-front-end-libraries\": \"Екзамен «Бібліотеки для Front End»\",\n-      \"sql-and-bash\": \"SQL та Bash\",\n-      \"git\": \"Git\",\n-      \"security-and-privacy\": \"Безпека та приватність\",\n       \"python-basics\": \"Основи Python\",\n       \"python-loops-and-sequences\": \"Цикли та послідовності\",\n       \"python-dictionaries-and-sets\": \"Словники та набори\",\n@@ -1820,7 +1818,228 @@\n       \"python-graphs-and-trees\": \"Графи та дерева\",\n       \"python-dynamic-programming\": \"Динамічне програмування\",\n       \"review-python\": \"Повторення Python\",\n-      \"exam-python\": \"Екзамен «Python»\"\n+      \"exam-python\": \"Екзамен «Python»\",\n+      \"bash-fundamentals\": \"Bash Fundamentals\",\n+      \"relational-databases\": \"Relational Databases\",\n+      \"bash-scripting\": \"Bash Scripting\",\n+      \"sql-and-bash\": \"SQL та Bash\",\n+      \"git\": \"Git\",\n+      \"introduction-to-nodejs\": \"Introduction to Node.js\",\n+      \"nodejs-core-libraries\": \"Node.js Core Libraries\",\n+      \"node-package-manager\": \"Node Package Manager\",\n+      \"http-and-the-web-standards-model\": \"HTTP and the Web Standards Model\",\n+      \"rest-api-and-web-services\": \"REST API and Web Services\",\n+      \"introduction-to-express\": \"Introduction to Express\",\n+      \"express-middleware\": \"Express Middleware\",\n+      \"error-handling-in-express\": \"Error Handling in Express\",\n+      \"websockets\": \"WebSockets\",\n+      \"node-and-sql\": \"Node and SQL\",\n+      \"security-and-privacy\": \"Безпека та приватність\",\n+      \"authentication\": \"Authentication\",\n+      \"tooling-and-deployment\": \"Tooling and Deployment\",\n+      \"how-to-get-a-developer-job\": \"How to Get a Developer Job\",\n+      \"capstone-project\": \"Capstone Project\",\n+      \"certified-full-stack-developer-exam\": \"Certified Full Stack Developer Exam\"\n+    },\n+    \"module-intros\": {\n+      \"css-libraries-and-frameworks\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to CSS libraries, frameworks, and preprocessors, including Tailwind CSS, Bootstrap, and Sass. You will build out various components using Tailwind CSS and test your knowledge of these tools with a short quiz.\"\n+        ]\n+      },\n+      \"typescript-fundamentals\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to TypeScript, which is a superset of JavaScript that allows you to add static typing to your JavaScript code. You will build several workshops and labs that will give you practice in working with generics, type narrowing, TSX, and more. Then you will test your knowledge of TypeScript fundamentals with a short quiz.\"\n+        ]\n+      },\n+      \"python-basics\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Python, which is used in many fields like data science, machine learning, web development, scripting and automation, embedded systems, IoT, and more. You will build out a workshop and lab to practice Python basics and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-loops-and-sequences\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with lists, tuples, lambda functions, loops, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dictionaries-and-sets\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to dictionaries, sets, and the Python standard library. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-error-handling\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will talk about common error messages, good debugging techniques, and exception handling. You will build a lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-classes-and-objects\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with classes, methods, attributes and properties. Then, you will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-object-oriented-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about Object-oriented programming concepts like encapsulation, inheritance, polymorphism, and more. You will build out workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-linear-data-structures\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about data structures including stacks, queues, linked lists, and more. You will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-algorithms\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about common algorithms including binary search, merge sort, selection sort, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-graphs-and-trees\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about graphs in computer science as well as adjacency lists, trees, tries, and more. You will build workshops and labs to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"python-dynamic-programming\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  dynamic programming and practice these concepts by building a fibonacci sequence lab. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-fundamentals\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about  the command line and common Bash commands. Then you will practice your skills with a workshop and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"relational-databases\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to work with relational databases which store data as collections in tables. Some of the concepts you will learn about include inserting and viewing table data, primary and foreign keys in SQL, and more. Then you will build out a workshop and lab to practice these concepts and take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"bash-scripting\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about bash scripting and practice those skills by building five programs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"sql-and-bash\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about normalization, SQL injection, and the N+1 problem. Then you will get to practice working with SQL and Bash by building several workshops and labs. Then you will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"git\": {\n+        \"note\": \"Coming Winter 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn how to use Git, Nano, and GitHub. Then you will get to practice working with Git by building several workshops and labs. You will be able to test your knowledge of these concepts by taking a short quiz.\"\n+        ]\n+      },\n+      \"introduction-to-nodejs\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Node.js, which is a JavaScript runtime environment that allows you to build backend applications using JavaScript. You will get to practice fundamental concepts by building a small workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"nodejs-core-libraries\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common Node.js core libraries including the fs, os, path and more. Then you will get to practice what you have learned through workshops and labs and test your knowledge through a short quiz.\"\n+        ]\n+      },\n+      \"node-package-manager\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to the Node Package Manager, which developers use to manage project dependencies and scripts. Then you will get to practice what you have learned through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"http-and-the-web-standards-model\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about HTTP (Hypertext Transfer Protocol) and other important concepts including the request-response model, common response codes, DNS, TCP/IP, and more. Then you will get to practice what you have learned through a build your own web server workshop and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"rest-api-and-web-services\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about the REST API (Representational State Transfer Application Programming Interface) and how microservices work. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"introduction-to-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to Express.js, which is a framework used to build RESTful APIs. Then you will practice your skills through workshops and labs and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"express-middleware\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about middleware in Express.js, which is used to handle requests and responses between the client and server. You will then practice your skills through a workshop and lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"error-handling-in-express\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how error handling, debugging, and health checks work in Express.js. You will then practice what you have learned in a lab and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"websockets\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will be introduced to websockets, which is a protocol used for real time communication with the client and server. You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"node-and-sql\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will practice building applications with Node and SQL. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"security-and-privacy\": {\n+        \"note\": \"Coming Fall 2025\",\n+        \"intro\": [\n+          \"In this module, you will learn about the differences between security and privacy as well as other concepts including  CSPs, Permissions-Policies, PII, working with CORS, and more. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"authentication\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about how authentication works in web applications along with other important concepts including JWTs, CSRFs, Passport, Helmet, cryptography and encryption, and more.  You will then practice what you have learned in labs and workshops and test your knowledge with a short quiz.\"\n+        ]\n+      },\n+      \"tooling-and-deployment\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, you will learn about common tools used in the industry for deploying your full stack applications. Then you will take a short quiz to test your knowledge.\"\n+        ]\n+      },\n+      \"how-to-get-a-developer-job\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"In this module, Quincy Larson (Founder and teacher of freeCodeCamp) will talk about strategies you can use to prepare for getting a developer job. Quincy will cover key subjects including résumés, portfolios, researching the market, preparing for technical interviews, and more.\"\n+        ]\n+      },\n+      \"capstone-project\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be your opportunity to build out a full stack application encompassing what you have learned throughout this certification.\"\n+        ]\n+      },\n+      \"certified-full-stack-developer-exam\": {\n+        \"note\": \"Coming Late 2026\",\n+        \"intro\": [\n+          \"This will be a 90 question exam testing what you have learned throughout this certification.\"\n+        ]\n+      }\n     },\n     \"blocks\": {\n       \"workshop-curriculum-outline\": {\n@@ -3153,6 +3372,19 @@\n           \"Цей тест перевірить, наскільки добре ви засвоїли матеріал з теми «Маніпуляція DOM та події Click в JavaScript».\"\n         ]\n       },\n+      \"review-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Review\",\n+        \"intro\": [\n+          \"Before you're quizzed on JavaScript and accessibility, you should review what you've learned about it.\",\n+          \"Open up this page to review concepts including how to work with the <code>aria-expanded</code>, <code>aria-live</code>, and <code>aria-controls</code> attributes.\"\n+        ]\n+      },\n+      \"quiz-js-a11y\": {\n+        \"title\": \"JavaScript and Accessibility Quiz\",\n+        \"intro\": [\n+          \"Test your knowledge of JavaScript and accessibility best practices with this quiz.\"\n+        ]\n+      },\n       \"lecture-debugging-techniques\": {\n         \"title\": \"Техніки налагодження\",\n         \"intro\": [\n@@ -3782,7 +4014,9 @@\n       },\n       \"lecture-introduction-to-python\": {\n         \"title\": \"Вступ до Python\",\n-        \"intro\": [\"У цих відеолекціях ви ознайомитесь з Python.\"]\n+        \"intro\": [\n+          \"In these lecture videos, you will learn the fundamentals of Python. You'll learn about variables, data types, operators, control flow, functions, and more.\"\n+        ]\n       },\n       \"workshop-caesar-cipher\": {\n         \"title\": \"Створіть шифр Цезаря\",\n@@ -3800,7 +4034,7 @@\n         \"title\": \"Повторення основ Python\",\n         \"intro\": [\n           \"Перш ніж перейти до тесту «Основи Python», повторіть основні поняття.\",\n-          \"[Add more details]\"\n+          \"In this review page, you will review working with strings, functions, comparison operators and more.\"\n         ]\n       },\n       \"quiz-python-basics\": {\n@@ -4229,16 +4463,6 @@\n           \"У цьому практичному занятті з 40 уроків ви дізнаєтесь, як редагувати файли в терміналі за допомогою Nano, створивши замок.\"\n         ]\n       },\n-      \"review-nano\": {\n-        \"title\": \"Повторення Nano\",\n-        \"intro\": [\n-          \"Пригадайте поняття з теми «Nano», щоб підготуватись до тесту.\"\n-        ]\n-      },\n-      \"quiz-nano\": {\n-        \"title\": \"Тест «Nano»\",\n-        \"intro\": [\"Перевірте, що ви дізнались про Nano.\"]\n-      },\n       \"rhhl\": {\n         \"title\": \"328\",\n         \"intro\": []"
        },
        {
            "sha": "684f417df119f1b3ec189a1f001ef77818cef3e1",
            "filename": "client/i18n/locales/ukrainian/translations.json",
            "status": "modified",
            "additions": 10,
            "deletions": 2,
            "changes": 12,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fukrainian%2Ftranslations.json",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e2b9a5e606bb9419fa16cbdb540da3735c908fd0/client%2Fi18n%2Flocales%2Fukrainian%2Ftranslations.json",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/client%2Fi18n%2Flocales%2Fukrainian%2Ftranslations.json?ref=e2b9a5e606bb9419fa16cbdb540da3735c908fd0",
            "patch": "@@ -150,7 +150,7 @@\n       \"list\": [\n         {\n           \"title\": \"Велика спільнота\",\n-          \"description\": \"Долучіться до нашої активної спільноти учнів, випускників та викладачів.\"\n+          \"description\": \"Станьте частиною активної спільноти учнів, випускників та викладачів.\"\n         },\n         {\n           \"title\": \"Безоплатна освіта\",\n@@ -796,7 +796,15 @@\n     \"iframe-form-submit-alert\": \"Зазвичай ця форма буде відправлена! Вона буде відправлена на: {{externalLink}}\",\n     \"document-notfound\": \"документ не знайдено\",\n     \"slow-load-msg\": \"Схоже, це займає більше часу, ніж зазвичай. Будь ласка, спробуйте оновити сторінку.\",\n-    \"navigation-warning\": \"Ви втратите прогрес, якщо залишите цю сторінку. Ви впевнені?\"\n+    \"navigation-warning\": \"Ви втратите прогрес, якщо залишите цю сторінку. Ви впевнені?\",\n+    \"fsd-b-description\": \"This comprehensive course prepares you to become a Certified Full Stack Developer. You'll learn to build complete web applications using HTML, CSS, JavaScript, React, TypeScript, Node.js, Python, and more.\",\n+    \"fsd-b-cta\": \"Start Learning\",\n+    \"fsd-b-benefit-1-title\": \"100k+ Students\",\n+    \"fsd-b-benefit-1-description\": \"Join more than 100k students taking this certification.\",\n+    \"fsd-b-benefit-2-title\": \"Professional Certification\",\n+    \"fsd-b-benefit-2-description\": \"Prove your skills with an official, verifiable certification.\",\n+    \"fsd-b-benefit-3-title\": \"500+ Exercises\",\n+    \"fsd-b-benefit-3-description\": \"Solidify your knowledge with plenty of practice.\"\n   },\n   \"icons\": {\n     \"gold-cup\": \"Золотий кубок\","
        }
    ],
    "stats": {
        "total": 2704,
        "additions": 2521,
        "deletions": 183
    }
}