{
    "author": "Sembauke",
    "message": "fix(curriculum): improve clarity of questions and distractors CSS Flexbox quiz (#58400)",
    "sha": "e4940a2dd2aab510a08616d5b1c42ae7dc066827",
    "files": [
        {
            "sha": "4ba5737dc9da722e1766f0863c6a30c068d1fb1b",
            "filename": "curriculum/challenges/english/25-front-end-development/quiz-css-flexbox/66ed8fe7f45ce3ece4053eb2.md",
            "status": "modified",
            "additions": 16,
            "deletions": 16,
            "changes": 32,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e4940a2dd2aab510a08616d5b1c42ae7dc066827/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Fquiz-css-flexbox%2F66ed8fe7f45ce3ece4053eb2.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e4940a2dd2aab510a08616d5b1c42ae7dc066827/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Fquiz-css-flexbox%2F66ed8fe7f45ce3ece4053eb2.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Fquiz-css-flexbox%2F66ed8fe7f45ce3ece4053eb2.md?ref=e4940a2dd2aab510a08616d5b1c42ae7dc066827",
            "patch": "@@ -77,7 +77,7 @@ div {\n \n #### --text--\n \n-Flexbox defaults to fit all children within a single row. What property can be modified when there are too many children within one row, and you want to spread them out into multiple rows?\n+Which CSS property lets flex items wrap onto a new row when the current row is full?\n \n #### --distractors--\n \n@@ -103,19 +103,19 @@ What does the flexbox property `justify-content` control?\n \n #### --distractors--\n \n-It controls the direction of the children elements of the flexbox container.\n+It controls the direction of the child elements of the flexbox container.\n \n ---\n \n-It controls the text style of the children elements of the flexbox container.\n+It controls the text style of the child elements of the flexbox container.\n \n ---\n \n-It controls the alignment of the children elements within the flexbox container.\n+It controls the alignment of the child elements within the flexbox container.\n \n #### --answer--\n \n-It controls the distribution of the children elements on the main axis.\n+It controls the distribution of the child elements on the main axis.\n \n ### --question--\n \n@@ -143,7 +143,7 @@ What property controls the direction of the elements within the flexbox containe\n \n #### --text--\n \n-What CSS properties would you use to make a `.container` element's items flow from left to right, change lines when an item exceeds container width, and have new items go on top of the previous line?\n+Which CSS properties can be used to make flex items flow from left to right, and have the new flex item appear on top of the previous one if the width of the current row is exceeded?\n \n #### --distractors--\n \n@@ -276,7 +276,7 @@ What CSS properties would you use to center an element within a flex container h\n \n #### --text--\n \n-What value of `flex-direction` makes the children elements go from right to left?  \n+What value of `flex-direction` makes the flex items go from right to left?  \n \n #### --distractors--\n \n@@ -324,15 +324,15 @@ What does the `stretch` value in `align-items` do?\n \n #### --distractors--\n \n-Items are packed flush to each other toward the start edge of the container.\n+Items are packed directly against each other toward the start edge of the container.\n \n ---\n \n Items are aligned such that their flex container baselines align.\n \n ---\n \n-Items are packed flush to each other toward the end edge of the container.\n+Items are packed directly against each other toward the end edge of the container.\n \n #### --answer--\n \n@@ -342,7 +342,7 @@ Auto-size items to be equally large to fill the container.\n \n #### --text--\n \n-Which value for `justify-content` will evenly distribute items along the main axis, have the same spacing between each pair of adjacent items, and have items whose sides are flush against the main axis edge?\n+Which `justify-content` value places the first item at the start, the last item at the end, and evenly spaces the other items between them along the main axis?\n \n #### --distractors--\n \n@@ -364,7 +364,7 @@ Which value for `justify-content` will evenly distribute items along the main ax\n \n #### --text--\n \n-Which value for `justify-content` will evenly distribute items along the main axis, and have the same spacing between each pair of adjacent items and against the main axis edge?\n+Which `justify-content` value spaces items so that the gaps between every pair of adjacent items and the container’s edges are all equal?\n \n #### --distractors--\n \n@@ -386,7 +386,7 @@ Which value for `justify-content` will evenly distribute items along the main ax\n \n #### --text--\n \n-Which value for `justify-content` will evenly distribute items along the main axis, have the same spacing between each pair of adjacent items, and have items on the sides with half the spacing against the main axis edge?\n+Which `justify-content` value spaces items equally along the main axis while leaving half that amount of space at the container’s edges?\n \n #### --distractors--\n \n@@ -408,7 +408,7 @@ Which value for `justify-content` will evenly distribute items along the main ax\n \n #### --text--\n \n-Which value for `align-items` will make it so items are flush against the cross-axis start?\n+Which value for `align-items` will make it so items are directly against the cross-axis start?\n \n #### --distractors--\n \n@@ -430,7 +430,7 @@ Which value for `align-items` will make it so items are flush against the cross-\n \n #### --text--\n \n-Which value for `align-items` will make it so items are flush against the cross-axis end?\n+Which value for `align-items` will make it so items are directly against the cross-axis end?\n \n #### --distractors--\n \n@@ -452,7 +452,7 @@ Which value for `align-items` will make it so items are flush against the cross-\n \n #### --text--\n \n-Which value for `flex-direction` will make it so items are aligned along the main axis from left to right.\n+Which value for `flex-direction` will make it so items are aligned along the main axis from left to right?\n \n #### --distractors--\n \n@@ -474,7 +474,7 @@ Which value for `flex-direction` will make it so items are aligned along the mai\n \n #### --text--\n \n-Which value for `flex-direction` will make it so items are aligned along the cross axis from top to bottom.\n+Which value for `flex-direction` will make it so items are aligned along the cross axis from top to bottom?\n \n #### --distractors--\n "
        }
    ],
    "stats": {
        "total": 32,
        "additions": 16,
        "deletions": 16
    }
}