{
    "author": "zairahira",
    "message": "chore(curriculum): add browsing the web effectively transcripts (#58223)\n\nCo-authored-by: Dario-DC <105294544+Dario-DC@users.noreply.github.com>",
    "sha": "e5221ddb31142b216e48c882145be8b66d6f216d",
    "files": [
        {
            "sha": "9a558cdcff689e81664a99c6f80a42e15e941db0",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-browsing-the-web-effectively/672aa5bd69657d56ab49ec8a.md",
            "status": "modified",
            "additions": 30,
            "deletions": 0,
            "changes": 30,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e5221ddb31142b216e48c882145be8b66d6f216d/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-browsing-the-web-effectively%2F672aa5bd69657d56ab49ec8a.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e5221ddb31142b216e48c882145be8b66d6f216d/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-browsing-the-web-effectively%2F672aa5bd69657d56ab49ec8a.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-browsing-the-web-effectively%2F672aa5bd69657d56ab49ec8a.md?ref=e5221ddb31142b216e48c882145be8b66d6f216d",
            "patch": "@@ -10,6 +10,36 @@ dashedName: what-are-some-of-the-common-web-browsers-available-today\n \n Watch the video lecture and answer the questions below.\n \n+# --transcript--\n+\n+What are some of the common web browsers available today, and how do you install one? \n+\n+Web browsers are applications you use to visit pages on the internet. If you are going through the freeCodeCamp curriculum, there is a very good chance you are using a web browser right now!\n+\n+As of 2024, the most popular browsers are Microsoft Edge, Firefox, Google Chrome, and Safari. There are quite a few other options, and market shares are always changing, but these four are the most common at this time.\n+\n+Your operating system most likely comes with a browser installed by default. For Windows, you'd have Microsoft Edge. For Mac, you'd have Safari. For Linux, you'll probably have Firefox.\n+\n+But what if you want to use a different browser?\n+\n+The good news is you already have a default browser. So you can navigate to the web page for the browser you want, and download the appropriate installer for your operating system.\n+\n+When choosing a browser, consider factors like speed, security features, and compatibility with websites you frequently visit.\n+\n+Some browsers offer unique features. For example, Opera has a built-in VPN, while Brave focuses on privacy and ad-blocking.\n+\n+Installation is usually straightforward. After downloading the installer, simply run it and follow the on-screen instructions.\n+\n+Most browsers will offer to import your bookmarks and settings from your current default browser, making the transition easier.\n+\n+Alternatively, you can install a browser through your operating system's package manager, such as `brew install --cask google-chrome` on macOS with Homebrew, or `yay -S brave-bin` on Arch Linux.\n+\n+The package manager and package names available to you will vary depending on your operating system.\n+\n+Remember, you're not limited to just one browser. Many people use different browsers for different purposes – perhaps one for work and another for personal browsing.\n+\n+Feel free to experiment with different browsers to find what works best for you.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "5142d178b74b361ed5b3891e945570d232123060",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-browsing-the-web-effectively/672ac96491845f43ea9a26d7.md",
            "status": "modified",
            "additions": 38,
            "deletions": 0,
            "changes": 38,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e5221ddb31142b216e48c882145be8b66d6f216d/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-browsing-the-web-effectively%2F672ac96491845f43ea9a26d7.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e5221ddb31142b216e48c882145be8b66d6f216d/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-browsing-the-web-effectively%2F672ac96491845f43ea9a26d7.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-browsing-the-web-effectively%2F672ac96491845f43ea9a26d7.md?ref=e5221ddb31142b216e48c882145be8b66d6f216d",
            "patch": "@@ -10,6 +10,44 @@ dashedName: what-is-the-difference-between-a-web-browser-a-website-and-a-search-\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+What is the difference between a web browser, a website, and a search engine?\n+\n+Web browsers are software applications that allow users to access and navigate the World Wide Web. They interpret and display web content, including text, images, videos, and interactive elements.\n+\n+Key features of web browsers include the address bar, where you enter URLs or search queries, and the rendering engine, which translates HTML, CSS, and JavaScript into visual web pages.\n+\n+Browsers also offer bookmarks to save and organize favorite websites, extensions to enhance functionality, and various privacy and security features such as pop-up blockers and private browsing modes.\n+\n+Popular web browsers include Google Chrome, Mozilla Firefox, Microsoft Edge, Safari, and Opera.\n+\n+Websites, on the other hand, are collections of web pages and related content that are identified by a common domain name and published on at least one web server. They are the destinations you visit using your web browser.\n+\n+Components of websites include the domain name, which is the unique address of the website (like freecodecamp.org), and web pages, which are individual documents that make up a website.\n+\n+Websites also often include multimedia content like images, videos, and audio files that enhance the user experience, as well as interactive elements such as forms and buttons that allow user interaction.\n+\n+Websites can be static, where content rarely changes, or dynamic, where content updates frequently or is personalized for users.\n+\n+Search engines are web-based tools designed to help users find information on the internet. They use complex algorithms to index and rank web pages based on relevance to user queries.\n+\n+Key aspects of search engines include web crawlers, also known as spiders or bots, which are programs that systematically browse the web to discover and index new content.\n+\n+The indexing process involves organising and storing information about web pages in massive databases.\n+\n+Search engines also employ ranking algorithms, which are complex systems that determine the order of search results based on factors like relevance, authority, and user experience. Popular search engines include Google, Bing, Yahoo, and DuckDuckGo.\n+\n+The relationship between browsers, websites, and search engines is interconnected.\n+\n+Web browsers are the tools used to access both websites and search engines.\n+\n+Websites are the destinations that users visit through browsers or find via search engines.\n+\n+Search engines help users discover websites by providing organized access to the vast amount of information on the web.\n+\n+Understanding these distinctions and relationships is crucial for effective internet use and basic web literacy.\n+\n # --questions--\n \n ## --text--"
        },
        {
            "sha": "963664de4948e10468a093778a59b2654813306f",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-browsing-the-web-effectively/672ac9705b07a64439b73b59.md",
            "status": "modified",
            "additions": 36,
            "deletions": 0,
            "changes": 36,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/e5221ddb31142b216e48c882145be8b66d6f216d/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-browsing-the-web-effectively%2F672ac9705b07a64439b73b59.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/e5221ddb31142b216e48c882145be8b66d6f216d/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-browsing-the-web-effectively%2F672ac9705b07a64439b73b59.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-browsing-the-web-effectively%2F672ac9705b07a64439b73b59.md?ref=e5221ddb31142b216e48c882145be8b66d6f216d",
            "patch": "@@ -10,6 +10,42 @@ dashedName: how-to-use-a-search-engine-effectively-to-achieve-optimal-results\n \n Watch the lecture video and answer the questions below.\n \n+# --transcript--\n+\n+How to use a search engine effectively to achieve optimal results?\n+\n+Searching for information on the Internet can be a daunting task. There are so many websites out there, with so much data, that it may seem impossible to get the results you want.\n+\n+But thanks to things like boolean search syntax, you can narrow down your search to exactly what you need.\n+\n+Boolean search syntax is a way to use special words to help you find exactly what you're looking for when searching online.\n+\n+Here is an example of a basic search query for `freecodecamp curriculum`.\n+\n+When you search for `freecodecamp curriculum`, the search engine will return results that match *any* of these keywords – typically sorted by relevance (how likely they are to match, or be related to, more of your query).\n+\n+But what if you only wanted results that matched both keywords? Well, you might have heard that you can wrap a query in quotation marks, like `\"freecodecamp curriculum\"`.\n+\n+However, this query specifically matches the *phrase* `freecodecamp curriculum`. This means that the results you will see will be limited to sites that say `freecodecamp curriculum` together, not sites that say `freecodecamp` AND `curriculum`.\n+\n+If you want to match sites that include both of those terms, but not necessarily next to each other as a phrase, you can prefix each term with a plus symbol like this: `+freecodecamp +curriculum`\n+\n+Alternatively, maybe you're interested in freeCodeCamp's initiatives outside of the curriculum. In this case, you can prefix the term `curriculum` with a minus symbol like this: `+freecodecamp -curriculum`.\n+\n+This will return results that mention `freecodecamp`, but exclude results that also mention `curriculum`.\n+\n+Or maybe you have a specific site you want to search, like our news platform? You can use `site:` followed by the URL of the site you want to search: `site:freecodecamp.org/news curriculum`.\n+\n+This query returns all results from `freecodecamp.org/news` that contain the word `curriculum`.\n+\n+By combining these tools, you can come up with very specific queries to get the exact information you need.\n+\n+For example, the query `site:freecodecamp.org/news +python -curriculum` would search for Python articles on our news site, excluding articles that might talk about our curriculum.\n+\n+Search operators may vary, so it is always important to check the documentation for your preferred search engine.\n+\n+But you should now be empowered to get the exact results you want from your web searches.\n+\n # --questions--\n \n ## --text--"
        }
    ],
    "stats": {
        "total": 104,
        "additions": 104,
        "deletions": 0
    }
}