{
    "author": "jdwilkin4",
    "message": "refactor(curriculum): styling forms quiz (#58427)\n\nCo-authored-by: Sem Bauke <sem@freecodecamp.org>",
    "sha": "f4ffc49403dde46355062e4feabaeb961c27f685",
    "files": [
        {
            "sha": "9d51b345c1787ed9fcf5b165469a596d3600c74c",
            "filename": "curriculum/challenges/english/25-front-end-development/quiz-styling-forms/66ed9043f45ce3ece4053ebf.md",
            "status": "modified",
            "additions": 46,
            "deletions": 267,
            "changes": 313,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/f4ffc49403dde46355062e4feabaeb961c27f685/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Fquiz-styling-forms%2F66ed9043f45ce3ece4053ebf.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/f4ffc49403dde46355062e4feabaeb961c27f685/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Fquiz-styling-forms%2F66ed9043f45ce3ece4053ebf.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Fquiz-styling-forms%2F66ed9043f45ce3ece4053ebf.md?ref=f4ffc49403dde46355062e4feabaeb961c27f685",
            "patch": "@@ -7,7 +7,7 @@ dashedName: quiz-styling-forms\n \n # --description--\n \n-To pass the quiz, you must correctly answer at least 18 of the 20 questions below.\n+To pass the quiz, you must correctly answer at least 9 of the 10 questions below.\n \n # --quizzes--\n \n@@ -17,19 +17,19 @@ To pass the quiz, you must correctly answer at least 18 of the 20 questions belo\n \n #### --text--\n \n-Which of the following is a common issue with the `datetime-local` input type?\n+What is a common issue for styling the `datetime-local` input type?\n \n #### --distractors--\n \n-It cannot be used with CSS variables.\n+It does not work with the `float` property.\n \n ---\n \n-It automatically submits the form upon value selection.\n+It is impossible to make it responsive.\n \n ---\n \n-It does not support real-time updates.\n+It does not work with `rem` units.\n \n #### --answer--\n \n@@ -39,89 +39,89 @@ The input format is different across browsers.\n \n #### --text--\n \n-Why is it important to use `box-sizing: border-box;` when styling text inputs?\n+Which of the following is considered best practice for styling text inputs?\n \n #### --distractors--\n \n-It makes the text input focusable with a keyboard.\n+Text input font sizes need to be set with `em` units and colors should be a light gray.\n \n ---\n \n-It hides the input's placeholder text.\n+Text input sizes should only use dark green borders on focus and the text color should be dark gray.\n \n ---\n \n-It removes the default browser styling for inputs.\n+Text input font colors need to be light colors and the size should only be set using the `px` unit.\n \n #### --answer--\n \n-It ensures padding and borders are included in the element's width and height.\n+Text input fonts need to be adequately sized, and the color needs to have sufficient contrast with the background.\n \n ### --question--\n \n #### --text--\n \n-What is a benefit of setting a max-width for text inputs?\n+Why is it important to not remove the ability for users to resize a `textarea` input?\n \n #### --distractors--\n \n-It prevents users from entering long text.\n+Users should be able to zoom in and out and there should be no change in the input.\n \n ---\n \n-It makes the input unresponsive on larger screens.\n+Users should be able to zoom in and out and the input should increase to twice its size.\n \n ---\n \n-It automatically adjusts the font size.\n+Users should be able to zoom in and out and the input text should triple in size.\n \n #### --answer--\n \n-It ensures the input doesn't stretch too wide on larger screens.\n+Users should be able to zoom in and out and the input should scale accordingly.\n \n ### --question--\n \n #### --text--\n \n-Why should you add `:focus` styles to text inputs?\n+What is a best practice for styling inputs in a focused state?\n \n #### --distractors--\n \n-It hides the input's border.\n+It is important to use only light gray borders for focused inputs.\n \n ---\n \n-It disables user input.\n+It is important to only use dark red borders for focused inputs.\n \n ---\n \n-It forces the browser to ignore default styles.\n+It is important to remove any noticeable indicator.\n \n #### --answer--\n \n-It improves accessibility by making the input easier to identify when focused.\n+It is important to preserve a noticeable indicator.\n \n ### --question--\n \n #### --text--\n \n-How can you prevent text inputs from being cut off when resized?\n+What is a best practice for styling inputs in an error state?\n \n #### --distractors--\n \n-By adding `overflow: hidden;`.\n+Increase the font size for the input text to `3rem`.\n \n ---\n \n-By setting a fixed height and width.\n+Set the input to `display: none;` so it is removed from the page.\n \n ---\n \n-By removing padding from the input.\n+Set the input to be disabled so users can no longer interact with it.\n \n #### --answer--\n \n-By using padding and line-height with flexible units like `em` or `rem`.\n+Provide a visual indicator with a message so users know that something is incorrect and needs to be fixed.\n \n ### --question--\n \n@@ -143,313 +143,92 @@ It hides the input label, reducing visual clutter.\n \n #### --answer--\n \n-It provides users with guidance on the expected input format without cluttering the interface.\n+It provides users with guidance on the expected input format.\n \n ### --question--\n \n #### --text--\n \n-Why should you avoid using `outline: none;` without adding a custom focus style?\n+What is WebKit?\n \n #### --distractors--\n \n-It reduces the size of the text input.\n+It is a browser engine that ensures that there are no validation errors in your CSS.\n \n ---\n \n-It hides the input from assistive technology users.\n+It is a special CSS property used in CSS Grid.\n \n ---\n \n-It makes the input read-only.\n+It is a special CSS property used in CSS flexbox.\n \n #### --answer--\n \n-It removes the focus outline, which may confuse users about which field is selected.\n+It is a browser engine that displays webpages.\n \n ### --question--\n \n #### --text--\n \n-What is the purpose of using Flexbox or Grid for form layout?\n+When is it appropriate to use `appearance: none;` for form elements?\n \n #### --distractors--\n \n-To make form controls appear in random positions.\n+To remove form elements completely from the DOM and page.\n \n ---\n \n-To make the form smaller on mobile devices.\n+To hide form elements from those who use assistive technologies like screen readers.\n \n ---\n \n-To hide form controls on large screens.\n+To remove only default colors that are applied to the form elements and use your own.\n \n #### --answer--\n \n-To create a well-structured and responsive form layout.\n+To remove some of the default styles that are applied to the form elements.\n \n ### --question--\n \n #### --text--\n \n-Why should input elements be styled with a solid border?\n+What are some considerations when working with `appearance: none;` on form elements?\n \n #### --distractors--\n \n-It makes the form look more colorful.\n+It is important to preserve hovered and submit indicators on interactive elements.\n \n ---\n \n-It automatically increases form field size.\n+It is important to only use `appearance: none;` when you want to apply different styles for the Safari browser.\n \n ---\n \n-It forces users to zoom in on mobile devices.\n+It is important to use `appearance: none;` when you need to completely remove a form element from the page.\n \n #### --answer--\n \n-To ensure input fields are clearly visible and easily recognizable as form controls.\n+It is important to preserve focus and error indicators on interactive elements.\n \n ### --question--\n \n #### --text--\n \n-How does increasing the margin between form elements affect form usability?\n+Which type of form elements are commonly styled using `appearance: none;` to remove their default look?\n \n #### --distractors--\n \n-It decreases accessibility on mobile devices.\n+`label` elements\n \n ---\n \n-It prevents users from submitting the form.\n+`div` elements\n \n ---\n \n-It hides form labels.\n+`span` elements\n \n #### --answer--\n \n-It improves readability by helping users see the grouping of related form elements.\n-\n-### --question--\n-\n-#### --text--\n-\n-What is the primary reason for using `appearance: none` in form elements?\n-\n-#### --distractors--\n-\n-To add new default styles to form elements.\n-\n----\n-\n-To enable form elements to appear larger on mobile devices.\n-\n----\n-\n-To disable form validation for specific elements.\n-\n-#### --answer--\n-\n-To remove the default browser styling from form elements and apply custom styles.\n-\n-### --question--\n-\n-#### --text--\n-\n-Which type of form elements is commonly styled using `appearance: none` to remove their default look?\n-\n-#### --distractors--\n-\n-`<label>` elements\n-\n----\n-\n-`<div>` elements\n-\n----\n-\n-`<span>` elements\n-\n-#### --answer--\n-\n-`<input>` and `<select>` elements.\n-\n-### --question--\n-\n-#### --text--\n-\n-When should you avoid using `appearance: none` on form controls?\n-\n-#### --distractors--\n-\n-When you want to fully customize the form control's style.\n-\n----\n-\n-When the browser's default styles are hard to override.\n-\n----\n-\n-When you are building a mobile-first responsive form.\n-\n-#### --answer--\n-\n-When relying on the accessibility and familiarity of native form control appearances.\n-\n-### --question--\n-\n-#### --text--\n-\n-How can using `appearance: none` improve the design of radio buttons and checkboxes?\n-\n-#### --distractors--\n-\n-It increases the size of radio buttons and checkboxes.\n-\n----\n-\n-It automatically creates animation effects for radio buttons and checkboxes.\n-\n----\n-\n-It prevents users from interacting with radio buttons and checkboxes.\n-\n-#### --answer--\n-\n-It removes the browser's default appearance, allowing you to fully customize the design.\n-\n-### --question--\n-\n-#### --text--\n-\n-What is a common issue that arises when using `appearance: none` on a select element?\n-\n-#### --distractors--\n-\n-It makes the `select` element invisible.\n-\n----\n-\n-It disables the dropdown functionality.\n-\n----\n-\n-It breaks form validation.\n-\n-#### --answer--\n-\n-It removes the dropdown arrow, requiring you to add a custom arrow or indicator.\n-\n-### --question--\n-\n-#### --text--\n-\n-What issue can occur when using HTML5 validation attributes like `required` without custom messaging?\n-\n-#### --distractors--\n-\n-It automatically validates all inputs without user interaction.\n-\n----\n-\n-It prevents the form from being submitted if all fields are filled.\n-\n----\n-\n-It allows users to see detailed error messages for each input.\n-\n-#### --answer--\n-\n-Users may not understand why their submission fails, leading to frustration if no helpful feedback is provided.\n-\n-### --question--\n-\n-#### --text--\n-\n-What issue can arise when no margin is added between the header and the content?\n-\n-#### --distractors--\n-\n-It makes the content load faster.\n-\n----\n-\n-It improves the overall readability of the content.\n-\n----\n-\n-It automatically centers the content under the header.\n-\n-#### --answer--\n-\n-The content may appear cramped or overlap with the header, making it difficult to read and reducing visual clarity.\n-\n-### --question--\n-\n-#### --text--\n-\n-What issue may arise with custom fonts when used in form elements?\n-\n-#### --distractors--\n-\n-They may not display correctly on all browsers.\n-\n----\n-\n-They always load faster than system fonts.\n-\n----\n-\n-They prevent the use of responsive design.\n-\n-#### --answer--\n-\n-Custom fonts may not be accessible to users if they are not properly loaded or fallback fonts are not specified.\n-\n-### --question--\n-\n-#### --text--\n-\n-What issue can arise when using `overflow: hidden;` on form elements?\n-\n-#### --distractors--\n-\n-It improves the form's overall accessibility.\n-\n----\n-\n-It automatically adjusts the form to fit within smaller screens.\n-\n----\n-\n-It ensures that all text content is always visible.\n-\n-#### --answer--\n-\n-It can cause content, such as text or labels, to be cut off if the element is resized or if padding is used incorrectly.\n-\n-### --question--\n-\n-#### --text--\n-\n-What common problem arises when submitting form data that includes `color` input?\n-\n-#### --distractors--\n-\n-The `color` value gets automatically converted to grayscale.\n-\n----\n-\n-The browser displays an alert before submitting the form.\n-\n----\n-\n-It replaces the `color` value with a default value.\n-\n-#### --answer--\n-\n-The `color` input value is submitted as a hexadecimal string, which may require formatting on the server.\n-\n+`input` elements"
        }
    ],
    "stats": {
        "total": 313,
        "additions": 46,
        "deletions": 267
    }
}