{
    "author": "estefaniacn",
    "message": "fix(curriculum): Update Basic Parts Of a Computer Lecture (#59589)",
    "sha": "f96809e75737f1b744c818daa2f1a4be2393b82f",
    "files": [
        {
            "sha": "6ef0cdc03bc4ce2da6f62c1d0396bb3decba6d7e",
            "filename": "curriculum/challenges/english/25-front-end-development/lecture-understanding-computer-internet-and-tooling-basics/672aa578a2129554d4675049.md",
            "status": "modified",
            "additions": 6,
            "deletions": 6,
            "changes": 12,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/f96809e75737f1b744c818daa2f1a4be2393b82f/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672aa578a2129554d4675049.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/f96809e75737f1b744c818daa2f1a4be2393b82f/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672aa578a2129554d4675049.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Flecture-understanding-computer-internet-and-tooling-basics%2F672aa578a2129554d4675049.md?ref=f96809e75737f1b744c818daa2f1a4be2393b82f",
            "patch": "@@ -2,7 +2,7 @@\n id: 672aa578a2129554d4675049\n title: What Are the Basic Parts of a Computer?\n challengeType: 11\n-videoId: SJT6r_ejSqw\n+videoId: sZy-_LterFE\n dashedName: what-are-the-basic-parts-of-a-computer\n ---\n \n@@ -18,35 +18,35 @@ Computers are very powerful machines that perform a variety of tasks like writin\n \n As a developer, it is important to understand the basic inner workings of a computer.\n \n-The first major component of a computer would be the motherboard. The motherboard holds all of the memory, connectors, and hard drives that are needed to run the computer. It serves as the main circuit board for the computer. \n+The first major component of a computer would be the motherboard. The motherboard holds all the memory and connectors that are needed to run the computer. It serves as the main circuit board for the computer.\n \n Inside the computer case of the motherboard, you will find the CPU which stands for Central Processing Unit. The CPU is a processor that is responsible for executing instructions and performing calculations. It is often referred to as the brain of the computer.\n \n-The CPU is a small square with a chip that goes into the motherboard's CPU socket. A socket is a place where the CPU is inserted. The CPU processor speed is measured in gigahertz (GHz) and mega-hertz (MHz). Gigahertz is a billion cycles per second and mega-hertz is a million cycles per second.\n+The CPU is a small square with a chip that goes into the motherboard's CPU socket. The CPU processor speed is measured in gigahertz (GHz) and mega-hertz (MHz). Gigahertz is a billion cycles per second and mega-hertz is a million cycles per second.\n \n The next critical component of a computer would be the system's short term memory. This is known as RAM or Random Access Memory. RAM is a temporary storage location for the computer's CPU. Anytime the computer needs to access data quickly, it will use RAM.\n \n The more RAM you have on your computer, the faster it will run and the more programs you can run at the same time. If you are running low on RAM, your computer will run slower and you will notice the difference in performance.\n \n It is important to note that RAM is volatile memory. This means that it is lost when the computer is turned off. This is why it is important to save your work on your computer.\n \n-When you do save your files, they are stored on the hard drive. The hard disk drive, or HDD, is a permanent storage location that is used to store data even when the computer is turned off. This is where all of your files and software are stored.\n+When you do save your files, they are stored on the hard drive. The hard disk drive, or HDD, is a permanent storage location that is used to store data even when the computer is turned off. This is where all your files and software are stored.\n \n The hard drive is made up of a spinning platter and an arm. The platter is where the data is stored and the arm is used to read and write data to the platter. When you have a faster hard drive, your computer will boot up faster and your programs will run faster.\n \n Another type of data storage would be the Solid State Drive, or SSD for short. SSD is non volatile flash memory and can be used in place of a hard drive. SSDs are faster and smaller than hard drives but hard drives are cheaper and have more storage capacity.\n \n Another key component of a computer is the power supply unit, or PSU. The PSU is responsible for converting the electricity from the wall outlet into a form that the computer can use. It sends the power from the outlet to the motherboard, CPU, and other components of the computer.\n \n-Another key component would be the expansion cards. These are cards that are inserted into the motherboard to add additional functionality to the computer. Examples of expansion cards would be the video card, sound card, and network card.\n+Another key component would be the expansion cards. These cards are inserted into the motherboard to add additional functionality to the computer. Examples of expansion cards would be the video card, sound card, and network card.\n \n The video card, also known as the Graphics Processing Unit or GPU, is responsible for rendering visuals on the computer screen.\n \n The sound card is responsible for playing sound on the computer speakers.\n \n The network card is responsible for connecting the computer to the internet.\n \n-Even though there are many more parts to the computer, these are some basic parts that you should familiarize yourself with.\n+Even though there are many more parts to the computer, these are some basic parts that you should familiarize yourself with now.\n \n # --questions--\n "
        }
    ],
    "stats": {
        "total": 12,
        "additions": 6,
        "deletions": 6
    }
}