{
    "author": "jdwilkin4",
    "message": "feat(curriculum): adding frontend libraries chapter review page (#59951)\n\nCo-authored-by: Zaira <33151350+zairahira@users.noreply.github.com>",
    "sha": "fa1577e8327106c8f90683701e19601e7a3146ce",
    "files": [
        {
            "sha": "5cae1cae93b2e97ecd1b1888bf07d860165552d2",
            "filename": "curriculum/challenges/english/25-front-end-development/review-front-end-libraries/6724e2dbf723fe1c8883cc69.md",
            "status": "modified",
            "additions": 1650,
            "deletions": 1,
            "changes": 1651,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/fa1577e8327106c8f90683701e19601e7a3146ce/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-front-end-libraries%2F6724e2dbf723fe1c8883cc69.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/fa1577e8327106c8f90683701e19601e7a3146ce/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-front-end-libraries%2F6724e2dbf723fe1c8883cc69.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-front-end-libraries%2F6724e2dbf723fe1c8883cc69.md?ref=fa1577e8327106c8f90683701e19601e7a3146ce",
            "patch": "@@ -7,7 +7,1656 @@ dashedName: review-front-end-libraries\n \n # --description--\n \n-Description placeholder\n+## JavaScript Libraries and Frameworks\n+\n+- JavaScript libraries and frameworks offer quick solutions to common problems and speed up development by providing pre-built code.\n+- Libraries are generally more focused on providing solutions to specific tasks, such as manipulating the DOM, handling events, or managing AJAX requests. \n+- A couple of examples of JavaScript libraries are jQuery and React.\n+- Frameworks, on the other hand, provide a more defined structure for building applications. They often come with a set of rules and conventions that developers need to follow.\n+- Examples of frameworks include Angular and Next.js, a meta framework for React.\n+- **Single-page applications** (SPAs) are web applications that load a single HTML page and dynamically update that page as the user interacts with the application without reloading the entire page.\n+- SPAs use JavaScript to manage the application's state and render content. This is often done using frameworks which provide great tools for building complex user interfaces.\n+- Some issues surrounding SPAs include:\n+\n+  - Screen readers struggle with dynamically updated content.\n+  - The URL does not change when the user navigates within the application, which can make it difficult to bookmark, backtrack or share specific pages.\n+  - Initial load time can be slow if the application is large as all the assets need to be loaded upfront.\n+\n+## React\n+\n+- React is a popular JavaScript library for building user interfaces and web applications.\n+- A core concept of React is the creation of reusable UI components that can update and render independently as data changes.\n+- React allows developers to describe how the UI should look like based on the application state. React then updates and renders the right components when the data or the state changes.\n+\n+## React Components\n+\n+- Components are the building blocks of React applications that allow developers to break down complex user interfaces into smaller, manageable pieces.\n+- The UI is described using JSX, an extension of JavaScript syntax, that allows developers to write HTML-like code within JavaScript.\n+- Components are basically JS functions or classes that return a piece of UI.\n+\n+Here is an example of a simple React component that renders a greeting message:\n+\n+```jsx\n+function Greeting() {\n+  const name = 'Anna';\n+  return <h1>Welcome, {name}!</h1>;\n+}\n+```\n+\n+To use the component, you can simply call:\n+    \n+```jsx\n+  <Greeting />\n+```\n+\n+## Importing and Exporting React components\n+\n+- React components can be exported from one file and imported into another file.\n+- Let's say you have a component named `City` in a file named `City.js`. You can export the component using the `export` keyword:\n+\n+```jsx\n+// City.js\n+function City() {\n+  return <p>New York</p>;\n+}\n+\n+export default City;\n+```\n+\n+- To import the `City` component into another file, you can use the `import` keyword:\n+\n+```jsx\n+// App.js\n+import City from './City';\n+\n+function App() {\n+  return (\n+    <div>\n+      <h1>My favorite city is:</h1>\n+      <City />\n+    </div>\n+  );\n+}\n+```\n+\n+- The `default` keyword is used as it is the default export from the `City.js` file.\n+\n+- You can also choose to export the component on the same line as the component definition like this:\n+\n+```jsx\n+export default function City() {\n+  return <p>New York</p>;\n+}\n+```\n+\n+## Setting up a React project using Vite\n+\n+- Project setup tools and CLIs provide a quick & easy way to start new projects, allowing developers to focus on writing code rather than dealing with configuration. \n+- Vite, a popular project setup tool and can be used with React.\n+- To create a new project with Vite, you can use the following command in your terminal:\n+\n+```bash\n+npm create vite@latest my-react-app -- --template react\n+```\n+\n+This command creates a new React project named `my-react-app` using Vite's React template. In the project directory, you will see a `package.json` file with the project dependencies and commands listed in it.\n+\n+- To run the project, navigate to the project directory and run the following commands:\n+\n+```bash\n+cd my-react-app # path to the project directory\n+npm install # installs the dependencies listed in the package.json file\n+```\n+\n+- Once the dependencies are installed, you should notice a new folder in your project called `node_modules`. \n+\n+- The `node_modules` folder is where all the packages and libraries required by your project are stored.\n+\n+- To run your project, use the following command:\n+\n+```bash\n+npm run dev\n+```\n+\n+- After that, open your browser and navigate to `http://localhost:5173` to see your React application running.\n+\n+- To actually see the code for the starter template, you can go into your project inside the `src` folder and you should see the `App.jsx` file. \n+\n+## Passing props in React components\n+\n+- In React, props (short for properties) are a way to pass data from a parent component to a child component. This mechanism is needed to create reusable and dynamic UI elements.\n+- Props can be any JavaScript value. To pass props from a parent to a child component, you add the props as attributes when you use the child component in the parent's JSX. Here's a simple example:\n+\n+```jsx\n+// Parent component\n+function Parent() {\n+  const name = 'Anna';\n+  return <Child name={name} />;\n+}\n+\n+// Child component\n+function Child(props) {\n+  return <h1>Hello, {props.name}!</h1>;\n+}\n+```\n+\n+You can pass multiple props using the spread operator `(...)`, after converting them to an object. Here's an example:\n+    \n+```jsx\n+// Parent component\n+function Parent() {\n+  const person = {\n+    name: 'Anna',\n+    age: 25,\n+    city: 'New York'\n+  };\n+  return <Child {...person} />;\n+}\n+```\n+\n+In this code, the spread operator `{...person}` converts the person object into individual props that are passed to the Child component.\n+\n+## Conditional rendering in React\n+\n+- Conditional rendering in React allows you to create dynamic user interfaces. It is used to show different content based on certain conditions or states within your application.\n+- There are several ways to conditionally render content in React. One common approach is to use the ternary operator. Here's an example:\n+\n+```jsx\n+function Greeting({ isLoggedIn }) {\n+  return (\n+    <div>\n+      {isLoggedIn ? <h1>Welcome back!</h1> : <h1>Please log in</h1>}\n+    </div>\n+  );\n+}\n+```\n+\n+- Another way to conditionally render content is to use the logical AND (`&&`) operator. This is useful when you want to render content only if a certain condition is met. Here's an example:\n+\n+```jsx\n+function Greeting({ user }) {\n+  return (\n+    <div>\n+      {user && <h1>Welcome, {user.name}!</h1>}\n+    </div>\n+  );\n+}\n+```\n+\n+In the code above, the `h1` element is only rendered if the user object is truthy.\n+\n+You can also use a direct `if` statement this way:\n+\n+```js\n+function Greeting({ isLoggedIn }) {\n+  if (isLoggedIn) {\n+    return <h1>Welcome back!</h1>;\n+  }\n+  return <h1>Please sign in</h1>;\n+}\n+```\n+\n+## Rendering lists in React\n+\n+- Rendering lists in React is a common task when building user interfaces. \n+- Lists can be rendered using the JS array `map()` method to iterate over an array of items and return a new array of JSX elements.\n+- For example, if you have an array of names that you want to render as a list, you can do the following:\n+\n+```jsx\n+function NameList({ names }) {\n+  return (\n+    <ul>\n+      {names.map((name, index) => (\n+        <li key={`${name}-${index}`}>{name}</li>\n+      ))}\n+    </ul>\n+  );\n+}\n+```\n+\n+- Always remember to provide a unique key for each list item to help React manage the updating and rendering roles. With these techniques, you can create flexible, efficient, and dynamic lists in your React applications.\n+\n+## Inline styles in React\n+\n+- Inline styles in React allow you to apply CSS styles directly to JSX elements using JavaScript objects.\n+- To apply inline styles in React, you can use the style attribute on JSX elements. The style attribute takes an object where the keys are CSS properties in camelCase and the values are the corresponding values. Here's an example:\n+\n+```js\n+function Greeting() {\n+  return (\n+    <h1\n+      style={{ color: 'blue', fontSize: '24px', backgroundColor: 'lightgray' }}\n+    >\n+      Hello, world!\n+    </h1>\n+  );\n+}\n+\n+export default Greeting;\n+```\n+\n+You can also extract the styles into a separate object and reference it in the `style` attribute this way:\n+\n+```jsx\n+function Greeting() {\n+\n+  const styles = {\n+    color: 'blue',\n+    fontSize: '24px',\n+    backgroundColor: 'lightgray'\n+  };\n+\n+  return <h1 style={styles}>Hello, world!</h1>;\n+}\n+\n+export default Greeting;\n+```\n+\n+- Inline styles support dynamic styling by allowing you to conditionally apply styles based on props or state. Here is an example of how you can conditionally apply styles based on a prop:\n+\n+```jsx\n+function Greeting({ isImportant }) {\n+\n+  const styles = {\n+    color: isImportant ? 'red' : 'black',\n+    fontSize: isImportant ? '24px' : '16px'\n+  };\n+\n+  return <h1 style={styles}>Hello, world!</h1>;\n+}\n+\n+export default Greeting;\n+```\n+\n+- In the code above, the `color` and `fontSize` styles are conditionally set based on the `isImportant` prop.\n+\n+## Working with Events in React\n+\n+- **Synthetic Event System**: This is React's way of handling events. It serves as a wrapper around the native events like the `click`, `keydown`, and `submit` events. Event handlers in React use the camel casing naming convention. (Ex. `onClick`, `onSubmit`, etc)\n+\n+Here is an example of using the `onClick` attribute for a `button` element in React:\n+\n+```jsx\n+function handleClick() {\n+  console.log(\"Button clicked!\");\n+}\n+\n+<button onClick={handleClick}>Click Me</button>;\n+```\n+\n+In React, event handler functions usually start with the prefix `handle` to indicate they are responsible for handling events, like `handleClick` or `handleSubmit`.\n+\n+When a user action triggers an event, React passes a Synthetic Event object to your handler. This object behaves much like the native Event object in vanilla JavaScript, providing properties like `type`, `target`, and `currentTarget`.\n+\n+To prevent default behaviors like browser refresh during an `onSubmit` event, for example, you can call the `preventDefault()` method:\n+\n+```jsx\n+function handleSubmit(event) {\n+  event.preventDefault();\n+  console.log(\"Form submitted!\");\n+}\n+\n+<form onSubmit={handleSubmit}>\n+  <input type=\"text\" />\n+  <button>Submit</button>\n+</form>;\n+```\n+\n+You can also wrap a handler function in an arrow function like this:\n+\n+```jsx\n+function handleDelete(id) {\n+  console.log(\"Deleting item:\", id);\n+}\n+\n+<button onClick={() => handleDelete(1)}>Delete Item</button>;\n+```\n+\n+## Working with State and the `useState` Hook\n+\n+- **Definition for state**: In React, state is an object that contains data for a component. When the state updates the component will re-render. React treats state as immutable, meaning you should not modify it directly.  \n+- **`useState()` Hook**: The `useState` hook is a function that lets you declare state variables in functional components.  Here is a basic syntax:\n+\n+```js\n+const [stateVariable, setStateFunction] = useState(initialValue);\n+```\n+\n+In the state variable you have the following:\n+\n+- `stateVariable` holds the current state value\n+- `setStateFunction` (the setter function) updates the state variable\n+- `initialValue` sets the initial state\n+\n+Here is a complete example for a `Counter` component:\n+\n+```jsx\n+import { useState } from \"react\";\n+\n+function Counter() {\n+  const [count, setCount] = useState(0);\n+\n+  return (\n+    <div>\n+      <h2>{count}</h2>\n+\n+      <button onClick={() => setCount(count - 1)}>Decrement</button>\n+      <button onClick={() => setCount(count + 1)}>Increment</button>\n+    </div>\n+  );\n+}\n+\n+export default Counter;\n+```\n+\n+## Rendering and React Components \n+\n+- **Definition**: In React, rendering is the process by which components appear in the user interface (UI), usually the browser. The rendering process consists of three stages: trigger, render, and commit.\n+\n+The trigger stage occurs when React detects that something has changed and the user interface (UI) might need to be updated. This change is often due to an update in state or props.\n+\n+Once the trigger happens, React enters the render stage. Here, React re-evaluates your components and figures out what to display. To do this, React uses a lightweight copy of the \"real\" DOM called the virtual DOM. With the virtual DOM, React can quickly check what needs to change in the component.\n+\n+The commit stage is where React takes the prepared changes from the virtual DOM and applies them to the real DOM. In other words, this is the stage where you see the final result on the screen.\n+\n+## Updating Objects and Arrays in State\n+\n+- **Updating Objects in State**: If you need to update an object in state, then you should make a new object or copy an existing object first, then set the state for that new object. Any object put into state should be considered as read-only. Here is an example of setting a user's name, age and city. The `handleChange` function is used to handle updates to the user's information:\n+\n+```jsx\n+import { useState } from \"react\";\n+\n+function Profile() {\n+  const [user, setUser] = useState({ name: \"John Doe\", age: 31, city: \"LA\" });\n+\n+  const handleChange = (e) => {\n+    const { name, value } = e.target;\n+\n+    setUser((prevUser) => ({...prevUser, [name]: value}));\n+  };\n+\n+  return (\n+    <div>\n+      <h1>User Profile</h1>\n+      <p>Name: {user.name}</p>\n+      <p>Age: {user.age}</p>\n+      <p>City: {user.city}</p>\n+\n+      <h2>Update User Age </h2>\n+      <input type=\"number\" name=\"age\" value={user.age} onChange={handleChange} />\n+\n+      <h2>Update User Name </h2>\n+      <input type=\"text\" name=\"name\" value={user.name} onChange={handleChange} />\n+\n+      <h2>Update User City </h2>\n+      <input type=\"text\" name=\"city\" value={user.city} onChange={handleChange} />\n+    </div>\n+  );\n+}\n+\n+export default Profile;\n+```\n+\n+- **Updating Arrays in State**: When updating arrays in state, it is important not to directly modify the array using methods like `push()` or `pop()`. Instead you should create a new array when updating state:\n+\n+```jsx\n+const addItem = () => {\n+  const newItem = {\n+    id: items.length + 1,\n+    name: `Item ${items.length + 1}`,\n+  };\n+\n+  // Creates a new array\n+  setItems((prevItems) => [...prevItems, newItem]);\n+};\n+```\n+\n+If you want to remove items from an array, you should use the `filter()` method, which returns a new array after filtering out whatever you want to remove:\n+\n+```jsx\n+const removeItem = (id) => {\n+  setItems((prevItems) => prevItems.filter((item) => item.id !== id));\n+};\n+```\n+\n+## Referencing Values Using Refs\n+\n+- **`ref` Attribute**: You can access a DOM node in React by using the `ref` attribute. Here is an example to showcase a `ref` to focus an `input` element. The `current` property is used to access the current value of that `ref`:\n+\n+```jsx\n+import { useRef } from \"react\";\n+\n+const Focus = () => {\n+  const inputRef = useRef(null);\n+\n+  const handleFocus = () => {\n+    if (inputRef.current) {\n+      inputRef.current.focus();\n+    }\n+  };\n+\n+  return (\n+    <div>\n+      <input ref={inputRef} type=\"text\" placeholder=\"Enter text\" />\n+      <button onClick={handleFocus}>Focus Input</button>\n+    </div>\n+  );\n+};\n+\n+export default Focus;\n+```\n+\n+## Working with the `useEffect` Hook\n+\n+- **`useEffect()` Hook**: In React, an effect is anything that happens outside the component rendering process. That is, anything React does not handle directly as part of rendering the UI. Common examples include fetching data, updating the browser tab's title, reading from or writing to the browser's local storage, getting the user's location, and much more. These operations interact with the outside world and are known as side effects. React provides the `useEffect` hook to let you handle those side effects. `useEffect` lets you run a function after the component renders or updates.\n+\n+```js\n+import { useEffect } from \"react\";\n+\n+useEffect(() => {\n+ // Your side effect logic (usually a function) goes here\n+}, [dependencies]);\n+```\n+\n+The effect function runs after the component renders, while the optional `dependencies` argument controls when the effect runs.\n+\n+Note that `dependencies` can be an array of \"reactive values\" (state, props, functions, variables, and so on), an empty array, or omitted entirely. Here's how all of those options control how `useEffect` works:\n+\n+- If `dependencies` is an array that includes one or more reactive values, the effect will run whenever they change.\n+\n+- If `dependencies` is an empty array, `useEffect` runs only once when the component first renders.\n+\n+- If you omit `dependencies`, the effect runs every time the component renders or updates.\n+\n+## How to Create Custom Hooks\n+\n+- **Custom Hooks**: A custom hook allows you to extract reusable logic from components, such as data fetching, state management, toggling, and side effects like tracking online status. In React, all built-in hooks start with the word `use`, so your custom hook should follow the same convention.\n+\n+Here is an example of creating a `useDebounce` hook:\n+\n+```jsx\n+function useDebounce(value, delay) {\n+  const [debouncedValue, setDebouncedValue] = useState(value);\n+\n+  useEffect(() => {\n+    const handler = setTimeout(() => {\n+      setDebouncedValue(value);\n+    }, delay);\n+\n+    return () => {\n+      clearTimeout(handler);\n+    };\n+  }, [value, delay]);\n+\n+  return debouncedValue;\n+}\n+\n+export { useDebounce };\n+```\n+\n+## Working with Forms in React\n+\n+- **Controlled Inputs**: This is when you store the input field value in state and update it through `onChange` events. This gives you complete control over the form data and allows instant validation and conditional rendering.\n+\n+```jsx\n+import { useState } from \"react\";\n+\n+function App() {\n+  const [name, setName] = useState(\"\");\n+\n+  const handleChange = (e) => {\n+    setName(e.target.value);\n+  };\n+\n+  const handleSubmit = (e) => {\n+    e.preventDefault();\n+    console.log(name);\n+  };\n+\n+  return (\n+    <>\n+      <form onSubmit={handleSubmit}>\n+        <label htmlFor=\"name\">Your name</label> <br />\n+        <input value={name} id=\"name\" onChange={handleChange} type=\"text\" />\n+        <button type=\"submit\">Submit</button>\n+      </form>\n+    </>\n+  );\n+}\n+\n+export default App;\n+```\n+\n+- **Uncontrolled Inputs**: Instead of handling the inputs through the `useState` hook, uncontrolled inputs in HTML maintain their own internal state with the help of the DOM. Since the DOM controls the input values, you need to pull in the values of the input fields with a `ref`. \n+\n+```jsx\n+import { useRef } from \"react\";\n+\n+function App() {\n+ const nameRef = useRef();\n+\n+ const handleSubmit = (e) => {\n+   e.preventDefault();\n+   console.log(nameRef.current.value);\n+ };\n+\n+ return (\n+   <form onSubmit={handleSubmit}>\n+     <label htmlFor=\"name\">Your</label>{\" \"}\n+     <input type=\"text\" ref={nameRef} id=\"name\" />\n+     <button type=\"submit\">Submit</button>\n+   </form>\n+ );\n+}\n+\n+export default App;\n+```\n+\n+## Working with the `useActionState` Hook\n+\n+- **Server Actions**: These are functions that run on the server to allow form handling right on the server without the need for API endpoints. Here is an example from a Next.js application:\n+\n+```js\n+\"use server\";\n+\n+async function submitForm(formData) {\n+ const name = formData.get(\"name\");\n+ return { message: `Hello, ${name}!` };\n+}\n+```\n+\n+The `\"use server\"` directive marks the function as a server action.\n+\n+- **`useActionState` Hook**: This hook updates state based on the outcome of a form submission. Here's the basic syntax of the `useActionState` hook:\n+\n+```js\n+const [state, action, isPending] = useActionState(actionFunction, initialState, permalink);\n+```\n+\n+- `state` is the current state the action returns.\n+- `action` is the function that triggers the server action.\n+- `isPending` is a boolean that indicates whether the action is currently running or not.\n+- `actionFunction` parameter is the server action itself.\n+- `initialState` is the parameter that represents the starting point for the state before the action runs.\n+- `permalink` is an optional string that contains the unique page URL the form modifies.\n+\n+## Data Fetching in React\n+\n+- **Options For Fetching Data**: There are many different ways to fetch data in React. You can use the native `Fetch` API, or third party tools like Axios or SWR. \n+- **Commonly Used State Variables When Fetching Data**: Regardless of which way you choose to fetch your data in React, there are some pieces of state you will need to keep track of. The first is the data itself. The second will track whether the data is still being fetched. The third is a state variable that will capture any errors that might occur during the data fetching process. \n+\n+```js\n+const [data, setData] = useState(null);\n+const [loading, setLoading] = useState(true);\n+const [error, setError] = useState(null);\n+```\n+\n+Since data fetching is a side effect, it's best to use the `Fetch API` inside of a `useEffect` hook.\n+\n+```js\n+useEffect(() => {\n+  const fetchData = async () => {\n+    try {\n+      const res = await fetch(\"https://jsonplaceholder.typicode.com/posts\");\n+      \n+      if (!res.ok) {\n+        throw new Error(\"Network response was not ok\");\n+      }\n+\n+      const data = await res.json();\n+      setData(data);\n+    } catch (err) {\n+      setError(err);\n+    } finally {\n+      setLoading(false);\n+    }\n+  };\n+\n+  fetchData();\n+}, []);\n+```\n+\n+Then you can render a loading message if the data fetching is not complete, an error message if there was an error fetching the data, or the results.\n+\n+```jsx\n+if (loading) {\n+  return <p>Loading...</p>;\n+}\n+\n+if (error) {\n+  return <p>{error.message}</p>;\n+}\n+\n+return (\n+  <ul>\n+    {data.map((post) => (\n+      <li key={post.id}>{post.title}</li>\n+    ))}\n+  </ul>\n+);\n+```\n+\n+If you want to use Axios, you need to install and import it:\n+\n+```bash\n+npm i axios\n+```\n+\n+```js\n+import axios from \"axios\";\n+```\n+\n+Then you can fetch the data using `axios.get`:\n+\n+```js\n+const [data, setData] = useState(null);\n+const [loading, setLoading] = useState(true);\n+const [error, setError] = useState(null);\n+\n+useEffect(() => {\n+  const fetchData = async () => {\n+    try {\n+      const res = await axios.get(\n+        \"https://jsonplaceholder.typicode.com/users\"\n+      );\n+      setData(res.data);\n+    } catch (err) {\n+      setError(err);\n+    } finally {\n+      setLoading(false);\n+    }\n+  };\n+\n+  fetchData();\n+}, []);\n+```\n+\n+To fetch data using the `useSWR` hook, you need to first install and import it.\n+\n+```bash\n+npm i swr\n+```\n+\n+```js\n+import useSWR from \"swr\";\n+```\n+\n+Here is how you can use the hook to fetch data:\n+\n+```jsx\n+import useSWR from \"swr\";\n+\n+const fetcher = (url) => fetch(url).then((res) => res.json());\n+\n+const FetchTodos = () => {\n+ const { data, error } = useSWR(\n+   \"https://jsonplaceholder.typicode.com/todos\",\n+   fetcher\n+ );\n+\n+ if (!data) {\n+   return <h2>Loading...</h2>;\n+ }\n+ if (error) {\n+   return <h2>Error: {error.message}</h2>;\n+ }\n+\n+ return (\n+   <>\n+     <h2>Todos</h2>\n+     <div>\n+       {data.map((todo) => (\n+         <h3 key={todo.id}>{todo.title}</h3>\n+       ))}\n+     </div>\n+   </>\n+ );\n+};\n+\n+export default FetchTodos;\n+```\n+\n+## Working with the `useOptimistic` Hook\n+\n+- **`useOptimistic` Hook**: This hook is used to keep UIs responsive while waiting for an async action to complete in the background. It helps manage \"optimistic updates\" in the UI, a strategy in which you provide immediate updates to the UI based on the expected outcome of an action, like waiting for a server response.\n+\n+Here is the basic syntax:\n+\n+```js\n+const [optimisticState, addOptimistic] = useOptimistic(actualState, updateFunction);\n+```\n+\n+- `optimisticState` is the temporary state that updates right away for a better user experience.\n+- `addOptimistic` is the function that applies the optimistic update before the actual state changes.\n+- `actualState` is the real state value that comes from the result of an action, like fetching data from a server.\n+- `updateFunction` is the function that determines how the optimistic state should update when called.\n+\n+Here is an example of using the `useOptimistic` hook in a `TaskList` component:\n+\n+```js\n+\"use client\";\n+\n+import { useOptimistic } from \"react\";\n+\n+export default function TaskList({ tasks, addTask }) {\n+  const [optimisticTasks, addOptimisticTask] = useOptimistic(\n+    tasks,\n+    (state, newTask) => [...state, { text: newTask, pending: true }]\n+  );\n+\n+  async function handleSubmit(e) {\n+    e.preventDefault();\n+    const formData = new FormData(e.target);\n+\n+    addOptimisticTask(formData.get(\"task\"));\n+\n+    addTask(formData);\n+    e.target.reset();\n+  }\n+\n+  return <>{/* UI */}</>;\n+}\n+```\n+\n+- **`startTransition`**: This is used to render part of the UI and mark a state update as a non-urgent transition. This allows the UI to be responsive during expensive updates. Here is the basic syntax:\n+\n+```js\n+startTransition(action)\n+```\n+\n+The `action` performs a state update or triggers some transition-related logic. This ensures that urgent UI updates (like typing or clicking) are not blocked.\n+\n+## Working with the `useMemo` Hook\n+\n+- **Memoization**: This is an optimization technique in which the result of expensive function calls are cached (remembered) based on specific arguments. When the same arguments are provided again, the cached result is returned instead of re-computing the function.\n+- **`useMemo` Hook**: This hook is used to memoize computed values. Here is an example of memoizing the result of sorting a large array. The `expensiveSortFunction` will only run when `largeArray` changes:\n+\n+```js\n+const memoizedSortedArray = useMemo(\n+  () => expensiveSortFunction(largeArray),\n+  [largeArray]\n+);\n+```\n+\n+## Working with the `useCallback` Hook\n+\n+- **`useCallback` Hook**: This is used to memoize function references.\n+\n+```js\n+const handleClick = useCallback(() => {\n+ // code goes here\n+}, [dependency]);\n+``` \n+\n+- **`React.memo`**: This is used to memoize a component to prevent it from unnecessary re-renders when its prop has not changed.\n+\n+```js\n+const MemoizedComponent = React.memo(({ prop }) => {\n+ return (\n+   <>\n+     {/* Presentation */}\n+   </>\n+ )\n+});\n+``` \n+\n+## Dependency Management Tools\n+\n+- **Dependency Definition**: In software, a dependency is where one component or module in an application relies on another to function properly. Dependencies are common in software applications because they allow developers to use pre-built functions or tools created by others. The two core dependencies needed for a React project will be the `react` and `react-dom` packages:\n+\n+```json\n+\"dependencies\": {\n+  \"react\": \"^18.3.1\",\n+  \"react-dom\": \"^18.3.1\"\n+}\n+```\n+\n+- **Package Manager Definition**: To manage software dependencies in a project, you will need to use a package manager. A package manager is a tool used for installation, updates and removal of dependencies. Many popular programming languages like JavaScript, Python, Ruby and Java, all use package managers. Popular package managers for JavaScript include npm, Yarn and pnpm.\n+- **`package.json` File**: This is a key configuration file in projects that contains metadata about your project, including its name, version, and dependencies. It also defines scripts, licensing information, and other settings that help manage the project and its dependencies.\n+- **`package-lock.json` File**: This file will lock down the exact versions of all packages that your project is using. When you update a package, then the new versions will be updated in the lock file as well.\n+- **`node_modules` Folder**: This folder contains the actual code for the dependencies listed in your `package.json` file, including both your project's direct dependencies and any dependencies of those dependencies.\n+- **Dev Dependencies**: These are packages that are only used for development and not in production. An example of this would be a testing library like Jest. You would install Jest as a dev dependency because it is needed for testing your application locally but not needed to have the application run in production.\n+\n+```json\n+\"devDependencies\": {\n+  \"@eslint/js\": \"^9.17.0\",\n+  \"@types/react\": \"^18.3.18\",\n+  \"@types/react-dom\": \"^18.3.5\",\n+  \"@vitejs/plugin-react\": \"^4.3.4\",\n+  \"eslint\": \"^9.17.0\",\n+  \"eslint-plugin-react\": \"^7.37.2\",\n+  \"eslint-plugin-react-hooks\": \"^5.0.0\",\n+  \"eslint-plugin-react-refresh\": \"^0.4.16\",\n+  \"globals\": \"^15.14.0\",\n+  \"vite\": \"^6.0.5\"\n+}\n+```\n+\n+## React Router\n+\n+- **Introduction**: React Router is a third party library that allows you to add routing to your React applications. To begin, you will need to install React Router in an existing React project like this:\n+\n+```bash\n+npm i react-router\n+```\n+\n+Then inside of the `main.jsx` or `index.jsx` file, you will need to setup the route structure like this:\n+\n+```jsx\n+import { StrictMode } from \"react\";\n+import { createRoot } from \"react-dom/client\";\n+import { BrowserRouter, Routes, Route } from \"react-router\";\n+import App from \"./App.jsx\";\n+\n+import \"./index.css\";\n+\n+createRoot(document.getElementById(\"root\")).render(\n+  <StrictMode>\n+    <BrowserRouter>\n+      <Routes>\n+        <Route path=\"/\" element={<App />} />\n+      </Routes>\n+    </BrowserRouter>\n+  </StrictMode>\n+);\n+```\n+\n+The `path` and `element` are used to couple the URL and UI components together. In this case, we are setting up a route for the homepage that points to the `App` component. \n+\n+- **Multiple Views and Route Setup**: It is common in larger applications to have multiple views and routes setup like this:\n+\n+```jsx\n+<Routes>\n+  <Route index element={<Home />} />\n+  <Route path=\"about\" element={<About />} />\n+\n+  <Route path=\"products\">\n+    <Route index element={<ProductsHome />} />\n+    <Route path=\":category\" element={<Category />} />\n+    <Route path=\":category/:productId\" element={<ProductDetail />} />\n+    <Route path=\"trending\" element={<Trending />} />\n+  </Route>\n+</Routes>\n+```\n+\n+The `index` prop in these examples is meant to represent the default route for a given path segment. So the `Home` component will be shown at the root `/` path while the `ProductsHome` component will be shown at the `/products` path.\n+\n+- **Nesting Routes**: You can nest routes inside other routes which results in the path of the child route being appended to the parent route's path. \n+\n+```jsx\n+<Route path=\"products\">\n+  <Route path=\"trending\" element={<Trending />} />\n+</Route>\n+```\n+\n+In the example above, the path for the trending products will be products/trending.\n+\n+- **Dynamic Segments**: A dynamic segment is where any part of the URL path is dynamic. \n+\n+```jsx\n+<Route path=\":category\" element={<Category />} />\n+```\n+\n+In this example we have a dynamic segment called `category`. When a user navigates to a URL like products/brass-instruments, then the view will change to the `Category` component and you can dynamically fetch the appropriate data based on the segment.\n+\n+- **`useParams` Hook**: This hook is used to access the dynamic parameters from a URL path.\n+\n+```js\n+import { useParams } from \"react-router\";\n+\n+export default function Category() {\n+  let params = useParams();\n+   {/* Accessing the category param: params.category */}\n+   {/* rest of code goes here */}\n+}\n+```\n+\n+## React Frameworks\n+\n+- **Introduction**: React frameworks provide features like routing, image optimizations, data fetching, authentication and more. This means that you might not need to set up separate frontend and backend applications for certain use cases. Examples of React Frameworks include Next.js and Remix.\n+- **Next.js Routing**: This routing system includes support for dynamic routes, parallel routes, route handlers, redirects, internalization and more.\n+\n+Here is an example of creating a custom request handler:\n+\n+```js\n+export async function GET() {\n+  const res = await fetch(\"https://example-api.com\");\n+  const data = await res.json();\n+\n+  return Response.json({ data });\n+}\n+```\n+\n+- **Next.js Image Optimization**: The `Image` component extends the native HTML `img` element and allows for faster page loads and size optimizations. This means that images will only load when they enter the viewport and the `Image` component will automatically serve correctly sized images for each device.\n+\n+```jsx\n+import Image from \"next/image\";\n+\n+export default function Page() {\n+  return (\n+    <Image src=\"link-to-image-goes-here\" alt=\"descriptive-title-goes-here\" />\n+  );\n+}\n+``` \n+\n+## Prop Drilling\n+\n+- **Definition**: Prop drilling is the process of passing props from a parent component to deeply nested child components, even when some of the child components don't need the props.\n+\n+## State Management\n+\n+- **Context API**: Context refers to when a parent component makes information available to child components without needing to pass it explicitly through props. `createContext` is used to create a context object which represent the context that other components will read. The `Provider` is used to supply context values to the child components.\n+\n+```js\n+import { useState, createContext } from \"react\";\n+\n+const CounterContext = createContext();\n+\n+const CounterProvider = ({ children }) => {\n+  const [count, setCount] = useState(0);\n+\n+  return (\n+    <CounterContext.Provider value={{ count, setCount }}>\n+      {children}\n+    </CounterContext.Provider>\n+  );\n+};\n+\n+export { CounterContext, CounterProvider };\n+```\n+\n+- **Redux**: Redux handles state management by providing a central store and strict control over state updates. It uses a predictable pattern with actions, reducers, and middleware. Actions are payloads of information that send data from your application to the Redux store, often triggered by user interactions. Reducers are functions that specify how the state should change in response to those actions, ensuring the state is updated in an immutable way. Middleware, on the other hand, acts as a bridge between the action dispatching and the reducer, allowing you to extend Redux's functionality (e.g., logging, handling async operations) without modifying the core flow.\n+\n+- **Zustand**: This state management solution is ideal for small to medium-scale applications. It works by using a `useStore` hook to access state directly in components and pages. This lets you modify and access data without needing actions, reducers, or a provider.\n+\n+## Debugging React Components Using the React DevTools\n+\n+- **React Developer Tools**: This is a browser extension you can use in Chrome, Firefox and Edge to inspect React components and identify performance issues. For Safari, you will need to install the `react-devtools` npm package. After installing React DevTools and opening a React app in the browser, open the browser developer tools to access the two extra tabs provided for debugging React – Components and Profiler.\n+- **Components Tab**: This tab displays each component for you in a tree view format. Here are some things you can do in this tab:\n+  - view the app's component hierarchy\n+  - check and modify props, states, and context values in real time\n+  - check the source code for each selected component\n+  - log the component data to the console\n+  - inspect the DOM elements for the component\n+- **Profiler Tab**: This tab helps you analyze component performance. You can record component performance so you can identify unnecessary re-renders, view commit durations, and subsequently optimize slow components.\n+\n+## React Server Components \n+\n+- **Definition**: React Server Components are React components that render exclusively on the server, sending only the final HTML to the client. This means those components can directly access server-side resources and dramatically reduce the amount of JavaScript sent to the browser.\n+\n+## Differences Between Real and Perceived Performance\n+\n+- **Perceived Performance**: This is how users perceive the performance of a website. It's how they evaluate it in terms of responsiveness and reliability. This is a subjective measurement, so it's hard to quantify it, but it's very important, since the user experience determines the success or failure of a website.\n+- **Real Performance**: This is the objective and measurable performance of the website. It's measured using metrics like page load time, server response time, and rendering time. These measurements are influenced by multiple factors related to the network and to the code itself.\n+\n+## Techniques for Improving Perceived Performance\n+\n+- **Lazy Loading**: This technique reduces the initial load time as much as possible by loading non-essential resources in the background. \n+- **Minimize Font Delays**: If your website has custom fonts, you should also try to minimize font loading delays, since this may result in flickering or in showing the fallback font while the custom font is being loaded. A suggestion for this is using a fallback font that is similar to the custom font, so in case this happens, the change will be more subtle.\n+- **Use of Loading Indicators**: Showing a loading indicator for a long-running process as soon as the user clicks on an element can help the user feel connected and engaged with the process, making the wait time feel shorter.\n+\n+## Core Performance Concepts\n+\n+- **Source order**: This refers to the way HTML elements are structured in the document. This determines what loads first and can significantly impact performance and accessibility.\n+\n+Some best practices for source order include:\n+\n+- Placing critical content such as headings, navigation or main text higher in the HTML structure.\n+- Deferring non-essential scripts such as ones for analytics, or third-party widgets, so they don't block rendering.\n+- Using progressive enhancement, to ensure the core experience works even before styles and scripts load. Progressive enhancement is a way of building websites and applications based on the idea that you should make your page work with HTML first.\n+\n+Here is an example of good source order, using the best practices we just went through:\n+\n+```html\n+<h1>Welcome to FastSite!</h1>\n+<p>Critical information loads first.</p>\n+<script src=\"slow-script.js\" defer></script>\n+```\n+\n+- **Critical Rendering Path**: This is the sequence of steps the browser follows to convert code into pixels on the screen.\n+- **Latency**: This is the time it takes for a request to travel between the browser and the server. So in other words, high latency equals slow pages.\n+\n+Some ways of reducing latency include:\n+\n+- Using CDNs, or Content Delivery Networks, to serve files from closer locations.\n+- Enabling compression using things such as Gzip to reduce file sizes.\n+- Optimizing images and using lazy loading.\n+\n+```html\n+<img src=\"placeholder.jpg\" data-src=\"real-image.jpg\" loading=\"lazy\">\n+```\n+\n+## Improving INP\n+\n+- **Definition**: INP (Interaction to Next Paint) assesses a page's overall responsiveness by measuring the time from when a user interacts, like a click or key press, to the next time the browser updates the display. A lower INP indicates a more responsive page.\n+\n+Here are some ways to improve INP:\n+\n+- Reduce main thread work by breaking up long JavaScript tasks.\n+- Use `requestIdleCallback()` for non-critical scripts. This will queue a function to be called during a browser's idle periods.\n+- Defer or lazy-load heavy assets which were covered earlier.\n+- Optimize event handlers. If these handlers run too frequently or perform heavy operations, they can slow down the page and increase INP. The solution for this is debouncing. Debouncing ensures that the function only runs after the user stops typing for a short delay - so for example 300ms. This prevents unnecessary calculations and improves performance.\n+\n+## How Rendering Works in the Browser\n+\n+- **How Rendering works**: First the browser parses the HTML and builds the DOM. Next, the browser processes the CSS, constructing the CSS Object Model, or CSSOM. This is another tree structure that dictates how elements should be styled. Finally, the browser paints the pixels to the screen, rendering each element based on the calculated styles and layout. In complex pages, this might involve multiple layers that are composited together to form the final visual output.\n+\n+## How Performance Impacts Sustainability\n+\n+- **Background Information**: The internet accounts for around 2% of global carbon emissions—that's the same as the airline industry! Every byte transferred requires electricity, from data centers to user devices. Larger files and inefficient scripts mean more power consumption. A high-performance website isn't just faster, it also reduces unnecessary processing and energy use.\n+\n+## Ways to Reduce Page Loading Times\n+\n+- **Optimize Media Assets**: Large images and videos are common culprits for slow load times. By optimizing these assets, you can significantly speed up your site. This includes things like compressing images, using modern formats like WebP and using lazy loading for assets.\n+- **Leverage Browser Caching**: Caching allows browsers to store parts of your website locally, reducing load times for returning visitors.\n+- **Minify and Compress Files**: Reducing the size of your files can lead to quicker downloads. This includes reducing the size of transmitted files and minifying CSS and JavaScript files.\n+\n+## Improving \"time to usable\"\n+\n+- **Definition**: \"time to usable\" is the interval from when a user requests a page to when they can meaningfully interact with it. To improve \"time to usable\" you can lazy load your asset or minimize render-blocking resources.\n+\n+## Key Metrics for Measuring Performance\n+\n+- **First Contentful Paint or FCP**: It measures how quickly the first piece of content—text or image—appears on the screen. A good FCP is regarded as a time below 1.8 seconds, and a poor FCP is above 3 seconds. You can check your FCP using Chrome DevTools and checking the performance tab.\n+- **Total Blocking Time**: This shows how long the main thread is blocked by heavy JavaScript tasks. If Total Blocking Time (TBT) is high, users experience sluggish interactions. To improve TBT, break up long tasks and defer non-essential scripts.\n+- **Bounce Rate**: This is the percentage of visitors who leave without interacting. If your site has high bounce rates it might be because your page is too slow.\n+- **Unique Users**: This metric tracks how many individual visitors come to your site. To view the Bounce Rate and Unique Users, you can use Google Analytics. It will allow you to monitor these metrics and improve engagement.\n+\n+## Common Performance Measurement Tools\n+\n+- **Chrome DevTools**: Chrome DevTools is a built-in tool inside Google Chrome that lets you analyze and debug performance in real-time. DevTools will show loading times, CPU usage, and render delays. It's especially useful for measuring First Contentful Paint, or FCP, is how fast a user sees the first visible content. If your website feels slow, DevTools will help you spot the bottlenecks. \n+- **Lighthouse**: This is an automated tool that checks performance, SEO, and accessibility. \n+- **WebPageTest**: This tool lets you test how your site loads from different locations and devices. This tool gives you a detailed breakdown of your site's Speed Index, Total Blocking Time, and other key performance metrics. If you want to know how real users experience your site globally, WebPageTest is the tool for that.\n+- **PageSpeed Insights**: This tool analyzes your website and suggests quick improvements for both mobile and desktop. It will tell you what's slowing your site down and give specific recommendations like optimizing images, removing render-blocking scripts, and reducing server response times. PageSpeed Insights is a fast and easy way to check how Google sees your site's performance.\n+- **Real User Monitoring**: RUM tools track actual user behavior, showing how real visitors experience your site. Popular RUM tools include Google Analytics, which tracks page load times and bounce rates, and New Relic or Datadog, which monitor real-time performance issues. If you want data from actual users, RUM tools are essential.\n+\n+## Working with Performance Web APIs\n+\n+- **Definition**: Performance Web APIs let developers track how efficiently a webpage loads and responds directly in the code. These APIs allow you to measure page load times, track rendering and interaction delays and analyze JavaScript execution time.\n+- **`performance.now()`**: This API gives you high-precision timestamps (in milliseconds) to measure how long different parts of your site take to load.\n+\n+```js\n+const start = performance.now();  \n+// Run some code here  \n+const end = performance.now();  \n+\n+console.log(`Execution time: ${end - start}ms`);\n+```\n+\n+- **Performance Timing API**: This API gives you a breakdown of every stage of page loading, from DNS lookup to `DOMContentLoaded`.\n+\n+```js\n+const timing = performance.timing;  \n+\n+const pageLoadTime = timing.loadEventEnd - timing.navigationStart;  \n+console.log(`Page load time: ${pageLoadTime}ms`);\n+```\n+\n+- **`PerformanceObserver`**: This API listens for performance events such as layout shifts, long tasks, and user interactions.\n+\n+```js\n+const observer = new PerformanceObserver((list) => {  \n+  list.getEntries().forEach((entry) => {  \n+    console.log(`Long task detected: ${entry.duration}ms`);  \n+  });  \n+});  \n+\n+observer.observe({ type: \"longtask\", buffered: true });\n+```\n+\n+## Techniques for Improving CSS Performance\n+\n+- **CSS Animations**: Animating certain CSS properties, such as dimensions, position, and layout, triggers a process called \"reflow\", during which the browser recalculates the position and geometry of certain elements on the page. This requires a repaint, which is computationally expensive. Therefore, it's recommended to reduce the number of CSS animations as much as possible or at least give the user an option to toggle them on or off.\n+\n+## Techniques for Improving JavaScript Performance \n+\n+- **Code Splitting**: Splitting your JavaScript code into modules that perform critical and non-critical tasks is also helpful. This way, you'll be able to preload the critical ones as soon as possible and defer the non-critical ones to render the page as fast as possible.\n+- **DOM Manipulation**: Remember that DOM Manipulation refers to the process of dynamically changing the content of a page with JavaScript by interacting with the Document Object Model (DOM). Manipulating the DOM is computationally expensive. By reducing the amount of DOM manipulation in your JavaScript code will improve performance.\n+\n+## CSS Frameworks\n+\n+- **CSS frameworks**: CSS frameworks can speed up your workflow, create a uniform visual style across a website, make your design look consistent across multiple browsers, and keep your CSS code more organized.\n+- **Popular CSS frameworks**: Some of the popular CSS frameworks are Tailwind CSS, Bootstrap, Materialize, and Foundation.\n+- **Potential disadvantages**:\n+  - The CSS provided by the framework might conflict with your custom CSS.\n+  - Your website might look similar to other websites using the same framework.\n+  - Large frameworks might cause performance issues.\n+\n+## Two Types of CSS Frameworks\n+\n+- **Utility-first CSS frameworks**: These frameworks have small classes with specific purposes, like setting the margin, padding, or background color. You can assign these small classes directly to the HTML elements as needed. Tailwind CSS is categorized as a utility-first CSS framework.\n+\n+Here is an example of using Tailwind CSS to style a button.\n+\n+```html\n+<button class=\"bg-blue-500 text-white font-bold py-2 px-4 rounded-full hover:bg-blue-700\">\n+  Button\n+</button>\n+```\n+\n+- **Component-based CSS frameworks**: These frameworks have pre-built components with pre-defined styles that you can add to your website. The components are available in the official documentation of the CSS framework, and you can copy and paste them into your project. Bootstrap is categorized as a component-based CSS framework.\n+\n+Here is an example of using Bootstrap to create a list group. Instead of applying small classes to your HTML elements, you will add the entire component, including the HTML structure.\n+\n+```html\n+<div class=\"card\" style=\"width: 25rem;\">\n+  <ul class=\"list-group list-group-flush\">\n+    <li class=\"list-group-item\">HTML</li>\n+    <li class=\"list-group-item\">CSS</li>\n+    <li class=\"list-group-item\">JavaScript</li>\n+  </ul>\n+</div>\n+```\n+\n+## CSS Preprocessors\n+\n+- **CSS preprocessor**: A CSS preprocessor is a tool that extends standard CSS. It compiles the code with extended syntax into a native CSS file. It can be helpful for writing cleaner, reusable, less repetitive, and scalable CSS for complex projects.\n+- **Features**: Some of the features that can be provided by CSS preprocessors are variables, mixins, nesting, and selector inheritance.\n+- **Popular CSS preprocessors**: Some of the popular CSS preprocessors are Sass, Less, and Stylus.  \n+- **Potential disadvantages**:\n+  - Compiling the CSS rules into standard CSS might cause overhead.\n+  - The compiled code may be difficult to debug.\n+\n+## Sass\n+\n+- **Sass**: It is one of the most popular CSS preprocessors. Sass stands for \"Syntactically Awesome Style Sheets.\"\n+- **Features supported by Sass**: Sass supports features like variables, nested CSS rules, modules, mixins, inheritance, and operators for basic mathematical operations\n+\n+## Two Syntaxes Supported by Sass\n+\n+- **SCSS syntax**: The SCSS (Sassy CSS) expands the basic syntax of CSS. It is the most widely used syntax for Sass. SCSS files have an `.scss` extension.\n+\n+Here is an example of defining and using a variable in SCSS.\n+\n+```scss\n+$primary-color: #3498eb;\n+\n+header {\n+  background-color: $primary-color;\n+}\n+```\n+\n+- **Indented syntax**: The indented syntax was Sass's original syntax and is also known as the \"Sass syntax.\"\n+\n+Here is an example of defining and using a variable in the indented syntax.\n+\n+```sass\n+$primary-color: #3498eb\n+\n+header\n+  background-color: $primary-color\n+```\n+\n+### Mixins\n+\n+- **Mixins**: Mixins allow you to group multiple CSS properties and their values under the name and reuse that block of CSS code throughout your stylesheet.\n+\n+Here is an example of defining a mixin in SCSS syntax. In this case, the mixin is called `center-flex`. It has three CSS properties to center elements using flexbox.\n+\n+```scss\n+@mixin center-flex {\n+  display: flex;\n+  justify-content: center;\n+  align-items: center;\n+}\n+```\n+\n+Here is an example of using the mixin you defined.\n+\n+```scss\n+section {\n+  @include center-flex;\n+  height: 500px;\n+  background-color: #3289a8;\n+}\n+```\n+\n+## Manual and Automated Testing\n+\n+- **Manual Testing**: In manual testing, a tester will manually go through each part of the application and test out different features to make sure it works correctly. If any bugs are uncovered in the testing process, the tester will report those bugs back to the software team so they can be fixed.\n+- **Automated Testing**: In automated testing, you can automate your tests by writing a separate program that checks whether your application behaves as expected.\n+\n+## Unit Testing\n+\n+- **Unit Testing**: In unit testing, you test each function to ensure that everything is working as expected. Unit tests can also serve as a form of documentation for your application because they are meant to represent the expected behavior for your code.\n+- **Single Responsibility Principle**: The single responsibility principle recommends keeping each function small and responsible for one thing.\n+- **Common JavaScript Testing Frameworks**: Some common testing frameworks include Jest, Mocha, and Vitest. Jest is a popular testing framework for unit tests.\n+\n+Here is an example of unit tests using Jest.\n+\n+First, you can create a function that is responsible for returning a newly formatted string:\n+\n+```javascript\n+export function getFormattedWord(str) {\n+  if (!str) return '';\n+  return str.charAt(0).toUpperCase() + str.slice(1);\n+}\n+```\n+\n+In a separate `getFormattedWord.test.js` file, you can write some tests to verify that the function is working as expected. The `getFormattedWord.test.js` file will look like this:\n+\n+```javascript\n+import { getFormattedWord } from \"./getFormattedWord.js\";\n+import { test, expect } from \"jest\";\n+\n+test('capitalizes the first letter of a word', () => {\n+  expect(getFormattedWord('hello')).toBe('Hello');\n+});\n+```\n+\n+- **`expect` Function**: The `expect` function is used to test a value.\n+- **Matcher**: Matcher is a function that checks whether the value behaves as expected. In the above example, the matcher is `toBe()`. Jest has a variety of matchers.\n+\n+To use Jest, you first need to install the `jest` package by using `npm i jest`. You will also need to add a script to your `package.json` file like this:\n+\n+```js\n+\"scripts\": {\n+  \"test\": \"jest\"\n+},\n+```\n+\n+Then, you can run the command `npm run test` to run your tests.\n+\n+## Software Development Lifecycle\n+\n+- **Different Stages of Software Development Lifecycle**:\n+  - **Planning Stage**: The development team collects requirements for the proposed work from the stakeholders.\n+  - **Design Stage**: The software team breaks down the requirements and decides on the best approaches for solutions.\n+  - **Implementation Stage**: The software team breaks down the requirements into manageable tasks and implements them.\n+  - **Testing Stage**: This involves manual and automated testing for the new work. Sometimes, the team tests out the application throughout the entire development stage to catch and fix any issues that come up.\n+  - **Deployment Stage**: The team deploys the new changes to a build or testing environment.\n+  - **Maintenance Stage**: This involves fixing any issues that arise from customers in the production application.\n+\n+- **Different Models of the Software Development Lifecycle**:\n+  - **Waterfall Model**: The Waterfall model is where each phase of the lifecycle needs to be completed before the next phase can begin.\n+  - **Agile Model**: The Agile model focuses on iterative development by breaking down work into sprints.\n+\n+## BDD and TDD\n+\n+- **TDD**: Test-driven development is a methodology that emphasizes writing tests first. Writing tests before building out features provides real-time feedback to developers during the development process.\n+- **BDD**: Behavior-driven development is the approach of aligning a series of tests with business goals. The test scenarios in BDD should be written in a language that can be understood by both technical and non-technical individuals. An example of such syntax is Gherkin.\n+- **BDD Testing Frameworks**: Examples of BDD testing frameworks include Cucumber, JBehave, and SpecFlow.\n+\n+## Assertions in Unit Testing\n+\n+- **Assertion**: Assertions are used to test that the code is behaving as expected.\n+- **Assertion Libraries**: Chai is a commonly used assertion library. Other common JavaScript assertion libraries are `should.js` and `expect.js`.\n+\n+Here is an example of an assertion using Chai that checks that the return value from the `addThreeAndFour` function is equal to the number 7:\n+\n+```js\n+assert.equal(addThreeAndFour(), 7);\n+```\n+\n+- **Best Practices**: Regardless of which assertion library you use, you should write clear assert and failure messages that will help you understand which tests are failing and why.\n+\n+## Mocking, Faking, and Stubbing\n+\n+- **Mocking**: Mocking is the process of replacing real data with false data that simulates the behavior of real components. For example, you could mock the API response in testing instead of making continuous API calls to fetch the data.\n+- **Stubbing**: Stubs are objects that return pre-defined responses or dummy data for an expected behavior in an application. For example, you can stub the behavior for a database connection in your tests without having to rely on an actual database connection.\n+- **Faking**: Fakes are simplified versions of real components without the complexity or side effects. For example, you can fake a database by storing the data in memory instead of interacting with the real database. This will allow you to mimic database operations in memory, which will be much faster than dealing with the real database.\n+\n+## Functional Testing\n+\n+- **Functional Testing**: Functional testing checks if the features and functions of the application work as expected. The goal of functional testing is to test the system as a whole against multiple scenarios.\n+- **Non-Functional Testing**: Non-functional testing focuses on things like performance and reliability.\n+- **Smoke testing**: Smoke testing is a preliminary check on the system for basic or critical issues before beginning more extensive testing.\n+\n+## End-to-End Testing\n+\n+- **End-to-End Testing**: End-to-end testing, or E2E, tests real-world scenarios from the user's perspective. End-to-end tests help ensure that your application behaves correctly and is predictable for users. However, it is time-consuming to set up, design, and maintain.\n+- **End-to-End Testing Frameworks**: Playwright is a popular end-to-end testing framework developed by Microsoft. Other examples of end-to-end testing tools include Cypress, Selenium, and Puppeteer.\n+\n+Here is an example of E2E tests from the freeCodeCamp codebase using Playwright. The `beforeEach` hook will run before each of the tests. The tests check that the donor has a supporter link in the menu bar, as well as a special stylized border around their avatar:\n+\n+```js\n+test.beforeEach(async ({ page }) => {\n+  execSync(\"node ./tools/scripts/seed/seed-demo-user --set-true isDonating\");\n+  await page.goto(\"/donate\");\n+});\n+\n+...\n+\n+test(\"The menu should have a supporters link\", async ({ page }) => {\n+  const menuButton = page.getByTestId(\"header-menu-button\");\n+  const menu = page.getByTestId(\"header-menu\");\n+\n+  await expect(menuButton).toBeVisible();\n+  await menuButton.click();\n+\n+  await expect(menu).toBeVisible();\n+\n+  await expect(page.getByRole(\"link\", { name: \"Supporters\" })).toBeVisible();\n+});\n+\n+test(\"The Avatar should have a special border for donors\", async ({ page }) => {\n+  const container = page.locator(\".avatar-container\");\n+  await expect(container).toHaveClass(\"avatar-container gold-border\");\n+});\n+```\n+\n+## Usability Testing\n+\n+- **Usability Testing**: Usability testing is when you have real users interacting with the application to discover if there are any design, user experience, or functionality issues in the app. Usability testing focuses on the intuitiveness of the application by users.\n+- **Four Common Types of Usability Testing**:\n+  - **Explorative**: Explorative usability testing involves users interacting with the different features of the application to better understand how they work.\n+  - **Comparative**: Comparative testing is where you compare your application's user experience with similar applications in the marketplace.\n+  - **Assessment**: Assessment testing is where you study how intuitive the application is to use.\n+  - **Validation**: Validation testing is where you identify any major issues that will prevent the user from using the application effectively.\n+- **Usability Testing Tools**: Examples of tools for usability testing include Loop11, Maze, Userbrain, UserTesting, and UXTweak.\n+\n+## Compatibility Testing\n+\n+- **Compatibility Testing**: The goal of compatibility testing is to ensure that your application works in different computing environments.\n+- **Different Types of Compatibility Testing**:\n+  - **Backwards Compatibility**: Backwards compatibility refers to when the software is compatible with earlier versions.\n+  - **Forwards Compatibility**: Forwards compatibility refers to when the software and systems will work with future versions.\n+  - **Hardware Compatibility**: Hardware compatibility is the software's ability to work properly in different hardware configurations.\n+  - **Operating Systems Compatibility**: Operating systems compatibility is the software's ability to work on different operating systems, such as macOS, Windows, and Linux distributions like Ubuntu and Fedora.\n+  - **Network Compatibility**: Network compatibility means the software can work in different network conditions, such as different network speeds, protocols, security settings, etc.\n+  - **Browser Compatibility**: Browser compatibility means the web application can work consistently across different browsers, such as Google Chrome, Safari, Firefox, etc.\n+  - **Mobile Compatibility**: It is important to ensure that your software applications work on a variety of Android and iOS devices, including phones and tablets.\n+\n+## Performance Testing\n+\n+- **Performance Testing**: In performance testing, you test an application's speed, responsiveness, scalability, and stability under different workloads. The goal is to resolve any type of performance bottleneck.\n+- **Different Types of Performance Testing**:\n+  - **Load Testing**: Load testing determines how a system behaves during normal and peak load times.\n+  - **Stress Testing**: Stress testing is where you test your application in extreme loads and see how well your system responds to the higher load.\n+  - **Soak Testing (Endurance Testing)**: Soak testing or endurance testing is a type of load testing where you test the system with a higher load for an extended period of time.\n+  - **Spike Testing**: Spike testing is where you dramatically increase and decrease the loads and analyze the system's reactions to the changes.\n+  - **Breakpoint Testing (Capacity Testing)**: Breakpoint testing or capacity testing is where you slowly increment the load over time to the point where the system starts to fail or degrade.\n+\n+## Security Testing\n+\n+- **Security Testing**: Security testing helps identify vulnerabilities and weaknesses.\n+- **Security Principles**:\n+  - **Confidentiality**: This protects against the release of sensitive information to other recipients that aren't the intended recipient.\n+  - **Integrity**: This involves preventing malicious users from modifying user information.\n+  - **Authentication**: This involves verifying the user's identity to ensure that they are allowed to use that system.\n+  - **Authorization**: This is the process of determining what actions authenticated users are allowed to perform or which parts of the system they are permitted to access.\n+  - **Availability**: This ensures that information and services are available to authorized users when they need it.\n+  - **Non-Repudiation**: This ensures that both the sender and recipient have proof of delivery and verification of the sender's identity. It protects against the sender denying having sent the information.\n+- **Common Security Threats**:\n+  - **Cross-Site Scripting (XSS)**: XSS attacks happen when an attacker injects malicious scripts into a web page and then executes them in the context of the victim's browser.\n+  - **SQL Injection**: SQL injection allows malicious users to inject malicious code into a database.\n+  - **Denial-of-Service (DoS) Attack**: DoS attack is when malicious users flood a website with a high number of requests or traffic, causing the server to slow down and possibly crash, making the site unavailable to users. \n+- **Categories of Security Testing Tools**:\n+  - **Static Application Security Testing**: These tools evaluate the source code for an application to identify security vulnerabilities.\n+  - **Dynamic Application Security Testing**: These tools interface with the application's frontend to uncover potential security weaknesses. DAST tools do not have access to the source code.\n+- **Penetration Testing (pentest)**: Penetration testing is a type of security testing that involves creating simulated cyberattacks on the application to identify any vulnerabilities in the system.\n+\n+## A/B Testing\n+\n+- **A/B Testing**: A/B testing involves comparing two versions of a page or application and studying which version performs better. It is also known as bucket or split testing. A/B testing allows you to make more data-driven decisions and continually improve the user experience.\n+- **Tools for A/B Testing**: Examples of tools to use for A/B testing include GrowthBook and LaunchDarkly.\n+\n+## Alpha and Beta Testing\n+\n+Once the initial development and software testing are complete, it is important to have the application tested by testers and real users. This is where alpha and beta testing come in.\n+\n+- **Alpha Testing**: Alpha testing is done by a select group of testers who go through the application to ensure there are no bugs before it is released into the marketplace. Alpha testing is part of acceptance testing and utilizes both white and black box testing techniques.\n+- **Beta Testing**: Beta testing is where the application is made available to real users. Users can interact with the application and provide feedback. Beta testing is also a form of user acceptance testing.\n+- **Acceptance Testing**: Acceptance testing ensures that the software application meets the business requirements and the needs of users before its release.\n+- **Black Box Testing**: Black box testing only focuses on the expected behavior of the application.\n+- **White Box Testing**: White box testing involves the tester knowing the internal components and performing tests on them.\n+\n+## Regression Testing\n+\n+- **Regression**: Regression refers to situations where new changes unintentionally break existing functionality.\n+- **Regression Testing**: Regression testing helps catch regression issues. In regression testing, you re-run functional tests against parts of your application to ensure that everything still works as expected.\n+- **Tools for Regression Testing**: Tools that you can use to perform regression testing include Puppeteer, Playwright, Selenium, and Cypress.\n+- **Techniques for Regression Testing**: \n+  - **Unit Regression Testing**: This is where you have a list of items that need to be tested each time major changes or fixes are implemented into the app.\n+  - **Partial Regression Testing**: This involves targeted approaches to ensure that new changes have not broken specific aspects of the application.\n+  - **Complete Regression Testing**: This runs tests against all the functionalities in the codebase. This is the most time-consuming and detailed option.\n+- **Retesting**: Retesting is used to check for known issues and ensure that they have been resolved. In contrast, regression testing searches for unknown issues that might have occurred through recent changes in the codebase.\n+\n+## What is TypeScript\n+\n+- **JavaScript**: JavaScript is a dynamically-typed language. This means that variables can receive any values at run time. The challenge of a dynamically-typed language is that the lack of type safety can introduce errors.\n+\n+For example, even if your JavaScript function expects an array, you can still call it with a number:\n+\n+```javascript\n+const getRandomValue = (array) => {\n+  return array[Math.floor(Math.random() * array.length)];\n+}\n+\n+console.log(getRandomValue(10));\n+```\n+\n+The `console` output for the example above will be `undefined`.\n+\n+- **TypeScript**: TypeScript extends the JavaScript language to include static typing, which helps catch errors caused by type mismatches before you run your code.\n+\n+For example, you can define a type for the `array` parameter as follows:\n+\n+```typescript\n+const getRandomValue = (array: string[]) => {\n+  return array[Math.floor(Math.random() * array.length)];\n+}\n+```\n+\n+This type definition tells TypeScript that the `array` parameter must be an array of strings. Then, when you call `getRandomValue` and pass it a number, you get an error called a compiler error.\n+\n+- **Compiler**: You first need to compile TypeScript code into regular JavaScript. When you run the compiler, TypeScript will evaluate your code and throw an error for any issues where the types don't match.\n+\n+## Data Types in TypeScript\n+\n+- **Primitive Data Types in TypeScript**: For the primitive data types `string`, `null`, `undefined`, `number`, `boolean`, and `bigint`, TypeScript offers corresponding type keywords.\n+\n+```typescript\n+let str: string = \"Naomi\";\n+let num: number = 42;\n+let bool: boolean = true;\n+let nope: null = null;\n+let nada: undefined = undefined;\n+```\n+\n+- **Array**: You can define an array of specific type with two different syntaxes.\n+\n+```typescript\n+const arrOne: string[] = [\"Naomi\"];\n+const arrTwo: Array<string> = [\"Camperchan\"];\n+```\n+\n+- **Objects**: You can define the exact structure of an object.\n+\n+```typescript\n+const obj: { a: string, b: number } = { a: \"Naomi\", b: 42 };\n+```\n+\n+If you want an object with any keys, but where all values must be strings, there are two ways to define it:\n+\n+```typescript\n+const objOne: Record<string, string> = {};\n+const objTwo: { [key: string]: string } = {};\n+```\n+\n+- **Other Helpful Types in TypeScript**:\n+  - **`any`**: `any` indicates that a value can have any type. It tells the compiler to stop caring about the type of that variable.\n+  - **`unknown`**: `unknown` tells TypeScript that you _do_ care about the type of the value, but you don’t actually know what it is. `unknown` is generally preferred over `any`.\n+  - **`void`**: This is a special type that you’ll typically only use when defining functions. Functions that don’t have a return value use a return type of `void`.\n+  - **`never`**: It represents a type that will never exist.\n+\n+- **`type` Keyword**: This keyword is like `const`, but instead of declaring a variable, you can declare a type.\n+\n+It is useful for declaring custom types such as union types or types that include only specific values:\n+\n+```typescript\n+type stringOrNumber = string | number;\n+type bot = \"camperchan\" | \"camperbot\" | \"naomi\";\n+```\n+\n+- **`interface`**: Interfaces are like classes for types. They can implement or extend other interfaces, are specifically object types, and are generally preferred unless you need a specific feature offered by a `type` declaration.\n+\n+```typescript\n+interface wowie {\n+  zowie: boolean;\n+  method: () => void;\n+}\n+```\n+\n+- **Defining Return Type**: You can also define the _return type_ of the function. \n+\n+The example below defines the return value as a string. If you try to return anything else, TypeScript will give a compiler error.\n+\n+```typescript\n+const getRandomValue = (array: string[]): string => {\n+  return array[Math.floor(Math.random() * array.length)];\n+}\n+```\n+\n+## Generics\n+\n+- **Defining Generic Type**: You can define a generic type and refer to it in your function. It can be thought of as a special parameter you provide to a function to control the behavior of the function's type definition.\n+\n+Here is an example of defining a generic type for a function:\n+\n+```typescript\n+const getRandomValue = <T>(array: T[]): T => {\n+  return array[Math.floor(Math.random() * array.length)];\n+}\n+const val = getRandomValue([1, 2, 4])\n+```\n+\n+The `<T>` syntax tells TypeScript that you are defining a generic type `T` for the function. `T` is a common name for generic types, but you can use any name.\n+\n+Then, you tell TypeScript that the `array` parameter is an array of values matching the generic type, and that the returned value is a single element of that same type.\n+\n+- **Specifying Type Argument in Function Call**: You can pass a type argument to a function call using angle brackets between the function name and its parameters.\n+\n+Here is an example of passing a type argument to a function call:\n+\n+```typescript\n+const email = document.querySelector<HTMLInputElement>(\"#email\");\n+console.log(email.value);\n+```\n+\n+This tells TypeScript that the element you expect to find will be an input element.\n+\n+## Type Narrowing\n+\n+- **Narrowing by Truthiness**: In the example below, you get a compiler error trying to access the `value` property of `email` because `email` _might_ be `null`.\n+\n+```typescript\n+const email = document.querySelector<HTMLInputElement>(\"#email\");\n+console.log(email.value);\n+```\n+\n+You can use a conditional statement to confirm `email` is _truthy_ before accessing the property:\n+\n+```typescript\n+const email = document.querySelector<HTMLInputElement>(\"#email\");\n+if (email) {\n+  console.log(email.value);\n+}\n+```\n+\n+Truthiness checks can also work in the reverse direction:\n+\n+```typescript\n+const email = document.querySelector<HTMLInputElement>(\"#email\");\n+if (!email) {\n+  throw new ReferenceError(\"Could not find email element!\")\n+}\n+console.log(email.value);\n+```\n+\n+Throwing an error ends the logical execution of this code, which means when you reach the `console.log()` call, TypeScript knows `email` _cannot_ be `null`.\n+\n+- **Optional Chaining**: Optional chaining `?.` is also a form of type narrowing, under the same premise that the property access can't happen if the `email` value is `null`.\n+\n+```typescript\n+const email = document.querySelector<HTMLInputElement>(\"#email\");\n+console.log(email?.value);\n+```\n+\n+- **`typeof` Operator**: You can use a conditional to check the type of the variable using the `typeof` operator.\n+\n+```typescript\n+const myVal = Math.random() > 0.5 ? 222 : \"222\";\n+if (typeof myVal === \"number\") {\n+  console.log(myVal / 10);\n+}\n+```\n+\n+- **`instanceof` Keyword**: If the object comes from a class, you can use the `instanceof` keyword to narrow the type.\n+\n+```typescript\n+const email = document.querySelector(\"#email\");\n+\n+if (email instanceof HTMLInputElement) {\n+    console.log(email.value);\n+}\n+```\n+\n+- **Casting**: When TypeScript cannot automatically determine the type of a value, such as the result from `request.json()` method in the example below, you'll get a compiler error. One way to resolve this is by casting the type, but doing so weakens TypeScript's ability to catch potential errors.\n+\n+```typescript\n+interface User {\n+    name: string;\n+    age: number;\n+}\n+\n+const printAge = (user: User) => \n+  console.log(`${user.name} is ${user.age} years old!`)\n+\n+const request = await fetch(\"url\")\n+const myUser = await request.json() as User;\n+printAge(myUser);\n+```\n+\n+- **Type Guard**: Instead of casting the type, you can write a type guard:\n+\n+```typescript\n+interface User {\n+    name: string;\n+    age: number;\n+}\n+\n+const isValidUser = (user: unknown): user is User => {\n+  return !!user && \n+    typeof user === \"object\" &&\n+    \"name\" in user &&\n+    \"age\" in user;\n+}\n+```\n+\n+The `user is User` syntax indicates that your function returns a boolean value, which when true means the `user` value satisfies the `User` interface.\n+\n+## `tsconfig` File\n+\n+- **`tsconfig.json`**: TypeScript's compiler settings live in a `tsconfig.json` file in the root directory of your project.\n+\n+```json\n+{\n+  \"compilerOptions\": {\n+    \"rootDir\": \"./src\",\n+    \"outDir\": \"./prod\",\n+    \"lib\": [\"ES2023\"],\n+    \"target\": \"ES2023\",\n+    \"module\": \"ES2022\",\n+    \"moduleResolution\": \"Node\",\n+    \"esModuleInterop\": true,\n+    \"skipLibCheck\": true,\n+    \"strict\": true\n+  },\n+  \"exclude\": [\"test/\"]\n+}\n+```\n+\n+Here are descriptions of the compiler options used in the example above:\n+\n+- **`compilerOptions`**: The `compilerOptions` property is where you control how the TypeScript compiler behaves.\n+- **`rootDir` and `outDir`**: The `rootDir` and `outDir` tell TypeScript which directory holds your source files, and which directory should contain the transpiled JavaScript code.\n+- **`lib`**: The `lib` property determines which type definitions the compiler uses, and allows you to include support for specific ES releases, the DOM, and more.\n+- **`module` and `moduleResolution`**: The `module` and `moduleResolution` work in tandem to manage how your package uses modules - either CommonJS or ECMAScript.\n+- **`esModuleInterop`**: The `esModuleInterop` allows for smoother interoperability between CommonJS and ES modules by automatically creating namespace objects for imports.\n+- **`skipLibCheck`**: The `skipLibCheck` option skips validating `.d.ts` files that aren't referenced by imports in your code.\n+- **`strict`**: The `strict` flag enables several checks, such as ensuring proper handling of nullable types and warning when TypeScript falls back to `any`.\n+- **`exclude`**: The top-level `exclude` property tells the compiler to ignore these TypeScript files during compilation.\n+\n \n # --assignment--\n "
        },
        {
            "sha": "b7630e02646975a44957e9dade4d229c20a25ca9",
            "filename": "curriculum/challenges/english/25-front-end-development/review-react-forms-data-fetching-and-routing/67c9e932c6c4234532d46394.md",
            "status": "modified",
            "additions": 78,
            "deletions": 0,
            "changes": 78,
            "blob_url": "https://github.com/freeCodeCamp/freeCodeCamp/blob/fa1577e8327106c8f90683701e19601e7a3146ce/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-react-forms-data-fetching-and-routing%2F67c9e932c6c4234532d46394.md",
            "raw_url": "https://github.com/freeCodeCamp/freeCodeCamp/raw/fa1577e8327106c8f90683701e19601e7a3146ce/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-react-forms-data-fetching-and-routing%2F67c9e932c6c4234532d46394.md",
            "contents_url": "https://api.github.com/repos/freeCodeCamp/freeCodeCamp/contents/curriculum%2Fchallenges%2Fenglish%2F25-front-end-development%2Freview-react-forms-data-fetching-and-routing%2F67c9e932c6c4234532d46394.md?ref=fa1577e8327106c8f90683701e19601e7a3146ce",
            "patch": "@@ -65,6 +65,34 @@ function App() {\n export default App;\n ```\n \n+## Working with the `useActionState` Hook\n+\n+- **Server Actions**: These are functions that run on the server to allow form handling right on the server without the need for API endpoints. Here is an example from a Next.js application:\n+\n+```js\n+\"use server\";\n+\n+async function submitForm(formData) {\n+ const name = formData.get(\"name\");\n+ return { message: `Hello, ${name}!` };\n+}\n+```\n+\n+The `\"user server\"` directive marks the function as a server action.\n+\n+- **`useActionState` Hook**: This hook updates state based on the outcome of a form submission. Here's the basic syntax of the `useActionState` hook:\n+\n+```js\n+const [state, action, isPending] = useActionState(actionFunction, initialState, permalink);\n+```\n+\n+- `state` is the current state the action returns.\n+- `action` is the function that triggers the server action.\n+- `isPending` is a boolean that indicates whether the action is currently running or not.\n+- `actionFunction` parameter is the server action itself.\n+- `initialState` is the parameter that represents the starting point for the state before the action runs.\n+- `permalink` is an optional string that contains the unique page URL the form modifies.\n+\n ## Data Fetching in React\n \n - **Options For Fetching Data**: There are many different ways to fetch data in React. You can use the native `Fetch` API, or third party tools like Axios or SWR. \n@@ -201,6 +229,56 @@ const FetchTodos = () => {\n export default FetchTodos;\n ```\n \n+## Working with the `useOptimistic` Hook\n+\n+- **`useOptimistic` Hook**: This hook is used to keep UIs responsive while waiting for an async action to complete in the background. It helps manage \"optimistic updates\" in the UI, a strategy in which you provide immediate updates to the UI based on the expected outcome of an action, like waiting for a server response.\n+\n+Here is the basic syntax:\n+\n+```js\n+const [optimisticState, addOptimistic] = useOptimistic(actualState, updateFunction);\n+```\n+\n+- `optimisticState` is the temporary state that updates right away for a better user experience.\n+- `addOptimistic` is the function that applies the optimistic update before the actual state changes.\n+- `actualState` is the real state value that comes from the result of an action, like fetching data from a server.\n+- `updateFunction` is the function that determines how the optimistic state should update when called.\n+\n+Here is an example of using the `useOptimistic` hook in a `TaskList` component:\n+\n+```js\n+\"use client\";\n+\n+import { useOptimistic } from \"react\";\n+\n+export default function TaskList({ tasks, addTask }) {\n+  const [optimisticTasks, addOptimisticTask] = useOptimistic(\n+    tasks,\n+    (state, newTask) => [...state, { text: newTask, pending: true }]\n+  );\n+\n+  async function handleSubmit(e) {\n+    e.preventDefault();\n+    const formData = new FormData(e.target);\n+\n+    addOptimisticTask(formData.get(\"task\"));\n+\n+    addTask(formData);\n+    e.target.reset();\n+  }\n+\n+  return <>{/* UI */}</>;\n+}\n+```\n+\n+- **`startTransition`**: This is used to render part of the UI and mark a state update as a non-urgent transition. This allows the UI to be responsive during expensive updates. Here is the basic syntax:\n+\n+```js\n+startTransition(action)\n+```\n+\n+The `action` performs a state update or triggers some transition-related logic. This ensures that urgent UI updates (like typing or clicking) are not blocked.\n+\n ## Working with the `useMemo` Hook\n \n - **Memoization**: This is an optimization technique in which the result of expensive function calls are cached (remembered) based on specific arguments. When the same arguments are provided again, the cached result is returned instead of re-computing the function."
        }
    ],
    "stats": {
        "total": 1729,
        "additions": 1728,
        "deletions": 1
    }
}