{
    "author": "Rocketknight1",
    "message": "Update Jinja docs with new functions and general cleanup (#33097)",
    "sha": "0a7af19f4dc868bafc82f35eb7e8d13bac87a594",
    "files": [
        {
            "sha": "ac12b3c640ab1033d109b410b410ede0af37af92",
            "filename": "docs/source/en/chat_templating.md",
            "status": "modified",
            "additions": 34,
            "deletions": 36,
            "changes": 70,
            "blob_url": "https://github.com/huggingface/transformers/blob/0a7af19f4dc868bafc82f35eb7e8d13bac87a594/docs%2Fsource%2Fen%2Fchat_templating.md",
            "raw_url": "https://github.com/huggingface/transformers/raw/0a7af19f4dc868bafc82f35eb7e8d13bac87a594/docs%2Fsource%2Fen%2Fchat_templating.md",
            "contents_url": "https://api.github.com/repos/huggingface/transformers/contents/docs%2Fsource%2Fen%2Fchat_templating.md?ref=0a7af19f4dc868bafc82f35eb7e8d13bac87a594",
            "patch": "@@ -785,14 +785,23 @@ it's time to put an end to them!\n \n ## Advanced: Template writing tips\n \n-If you're unfamiliar with Jinja, we generally find that the easiest way to write a chat template is to first\n-write a short Python script that formats messages the way you want, and then convert that script into a template.\n+<Tip>\n+\n+The easiest way to get started with writing Jinja templates is to take a look at some existing ones. You can use\n+`print(tokenizer.chat_template)` for any chat model to see what template it's using. In general, models that support tool use have \n+much more complex templates than other models - so when you're just getting started, they're probably a bad example\n+to learn from! You can also take a look at the \n+[Jinja documentation](https://jinja.palletsprojects.com/en/3.1.x/templates/#synopsis) for details\n+of general Jinja formatting and syntax.\n \n-Remember that the template handler will receive the conversation history as a variable called `messages`.  \n+</Tip>\n+\n+Jinja templates in `transformers` are identical to Jinja templates elsewhere. The main thing to know is that \n+the conversation history will be accessible inside your template as a variable called `messages`.  \n You will be able to access `messages` in your template just like you can in Python, which means you can loop over \n it with `{% for message in messages %}` or access individual messages with `{{ messages[0] }}`, for example.\n \n-You can also use the following tips to convert your code to Jinja:\n+You can also use the following tips to write clean, efficient Jinja templates:\n \n ### Trimming whitespace\n \n@@ -817,46 +826,35 @@ rather than like this:\n Adding `-` will strip any whitespace that comes before the block. The second example looks innocent, but the newline\n and indentation may end up being included in the output, which is probably not what you want!\n \n-### For loops\n-\n-For loops in Jinja look like this:\n-\n-```\n-{%- for message in messages %}\n-    {{- message['content'] }}\n-{%- endfor %}\n-```\n+### Special variables\n \n-Note that whatever's inside the {{ expression block }} will be printed to the output. You can use operators like\n-`+` to combine strings inside expression blocks.\n+Inside your template, you will have access several special variables. The most important of these is `messages`, \n+which contains the chat history as a list of message dicts. However, there are several others. Not every\n+variable will be used in every template. The most common other variables are:\n \n-### If statements\n+- `tools` contains a list of tools in JSON schema format. Will be `None` or undefined if no tools are passed.\n+- `documents` contains a list of documents in the format `{\"title\": \"Title\", \"contents\": \"Contents\"}`, used for retrieval-augmented generation. Will be `None` or undefined if no documents are passed.\n+- `add_generation_prompt` is a bool that is `True` if the user has requested a generation prompt, and `False` otherwise. If this is set, your template should add the header for an assistant message to the end of the conversation. If your model doesn't have a specific header for assistant messages, you can ignore this flag.\n+- **Special tokens** like `bos_token` and `eos_token`. These are extracted from `tokenizer.special_tokens_map`. The exact tokens available inside each template will differ depending on the parent tokenizer.\n \n-If statements in Jinja look like this:\n+<Tip>\n \n-```\n-{%- if message['role'] == 'user' %}\n-    {{- message['content'] }}\n-{%- endif %}\n-```\n+You can actually pass any `kwarg` to `apply_chat_template`, and it will be accessible inside the template as a variable. In general,\n+we recommend trying to stick to the core variables above, as it will make your model harder to use if users have\n+to write custom code to pass model-specific `kwargs`. However, we're aware that this field moves quickly, so if you\n+have a new use-case that doesn't fit in the core API, feel free to use a new `kwarg` for it! If a new `kwarg`\n+becomes common we may promote it into the core API and create a standard, documented format for it.\n \n-Note how where Python uses whitespace to mark the beginnings and ends of `for` and `if` blocks, Jinja requires you\n-to explicitly end them with `{% endfor %}` and `{% endif %}`.\n+</Tip>\n \n-### Special variables\n+### Callable functions\n \n-Inside your template, you will have access to the list of `messages`, but you can also access several other special\n-variables. These include special tokens like `bos_token` and `eos_token`, as well as the `add_generation_prompt`\n-variable that we discussed above. You can also use the `loop` variable to access information about the current loop\n-iteration, for example  using `{% if loop.last %}` to check if the current message is the last message in the \n-conversation. Here's an example that puts these ideas together to add a generation prompt at the end of the\n-conversation if add_generation_prompt is `True`:\n+There is also a short list of callable functions available to you inside your templates. These are:\n \n-```\n-{%- if loop.last and add_generation_prompt %}\n-    {{- bos_token + 'Assistant:\\n' }}\n-{%- endif %}\n-```\n+- `raise_exception(msg)`: Raises a `TemplateException`. This is useful for debugging, and for telling users when they're\n+doing something that your template doesn't support.\n+- `strftime_now(format_str)`: Equivalent to `datetime.now().strftime(format_str)` in Python. This is used for getting\n+the current date/time in a specific format, which is sometimes included in system messages.\n \n ### Compatibility with non-Python Jinja\n "
        }
    ],
    "stats": {
        "total": 70,
        "additions": 34,
        "deletions": 36
    }
}