{
    "author": "LysandreJik",
    "message": "Model addition timeline (#33762)\n\n* Model addition timeline\r\n\r\n* Link guide\r\n\r\n* Update docs/source/en/add_new_model.md\r\n\r\nCo-authored-by: Arthur <48595927+ArthurZucker@users.noreply.github.com>\r\n\r\n* Update docs/source/en/add_new_model.md\r\n\r\nCo-authored-by: Arthur <48595927+ArthurZucker@users.noreply.github.com>\r\n\r\n* Review comments\r\n\r\n* Add contact email\r\n\r\n---------\r\n\r\nCo-authored-by: Arthur <48595927+ArthurZucker@users.noreply.github.com>",
    "sha": "4973fc5769b4d80fe56293a6212f479b3dd3f8c4",
    "files": [
        {
            "sha": "9aab36bb6fbecb17064e52b362ad7bcc2275ee72",
            "filename": "docs/source/en/add_new_model.md",
            "status": "modified",
            "additions": 69,
            "deletions": 0,
            "changes": 69,
            "blob_url": "https://github.com/huggingface/transformers/blob/4973fc5769b4d80fe56293a6212f479b3dd3f8c4/docs%2Fsource%2Fen%2Fadd_new_model.md",
            "raw_url": "https://github.com/huggingface/transformers/raw/4973fc5769b4d80fe56293a6212f479b3dd3f8c4/docs%2Fsource%2Fen%2Fadd_new_model.md",
            "contents_url": "https://api.github.com/repos/huggingface/transformers/contents/docs%2Fsource%2Fen%2Fadd_new_model.md?ref=4973fc5769b4d80fe56293a6212f479b3dd3f8c4",
            "patch": "@@ -889,3 +889,72 @@ used by hundreds and possibly even thousands of developers and researchers. You\n your achievements with the community.\n \n **You have made another model that is super easy to access for everyone in the community! 🤯**\n+\n+## Model additions and their timeline: when is a model added to transformers?\n+\n+We aim for `transformers` to have support for new model architectures and checkpoints as early as possible:\n+availability can range from day-0 (and hour-0) releases for some models, to a few days/weeks for others.\n+\n+The availability of this is usually up to the model contributors, as well as how excited the community is for the\n+architecture.\n+\n+We can split the model architecture possibilities in four sections:\n+- Day-0 integration\n+- Same-week integration\n+- Post-release integration\n+- Hub-first release\n+\n+Let's dive into each of these and see how we (the transformers team) can help you contribute your architecture and get\n+your architecture to be very easily used by all members of the community.\n+\n+### Day-0 integration\n+\n+For a day-0 integration to work, we'll usually want to work hand-in-hand with you directly. In order to keep your\n+architecture private until your checkpoints and release are ready, we'll work together in a private fork of\n+transformers.\n+\n+If you plan on having a transformers-first release, this is a great option: we run CI ahead of time, ensure the\n+documentation is clear, and we aim to optimize your model as much as possible (providing quantization, optimizing it\n+with Flash-Attention/SDPA, optimizing the KV cache, etc). \n+\n+We can also lend you a hand in adding the model, reviewing it early, and help you make sure the `transformers` \n+API works as expected!\n+\n+If this is the path you wish to go with, we ask for you to reach out in advance, especially if the architecture is \n+particularly novel (at least a few days, but a few weeks will enable the absolute best integration). In order to reach\n+out, please contact transformers@huggingface.co 🤗.\n+\n+### Same-week integration\n+\n+A same-week integration usually happens when model authors do not reach out; but we see significant community\n+requests.\n+\n+In order to specify you'd like for us to integrate a specific model, we'll redirect you to our\n+[issue tracker](https://github.com/huggingface/transformers/issues/new?assignees=&labels=New+model&projects=&template=new-model-addition.yml)\n+where you can request a specific model.\n+\n+The more activity on the issue, the faster/more likely we are to integrate the model!\n+\n+### Post-release integration\n+\n+A post-release integration usually happens when there has not been sufficient activity/requests to warrant a same-week\n+integration, or that we lack the sufficient bandwidth to integrate it.\n+\n+We very gladly welcome community contributions in those instances; more than half of the library was contributed\n+by contributors external to Hugging Face. If this is something that is interesting to you, we recommend that you look\n+at our [open issues tagged with \"New model\"](https://github.com/huggingface/transformers/issues?q=is%3Aopen+is%3Aissue+label%3A%22New+model%22).\n+\n+We recommend you try your hand at a heavily requested model as this will multiply the impact of your contribution.\n+We'll be there to help you in case that's your first contribution 🤗.\n+\n+### Code-on-Hub release\n+\n+Finally, transformers has a \"remote-code\" possibility, in which contributions are not made within the toolkit, but on\n+the Hub. This can be particularly interesting for groups that are using `transformers` as a backbone for their project,\n+but don't have the bandwidth to contribute the model to transformers directly.\n+\n+In case the model is very successful, then we'll very likely end up integrating it in `transformers` at the end - as this\n+provides better documentation, CI, maintenance, and optimizations - but this remains a great way to make your model\n+accessible day-0 with minimal friction.\n+\n+This guide is a great starting point for a Hub-first release: [Custom models](./custom_models)\n\\ No newline at end of file"
        }
    ],
    "stats": {
        "total": 69,
        "additions": 69,
        "deletions": 0
    }
}