{
    "author": "leerob",
    "message": "docs: clarify middleware use cases (#77438)",
    "sha": "3468f10cbbe6464c7516b2d15205f13788144b3d",
    "files": [
        {
            "sha": "ca5859c3bd7e30838a711392e19c92d4a4e243d1",
            "filename": "docs/01-app/03-building-your-application/01-routing/14-middleware.mdx",
            "status": "modified",
            "additions": 7,
            "deletions": 12,
            "changes": 19,
            "blob_url": "https://github.com/vercel/next.js/blob/3468f10cbbe6464c7516b2d15205f13788144b3d/docs%2F01-app%2F03-building-your-application%2F01-routing%2F14-middleware.mdx",
            "raw_url": "https://github.com/vercel/next.js/raw/3468f10cbbe6464c7516b2d15205f13788144b3d/docs%2F01-app%2F03-building-your-application%2F01-routing%2F14-middleware.mdx",
            "contents_url": "https://api.github.com/repos/vercel/next.js/contents/docs%2F01-app%2F03-building-your-application%2F01-routing%2F14-middleware.mdx?ref=3468f10cbbe6464c7516b2d15205f13788144b3d",
            "patch": "@@ -11,21 +11,16 @@ Middleware runs before cached content and routes are matched. See [Matching Path\n \n ## Use Cases\n \n-Integrating Middleware into your application can lead to significant improvements in performance, security, and user experience. Some common scenarios where Middleware is particularly effective include:\n+Some common scenarios where Middleware is effective include:\n \n-- Authentication and Authorization: Ensure user identity and check session cookies before granting access to specific pages or API routes.\n-- Server-Side Redirects: Redirect users at the server level based on certain conditions (e.g., locale, user role).\n-- Path Rewriting: Support A/B testing, feature rollouts, or legacy paths by dynamically rewriting paths to API routes or pages based on request properties.\n-- Bot Detection: Protect your resources by detecting and blocking bot traffic.\n-- Logging and Analytics: Capture and analyze request data for insights before processing by the page or API.\n-- Feature Flagging: Enable or disable features dynamically for seamless feature rollouts or testing.\n+- Quick redirects after reading parts of the incoming request\n+- Rewriting to different pages based on A/B tests or experiments\n+- Modifying headers for all pages or a subet of pages\n \n-Recognizing situations where middleware may not be the optimal approach is just as crucial. Here are some scenarios to be mindful of:\n+Middleware is _not_ a good fit for:\n \n-- Complex Data Fetching and Manipulation: Middleware is not designed for direct data fetching or manipulation, this should be done within Route Handlers or server-side utilities instead.\n-- Heavy Computational Tasks: Middleware should be lightweight and respond quickly or it can cause delays in page load. Heavy computational tasks or long-running processes should be done within dedicated Route Handlers.\n-- Extensive Session Management: While Middleware can manage basic session tasks, extensive session management should be managed by dedicated authentication services or within Route Handlers.\n-- Direct Database Operations: Performing direct database operations within Middleware is not recommended. Database interactions should be done within Route Handlers or server-side utilities.\n+- Slow data fetching\n+- Session management\n \n ## Convention\n "
        }
    ],
    "stats": {
        "total": 19,
        "additions": 7,
        "deletions": 12
    }
}