{
    "author": "spookylukey",
    "message": "Rewrote security.txt SSL docs, noting SECURE_PROXY_SSL_HEADER.",
    "sha": "0199bdc0b411d4aba0173053417bbeea8224b26b",
    "files": [
        {
            "sha": "151853d4ac5a695ce1cf8678112bde459600bc20",
            "filename": "docs/topics/security.txt",
            "status": "modified",
            "additions": 10,
            "deletions": 13,
            "changes": 23,
            "blob_url": "https://github.com/django/django/blob/0199bdc0b411d4aba0173053417bbeea8224b26b/docs%2Ftopics%2Fsecurity.txt",
            "raw_url": "https://github.com/django/django/raw/0199bdc0b411d4aba0173053417bbeea8224b26b/docs%2Ftopics%2Fsecurity.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Ftopics%2Fsecurity.txt?ref=0199bdc0b411d4aba0173053417bbeea8224b26b",
            "patch": "@@ -122,22 +122,19 @@ transferred between client and server, and in some cases -- **active** network\n attackers -- to alter data that is sent in either direction.\n \n If you want the protection that HTTPS provides, and have enabled it on your\n-server, there are some additional steps to consider to ensure that sensitive\n-information is not leaked:\n+server, there are some additional steps you may need:\n+\n+* If necessary, set :setting:`SECURE_PROXY_SSL_HEADER`, ensuring that you have\n+  understood the warnings there thoroughly. Failure to do this can result\n+  in CSRF vulnerabilities, and failure to do it correctly can also be\n+  dangerous!\n \n * Set up redirection so that requests over HTTP are redirected to HTTPS.\n \n-  It is possible to do this with a piece of Django middleware. However, this has\n-  problems for the common case of a Django app running behind a reverse\n-  proxy. Often, reverse proxies are configured to set the ``X-Forwarded-SSL``\n-  header (or equivalent) if the incoming connection was HTTPS, and the absence\n-  of this header could be used to detect a request that was not HTTPS. However,\n-  this method usually cannot be relied on, as a client, or a malicious active\n-  network attacker, could also set this header.\n-\n-  So, for the case of a reverse proxy, it is recommended that the main Web\n-  server should be configured to do the redirect to HTTPS, or configured to send\n-  HTTP requests to an app that unconditionally redirects to HTTPS.\n+  This could be done using a custom middleware. Please note the caveats under\n+  :setting:`SECURE_PROXY_SSL_HEADER`. For the case of a reverse proxy, it may be\n+  easier or more secure to configure the main Web server to do the redirect to\n+  HTTPS.\n \n * Use 'secure' cookies.\n "
        }
    ],
    "stats": {
        "total": 23,
        "additions": 10,
        "deletions": 13
    }
}