{
    "author": "adrianholovaty",
    "message": "Reworded part of 'Running only some of the tests' in docs/internals/contributing.txt\n\ngit-svn-id: http://code.djangoproject.com/svn/django/trunk@15799 bcc190cf-cafb-0310-a4f2-bffc1f526a37",
    "sha": "12a2a231005dd965732a8321add66bf1f2387944",
    "files": [
        {
            "sha": "6e14083dbef82f0b0c832d9b472a4c01fccb351d",
            "filename": "docs/internals/contributing.txt",
            "status": "modified",
            "additions": 23,
            "deletions": 20,
            "changes": 43,
            "blob_url": "https://github.com/django/django/blob/12a2a231005dd965732a8321add66bf1f2387944/docs%2Finternals%2Fcontributing.txt",
            "raw_url": "https://github.com/django/django/raw/12a2a231005dd965732a8321add66bf1f2387944/docs%2Finternals%2Fcontributing.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing.txt?ref=12a2a231005dd965732a8321add66bf1f2387944",
            "patch": "@@ -7,21 +7,21 @@ it. We're passionate about helping Django users make the jump to contributing\n members of the community, so there are many ways you can help Django's\n development:\n \n-    * Blog about Django.  We syndicate all the Django blogs we know about on\n+    * Blog about Django. We syndicate all the Django blogs we know about on\n       the `community page`_; contact jacob@jacobian.org if you've got a blog\n       you'd like to see on that page.\n \n-    * Report bugs and request features in our `ticket tracker`_.  Please read\n+    * Report bugs and request features in our `ticket tracker`_. Please read\n       `Reporting bugs`_, below, for the details on how we like our bug reports\n       served up.\n \n-    * Submit patches for new and/or fixed behavior.  Please read `Submitting\n+    * Submit patches for new and/or fixed behavior. Please read `Submitting\n       patches`_, below, for details on how to submit a patch. If you're looking\n       for an easy way to start contributing to Django have a look at the\n       `easy-pickings`_ tickets.\n \n     * Join the `django-developers`_ mailing list and share your ideas for how\n-      to improve Django.  We're always open to suggestions, although we're\n+      to improve Django. We're always open to suggestions, although we're\n       likely to be skeptical of large-scale suggestions without some code to\n       back it up.\n \n@@ -47,7 +47,7 @@ Reporting bugs\n \n Well-written bug reports are *incredibly* helpful. However, there's a certain\n amount of overhead involved in working with any bug tracking system so your\n-help in keeping our ticket tracker as useful as possible is appreciated.  In\n+help in keeping our ticket tracker as useful as possible is appreciated. In\n particular:\n \n     * **Do** read the :doc:`FAQ </faq/index>` to see if your issue might\n@@ -65,7 +65,7 @@ particular:\n       A minimal example that illustrates the bug in a nice small test case\n       is the best possible bug report.\n \n-    * **Don't** use the ticket system to ask support questions.  Use the\n+    * **Don't** use the ticket system to ask support questions. Use the\n       `django-users`_ list, or the `#django`_ IRC channel for that.\n \n     * **Don't** use the ticket system to make large-scale feature requests.\n@@ -74,7 +74,7 @@ particular:\n \n     * **Don't** reopen issues that have been marked \"wontfix\". This mark\n       means that the decision has been made that we can't or won't fix\n-      this particular issue.  If you're not sure why, please ask\n+      this particular issue. If you're not sure why, please ask\n       on `django-developers`_.\n \n     * **Don't** use the ticket tracker for lengthy discussions, because they're\n@@ -1010,19 +1010,22 @@ dictionary for the applicable database.\n Running only some of the tests\n ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n \n-Django's entire test suite takes a few minutes to run. To run a subset of the\n-unit tests, append the names of the test modules to the ``runtests.py``\n+Django's entire test suite takes a while to run, and running every single test\n+could be redundant if, say, you just added a test to Django that you want to\n+run quickly without running everything else. You can run a subset of the unit\n+tests by appending the names of the test modules to ``runtests.py`` on the\n command line.\n \n-As an example, if you'd like to only run tests for generic relations and\n+For example, if you'd like to run tests only for generic relations and\n internationalization, type:\n \n .. code-block:: bash\n \n     ./runtests.py --settings=path.to.settings generic_relations i18n\n \n-See the list of directories in ``tests/modeltests`` and\n-``tests/regressiontests`` for module names.\n+How do you find out the names of individual tests? Look in ``tests/modeltests``\n+and ``tests/regressiontests`` -- each directory name there is the name of a\n+test.\n \n If you just want to run a particular class of tests, you can specify a list of\n paths to individual test classes. For example, to run the ``TranslationTests``\n@@ -1032,7 +1035,7 @@ of the ``i18n`` module, type:\n \n     ./runtests.py --settings=path.to.settings i18n.TranslationTests\n \n-You can specify an individual test like this:\n+Going beyond that, you can specify an individual test method like this:\n \n .. code-block:: bash\n \n@@ -1052,7 +1055,7 @@ dependencies:\n     *  memcached_, plus a :ref:`supported Python binding <memcached>`\n     *  gettext_ (:ref:`gettext_on_windows`)\n \n-If you want to test the memcached cache backend, you will also need to define\n+If you want to test the memcached cache backend, you'll also need to define\n a :setting:`CACHES` setting that points at your memcached instance.\n \n Each of these dependencies is optional. If you're missing any of them, the\n@@ -1086,10 +1089,10 @@ Requesting features\n ===================\n \n We're always trying to make Django better, and your feature requests are a key\n-part of that. Here are some tips on how to most effectively make a request:\n+part of that. Here are some tips on how to make a request most effectively:\n \n-    * Request the feature on `django-developers`_, not in the ticket tracker;\n-      it'll get read more closely if it's on the mailing list.\n+    * Request the feature on `django-developers`_, not in the ticket tracker.\n+      It'll get read more closely if it's on the mailing list.\n \n     * Describe clearly and concisely what the missing feature is and how you'd\n       like to see it implemented. Include example code (non-functional is OK)\n@@ -1102,8 +1105,8 @@ part of that. Here are some tips on how to most effectively make a request:\n \n As with most open-source projects, code talks. If you are willing to write the\n code for the feature yourself or if (even better) you've already written it,\n-it's much more likely to be accepted.  If it's a large feature that might need\n-multiple developers we're always happy to give you an experimental branch in\n+it's much more likely to be accepted. If it's a large feature that might need\n+multiple developers, we're always happy to give you an experimental branch in\n our repository; see below.\n \n Branch policy\n@@ -1289,7 +1292,7 @@ How we make decisions\n Whenever possible, we strive for a rough consensus. To that end, we'll often\n have informal votes on `django-developers`_ about a feature. In these votes we\n follow the voting style invented by Apache and used on Python itself, where\n-votes are given as +1, +0, -0, or -1.  Roughly translated, these votes mean:\n+votes are given as +1, +0, -0, or -1. Roughly translated, these votes mean:\n \n     * +1: \"I love the idea and I'm strongly committed to it.\"\n "
        }
    ],
    "stats": {
        "total": 43,
        "additions": 23,
        "deletions": 20
    }
}