{
    "author": "unknown",
    "message": "Fixed #14702 -- Added a \"needsinfo\" resolution to Trac, and added supporting documentation on the new resolution and closing tickets in general.\n\ngit-svn-id: http://code.djangoproject.com/svn/django/trunk@15665 bcc190cf-cafb-0310-a4f2-bffc1f526a37",
    "sha": "2b7b4683257c072f74b03358ccc368831b872671",
    "files": [
        {
            "sha": "286c9282c766b12e0153721c325cecfbd2a5a8e9",
            "filename": "docs/howto/contribute.txt",
            "status": "modified",
            "additions": 35,
            "deletions": 0,
            "changes": 35,
            "blob_url": "https://github.com/django/django/blob/2b7b4683257c072f74b03358ccc368831b872671/docs%2Fhowto%2Fcontribute.txt",
            "raw_url": "https://github.com/django/django/raw/2b7b4683257c072f74b03358ccc368831b872671/docs%2Fhowto%2Fcontribute.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Fhowto%2Fcontribute.txt?ref=2b7b4683257c072f74b03358ccc368831b872671",
            "patch": "@@ -64,6 +64,8 @@ However, Trac can be quite confusing even to veteran contributors.  Having to\n look at both flags and triage stages isn't immediately obvious, and the stages\r\n themselves can be misinterpreted.\r\n \r\n+.. _triage-stages-explained:\r\n+\r\n What Django's triage stages \"really mean\"\r\n -----------------------------------------\r\n \r\n@@ -135,6 +137,39 @@ will eventually be merged to trunk.  Tickets in this stage generally don't need\n further work. This may happen in the case of major features/refactors in each\r\n release cycle, or as part of the annual Google Summer of Code efforts.\r\n \r\n+.. _closing-tickets:\r\n+\r\n+Closing Tickets\r\n+---------------\r\n+\r\n+When a ticket has completed its useful lifecycle, it's time for it to be closed.\r\n+Closing a ticket is a big responsibility, though. You have to be sure that\r\n+the issue is really resolved, and you need to keep in mind that the reporter\r\n+of the ticket may not be happy to have their ticket closed (unless it's fixed,\r\n+of course). If you're not certain about closing a ticket, just leave a comment\r\n+with your thoughts instead.\r\n+\r\n+If you do close a ticket, you should always make sure of the following:\r\n+\r\n+  * Be certain that the issue is resolved.\r\n+\r\n+  * Leave a comment explaining the decision to close the ticket.\r\n+\r\n+  * If there is a way they can improve the ticket to reopen it, let them know.\r\n+\r\n+  * If the ticket is a duplicate, reference the original ticket.\r\n+\r\n+  * **Be polite.** No one likes having their ticket closed. It can be\r\n+    frustrating or even discouraging. The best way to avoid turning people\r\n+    off from contributing to Django is to be polite and friendly and to offer\r\n+    suggestions for how they could improve this ticket and other tickets in the\r\n+    future.\r\n+\r\n+.. seealso::\r\n+\r\n+    The :ref:`contributing reference <ticket-resolutions>` contains a\r\n+    description of each of the available resolutions in Trac.\r\n+\r\n Example Trac workflow\r\n ---------------------\r\n \r"
        },
        {
            "sha": "6e40b1f3b164c318264733b7d8dcca5892a1b8c9",
            "filename": "docs/internals/contributing.txt",
            "status": "modified",
            "additions": 30,
            "deletions": 6,
            "changes": 36,
            "blob_url": "https://github.com/django/django/blob/2b7b4683257c072f74b03358ccc368831b872671/docs%2Finternals%2Fcontributing.txt",
            "raw_url": "https://github.com/django/django/raw/2b7b4683257c072f74b03358ccc368831b872671/docs%2Finternals%2Fcontributing.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing.txt?ref=2b7b4683257c072f74b03358ccc368831b872671",
            "patch": "@@ -276,12 +276,15 @@ We've got two roles in this diagram:\n       Django is a community project, and we encourage `triage by the\n       community`_.\n \n+Triage stages\n+-------------\n+\n Second, note the five triage stages:\n \n-    1. A ticket starts as \"Unreviewed\", meaning that nobody has examined\n+    1. A ticket starts as **Unreviewed**, meaning that nobody has examined\n        the ticket.\n \n-    2. \"Design decision needed\" means \"this concept requires a design\n+    2. **Design decision needed** means \"this concept requires a design\n        decision,\" which should be discussed either in the ticket comments or on\n        `django-developers`_. The \"Design decision needed\" step will generally\n        only be used for feature requests. It can also be used for issues\n@@ -290,16 +293,16 @@ Second, note the five triage stages:\n        standard) skip this step and move straight to \"Accepted\".\n \n     3. Once a ticket is ruled to be approved for fixing, it's moved into the\n-       \"Accepted\" stage. This stage is where all the real work gets done.\n+       **Accepted** stage. This stage is where all the real work gets done.\n \n-    4. In some cases, a ticket might get moved to the \"Someday/Maybe\" state.\n+    4. In some cases, a ticket might get moved to the **Someday/Maybe** state.\n        This means the ticket is an enhancement request that we might consider\n        adding to the framework if an excellent patch is submitted. These\n        tickets are not a high priority.\n \n     5. If a ticket has an associated patch (see below), it will be reviewed\n-       by the community. If the patch is complete, it'll be marked as \"ready\n-       for checkin\" so that a core developer knows to review and commit the\n+       by the community. If the patch is complete, it'll be marked as **Ready\n+       for checkin** so that a core developer knows to review and commit the\n        patch.\n \n The second part of this workflow involves a set of flags the describe what the\n@@ -324,6 +327,17 @@ ticket has or needs in order to be \"ready for checkin\":\n         cleanly, there is a flaw in the implementation, or that the code\n         doesn't meet our standards.\n \n+.. seealso::\n+\n+    The :ref:`contributing howto guide <triage-stages-explained>` has a detailed\n+    explanation of each of the triage stages and how the triage process works in\n+    Trac.\n+\n+.. _ticket-resolutions:\n+\n+Ticket Resolutions\n+------------------\n+\n A ticket can be resolved in a number of ways:\n \n     \"fixed\"\n@@ -353,12 +367,22 @@ A ticket can be resolved in a number of ways:\n         Used when the ticket doesn't contain enough detail to replicate\n         the original bug.\n \n+    \"needsinfo\"\n+        Used when the ticket does not contain enough information to replicate\n+        the reported issue but is potentially still valid. The ticket\n+        should be reopened when more information is supplied.\n+\n If you believe that the ticket was closed in error -- because you're\n still having the issue, or it's popped up somewhere else, or the triagers have\n made a mistake -- please reopen the ticket and provide further information.\n Please do not reopen tickets that have been marked as \"wontfix\" by core\n developers.\n \n+.. seealso::\n+\n+    For more information on what to do when closing a ticket, please see the\n+    :ref:`contributing howto guide <closing-tickets>`.\n+\n .. _required details: `Reporting bugs`_\n .. _good patch: `Patch style`_\n .. _triage by the community: `Triage by the general community`_"
        }
    ],
    "stats": {
        "total": 71,
        "additions": 65,
        "deletions": 6
    }
}