{
    "author": "aaugustin",
    "message": "Proof-read the new contributing guide.\n\nMany thanks to Daniele Procida.",
    "sha": "329bb9296f402c6e7d7b648937b72b13a6f5756c",
    "files": [
        {
            "sha": "1ed2d7397f9e11a0b9814cae27d68e4fbfd2f679",
            "filename": "AUTHORS",
            "status": "modified",
            "additions": 1,
            "deletions": 0,
            "changes": 1,
            "blob_url": "https://github.com/django/django/blob/329bb9296f402c6e7d7b648937b72b13a6f5756c/AUTHORS",
            "raw_url": "https://github.com/django/django/raw/329bb9296f402c6e7d7b648937b72b13a6f5756c/AUTHORS",
            "contents_url": "https://api.github.com/repos/django/django/contents/AUTHORS?ref=329bb9296f402c6e7d7b648937b72b13a6f5756c",
            "patch": "@@ -425,6 +425,7 @@ answer newbie questions, and generally made Django that much better:\n     polpak@yahoo.com\n     Ross Poulton <ross@rossp.org>\n     Mihai Preda <mihai_preda@yahoo.com>\n+    Daniele Procida <daniele@vurt.org>\n     Matthias Pronk <django@masida.nl>\n     Jyrki Pulliainen <jyrki.pulliainen@gmail.com>\n     Thejaswi Puthraya <thejaswi.puthraya@gmail.com>"
        },
        {
            "sha": "8f0ceea44d993a4b8bcf0dc652e2e4d26ee78cea",
            "filename": "docs/internals/contributing/committing-code.txt",
            "status": "modified",
            "additions": 28,
            "deletions": 25,
            "changes": 53,
            "blob_url": "https://github.com/django/django/blob/329bb9296f402c6e7d7b648937b72b13a6f5756c/docs%2Finternals%2Fcontributing%2Fcommitting-code.txt",
            "raw_url": "https://github.com/django/django/raw/329bb9296f402c6e7d7b648937b72b13a6f5756c/docs%2Finternals%2Fcontributing%2Fcommitting-code.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing%2Fcommitting-code.txt?ref=329bb9296f402c6e7d7b648937b72b13a6f5756c",
            "patch": "@@ -21,7 +21,7 @@ Partial committers\n     access to the subsystems that fall under their jurisdiction, and they're\n     given a formal vote in questions that involve their subsystems. This type\n     of access is likely to be given to someone who contributes a large\n-    subframework to Django and wants to continue to maintain it.\n+    sub-framework to Django and wants to continue to maintain it.\n \n     Partial commit access is granted by the same process as full\n     committers. However, the bar is set lower; proven expertise in the area\n@@ -30,26 +30,28 @@ Partial committers\n Decisions on new committers will follow the process explained in\n :ref:`how-we-make-decisions`. To request commit access, please contact an\n existing committer privately. Public requests for commit access are potential\n-flame-war starters, and will be ignored.\n+flame-war starters, and will simply be ignored.\n \n Handling pull requests\n ----------------------\n \n Since Django is now hosted at GitHub, many patches are provided in the form of\n-pull requests. When committing a pull request, make sure each individual\n-commit matches the commit guidelines described below. Contributors are\n-expected to provide the best pull requests possible. However, in practice,\n-committers are more familiar with the commit guidelines, and they may have to\n-rewrite the commit history.\n+pull requests.\n+\n+When committing a pull request, make sure each individual commit matches the\n+commit guidelines described below. Contributors are expected to provide the\n+best pull requests possible. In practice however, committers - who will likely\n+be more familiar with the commit guidelines - may decide to bring a commit up\n+to standard themselves.\n \n Here is one way to commit a pull request::\n \n     # Create a new branch tracking upstream/master -- upstream is assumed\n     # to be django/django.\n-    git checkout -b pull_xxxx upstream/master\n+    git checkout -b pull_xxxxx upstream/master\n \n     # Download the patches from github and apply them.\n-    curl https://github.com/django/django/pull/XXXX.patch | git am\n+    curl https://github.com/django/django/pull/xxxxx.patch | git am\n \n At this point, you can work on the code. Use ``git rebase -i`` and ``git\n commit --amend`` to make sure the commits have the expected level of quality.\n@@ -59,20 +61,20 @@ Once you're ready::\n     git checkout master\n     git pull upstream master\n     # Merge the work as \"fast-forward\" to master, to avoid a merge commit.\n-    git merge --ff-only pull_xx\n+    git merge --ff-only pull_xxxxx\n     # Check that only the changes you expect will be pushed to upstream.\n     git push --dry-run upstream master\n     # Push!\n     git push upstream master\n \n-    # Get rid of the pull_xxxx branch.\n-    git branch -d pull_xxxx\n+    # Get rid of the pull_xxxxx branch.\n+    git branch -d pull_xxxxx\n \n-An alternative is to add the contributor's repository as a new remote, do a\n-checkout of the branch and work from there::\n+An alternative is to add the contributor's repository as a new remote,\n+checkout the branch and work from there::\n \n     git remote add <contributor> https://github.com/<contributor>/django.git\n-    git checkout pull_xxxx <contributor> <contributor's pull request branch>\n+    git checkout pull_xxxxx <contributor> <contributor's pull request branch>\n \n At this point, you can work on the code and continue as above.\n \n@@ -151,7 +153,7 @@ Django's Git repository:\n   review.\"\n \n * For commits to a branch, prefix the commit message with the branch name.\n-  For example: \"[1.4.x] Fixed #NNNNN -- Added support for mind reading.\"\n+  For example: \"[1.4.x] Fixed #xxxxx -- Added support for mind reading.\"\n \n * Limit commits to the most granular change that makes sense. This means,\n   use frequent small commits rather than infrequent large commits. For\n@@ -165,22 +167,22 @@ Django's Git repository:\n   <backwards-compatibility-policy>`.\n \n * If your commit closes a ticket in the Django `ticket tracker`_, begin\n-  your commit message with the text \"Fixed #NNNNN\", where \"NNNNN\" is the\n+  your commit message with the text \"Fixed #xxxxx\", where \"xxxxx\" is the\n   number of the ticket your commit fixes. Example: \"Fixed #123 -- Added\n   whizbang feature.\". We've rigged Trac so that any commit message in that\n   format will automatically close the referenced ticket and post a comment\n   to it with the full commit message.\n \n   If your commit closes a ticket and is in a branch, use the branch name\n-  first, then the \"Fixed #NNNNN.\" For example:\n+  first, then the \"Fixed #xxxxx.\" For example:\n   \"[1.4.x] Fixed #123 -- Added whizbang feature.\"\n \n   For the curious, we're using a `Trac plugin`_ for this.\n \n   .. _Trac plugin: https://github.com/aaugustin/trac-github\n \n * If your commit references a ticket in the Django `ticket tracker`_ but\n-  does *not* close the ticket, include the phrase \"Refs #NNNNN\", where \"NNNNN\"\n+  does *not* close the ticket, include the phrase \"Refs #xxxxx\", where \"xxxxx\"\n   is the number of the ticket your commit references. This will automatically\n   post a comment to the appropriate ticket.\n \n@@ -199,13 +201,14 @@ Django's Git repository:\n Reverting commits\n -----------------\n \n-Nobody's perfect; mistakes will be committed. When a mistaken commit is\n-discovered, please follow these guidelines:\n+Nobody's perfect; mistakes will be committed.\n+\n+But try very hard to ensure that mistakes don't happen. Just because we have a\n+reversion policy doesn't relax your responsibility to aim for the highest\n+quality possible. Really: double-check your work, or have it checked by\n+another committer, **before** you commit it in the first place!\n \n-* Try very hard to ensure that mistakes don't happen. Just because we\n-  have a reversion policy doesn't relax your responsibility to aim for\n-  the highest quality possible. Really: double-check your work, or have\n-  it checked by another committer, before you commit it in the first place!\n+When a mistaken commit is discovered, please follow these guidelines:\n \n * If possible, have the original author revert his/her own commit.\n "
        },
        {
            "sha": "e78eecc23a2b8476bd330f865f9bfe0c0cd3e56b",
            "filename": "docs/internals/contributing/writing-code/submitting-patches.txt",
            "status": "modified",
            "additions": 29,
            "deletions": 17,
            "changes": 46,
            "blob_url": "https://github.com/django/django/blob/329bb9296f402c6e7d7b648937b72b13a6f5756c/docs%2Finternals%2Fcontributing%2Fwriting-code%2Fsubmitting-patches.txt",
            "raw_url": "https://github.com/django/django/raw/329bb9296f402c6e7d7b648937b72b13a6f5756c/docs%2Finternals%2Fcontributing%2Fwriting-code%2Fsubmitting-patches.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing%2Fwriting-code%2Fsubmitting-patches.txt?ref=329bb9296f402c6e7d7b648937b72b13a6f5756c",
            "patch": "@@ -20,9 +20,10 @@ See the :doc:`working-with-git` for more details on how to use pull requests.\n \n In an open-source project with hundreds of contributors around the world, it's\n important to manage communication efficiently so that work doesn't get\n-duplicated and contributors can be as effective as possible. Hence, our policy\n-is for contributors to \"claim\" tickets in order to let other developers know\n-that a particular bug or feature is being worked on.\n+duplicated and contributors can be as effective as possible.\n+\n+Hence, our policy is for contributors to \"claim\" tickets in order to let other\n+developers know that a particular bug or feature is being worked on.\n \n If you have identified a contribution you want to make and you're capable of\n fixing it (as measured by your coding ability, knowledge of Django internals\n@@ -68,18 +69,23 @@ no longer monopolized and somebody else can claim it.\n If you've claimed a ticket and it's taking a long time (days or weeks) to code,\n keep everybody updated by posting comments on the ticket. If you don't provide\n regular updates, and you don't respond to a request for a progress report,\n-your claim on the ticket may be revoked. As always, more communication is\n-better than less communication!\n+your claim on the ticket may be revoked.\n+\n+As always, more communication is better than less communication!\n \n Which tickets should be claimed?\n ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n \n Of course, going through the steps of claiming tickets is overkill in some\n-cases. In the case of small changes, such as typos in the documentation or\n+cases.\n+\n+In the case of small changes, such as typos in the documentation or\n small bugs that will only take a few minutes to fix, you don't need to jump\n through the hoops of claiming tickets. Just submit your patch and be done with\n-it. Of course, it is always acceptable, regardless of the ticket's ownership\n-status, to submit patches to a ticket if you happen to have a patch ready.\n+it.\n+\n+Of course, it is *always* acceptable, regardless whether someone has claimed it\n+or not, to submit patches to a ticket if you happen to have a patch ready.\n \n .. _patch-style:\n \n@@ -90,12 +96,12 @@ Make sure that any contribution you do fulfills at least the following\n requirements:\n \n * The code required to fix a problem or add a feature is an essential part\n-  of a patch, but it is not the only part. A good patch should also\n-  include a regression test to validate the behavior that has been fixed\n-  and to prevent the problem from arising again. Also, if some tickets are\n-  relevant to the code that you've written, mention the ticket numbers in\n+  of a patch, but it is not the only part. A good patch should also include a\n+  :doc:`regression test <unit-tests>` to validate the behavior that has been\n+  fixed and to prevent the problem from arising again. Also, if some tickets\n+  are relevant to the code that you've written, mention the ticket numbers in\n   some comments in the test so that one can easily trace back the relevant\n-  discussions after your patch gets committed and the tickets get closed.\n+  discussions after your patch gets committed, and the tickets get closed.\n \n * If the code associated with a patch adds a new feature, or modifies\n   behavior of an existing feature, the patch should also contain\n@@ -105,6 +111,7 @@ You can use either GitHub branches and pull requests or direct patches\n to publish your work. If you use the Git workflow, then you should\n announce your branch in the ticket by including a link to your branch.\n When you think your work is ready to be merged in create a pull request.\n+\n See the :doc:`working-with-git` documentation for mode details.\n \n You can also use patches in Trac. When using this style, follow these\n@@ -139,8 +146,10 @@ A \"non-trivial\" patch is one that is more than a simple bug fix. It's a patch\n that introduces Django functionality and makes some sort of design decision.\n \n If you provide a non-trivial patch, include evidence that alternatives have\n-been discussed on `django-developers`_. If you're not sure whether your patch\n-should be considered non-trivial, just ask.\n+been discussed on `django-developers`_.\n+\n+If you're not sure whether your patch should be considered non-trivial, just\n+ask.\n \n Javascript patches\n ------------------\n@@ -156,6 +165,9 @@ code for future development (e.g. ``foo.js``), and a compressed version for\n production use (e.g. ``foo.min.js``). Any links to the file in the codebase\n should point to the compressed version.\n \n+Compressing JavaScript\n+~~~~~~~~~~~~~~~~~~~~~~\n+\n To simplify the process of providing optimized javascript code, Django\n includes a handy script which should be used to create a \"minified\" version.\n This script is located at ``django/contrib/admin/static/js/compress.py``.\n@@ -167,11 +179,11 @@ complete javascript patches will need to download and install the library\n independently.\n \n The Closure Compiler library requires Java version 6 or higher (Java 1.6 or\n-higher on Mac OS X). Note that Mac OS X 10.5 and earlier did not ship with\n+higher on Mac OS X. Note that Mac OS X 10.5 and earlier did not ship with\n Java 1.6 by default, so it may be necessary to upgrade your Java installation\n before the tool will be functional. Also note that even after upgrading Java,\n the default ``/usr/bin/java`` command may remain linked to the previous Java\n-binary, so relinking that command may be necessary as well.\n+binary, so relinking that command may be necessary as well.)\n \n Please don't forget to run ``compress.py`` and include the ``diff`` of the\n minified scripts when submitting patches for Django's javascript."
        },
        {
            "sha": "ad03a29860e91724180496c7fc22b3a48d8ef20d",
            "filename": "docs/internals/contributing/writing-code/working-with-git.txt",
            "status": "modified",
            "additions": 101,
            "deletions": 77,
            "changes": 178,
            "blob_url": "https://github.com/django/django/blob/329bb9296f402c6e7d7b648937b72b13a6f5756c/docs%2Finternals%2Fcontributing%2Fwriting-code%2Fworking-with-git.txt",
            "raw_url": "https://github.com/django/django/raw/329bb9296f402c6e7d7b648937b72b13a6f5756c/docs%2Finternals%2Fcontributing%2Fwriting-code%2Fworking-with-git.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing%2Fwriting-code%2Fworking-with-git.txt?ref=329bb9296f402c6e7d7b648937b72b13a6f5756c",
            "patch": "@@ -11,18 +11,20 @@ that you also work using GitHub.\n After installing Git the first thing you should do is setup your name and\n email::\n \n-  $ git config --global user.name \"Firstname Lastname\"\n-  $ git config --global user.email \"your_email@youremail.com\"\n+  $ git config --global user.name \"Your Real Name\"\n+  $ git config --global user.email \"you@email.com\"\n \n Note that ``user.name`` should be your real name, not your GitHub nick. GitHub\n should know the email you use in the ``user.email`` field, as this will be\n used to associate your commits with your GitHub account.\n \n Now we are going to show how to create a GitHub pull request containing the\n-changes for Trac ticket #xxxxx. By creating a fully ready pull request you\n-will make the committers' job easier, and thus your work is more likely to be\n-merged into Django. You can also upload a traditional patch to Trac, but it's\n-less practical for reviews.\n+changes for Trac ticket #xxxxx. By creating a fully-ready pull request you\n+will make the committers' job easier, meaning that your work is more likely to\n+be merged into Django.\n+\n+You could also upload a traditional patch to Trac, but it's less practical for\n+reviews.\n \n .. _Git: http://git-scm.com/\n .. _GitHub: https://github.com/\n@@ -31,14 +33,18 @@ less practical for reviews.\n Setting up local repository\n ---------------------------\n \n-When you have created a GitHub account, with the nick \"github_nick\", and\n-forked Django's repository, you should create a local copy of your fork::\n+When you have created your GitHub account, with the nick \"github_nick\", and\n+forked Django's repository, create a local copy of your fork::\n \n     git clone git@github.com:github_nick/django.git\n \n-This will create a new directory \"django\" containing a clone of your GitHub\n-repository. Your GitHub repository will be called \"origin\" in Git. You should\n-also setup django/django as an \"upstream\" remote::\n+This will create a new directory \"django\", containing a clone of your GitHub\n+repository.\n+\n+Your GitHub repository will be called \"origin\" in Git.\n+\n+You should also setup django/django as an \"upstream\" remote (that is, tell git\n+that the reference Django repository was the source of your fork of it)::\n \n     git remote add upstream git@github.com:django/django.git\n     git fetch upstream\n@@ -50,12 +56,15 @@ You can add other remotes similarly, for example::\n Working on a ticket\n -------------------\n \n-When working on a ticket you will almost always want to create a new branch\n-for the work, and base that work on upstream/master::\n+When working on a ticket create a new branch for the work, and base that work\n+on upstream/master::\n \n     git checkout -b ticket_xxxxx upstream/master\n \n-If you are working for a fix on the 1.4 branch, you would instead do::\n+The -b flag creates a new branch for you locally. Don't hesitate to create new\n+branches even for the smallest things - that's what they are there for.\n+\n+If instead you were working for a fix on the 1.4 branch, you would do::\n \n     git checkout -b ticket_xxxxx_1_4 upstream/stable/1.4.x\n \n@@ -64,7 +73,7 @@ commit them::\n \n     git commit\n \n-When writing the commit message, you should follow the :ref:`commit message\n+When writing the commit message, follow the :ref:`commit message\n guidelines <committing-guidlines>` to ease the work of the committer. If\n you're uncomfortable with English, try at least to describe precisely what the\n commit does.\n@@ -77,69 +86,77 @@ necessary::\n Publishing work\n ~~~~~~~~~~~~~~~\n \n-You can publish your work on GitHub by just using::\n+You can publish your work on GitHub just by doing::\n \n   git push origin ticket_xxxxx\n \n When you go to your GitHub page you will notice a new branch has been created.\n+\n If you are working on a Trac ticket, you should mention in the ticket that\n your work is available from branch ticket_xxxxx of your github repo. Include a\n link to your branch.\n \n-Note that the above branch is called a \"topic branch\" in Git parlance. This\n-means that other people should not base their work on your branch. In\n-particular this means you are free to rewrite the history of this branch (by\n-using ``git rebase`` for example). There are also \"public branches\". These are\n-branches other people are supposed to fork, and thus their history should\n-never change. Good examples of public branches are the ``master`` and\n-``stable/A.B.x`` branches in the django/django repository.\n+Note that the above branch is called a \"topic branch\" in Git parlance. You are\n+free to rewrite the history of this branch, by using ``git rebase`` for\n+example. Other people shouldn't base their work on such a branch, because\n+their clone would become corrupt when you edit commits.\n+\n+There are also \"public branches\". These are branches other people are supposed\n+to fork, so the history of these branches should never change. Good examples\n+of public branches are the ``master`` and ``stable/A.B.x`` branches in the\n+django/django repository.\n \n When you think your work is ready to be pulled into Django, you should create\n-a pull request at GitHub. A good pull request contains:\n+a pull request at GitHub. A good pull request means:\n \n-* Commits with one logical change in each, following the\n-  :doc:`coding style <coding-style>`.\n+* commits with one logical change in each, following the\n+  :doc:`coding style <coding-style>`,\n \n-* Well formed messages for each commit: a summary line and then paragraphs\n-  wrapped at 72 characters thereafter. See the :ref:`committing guidelines\n-  <committing-guidlines>` for more details.\n+* well-formed messages for each commit: a summary line and then paragraphs\n+  wrapped at 72 characters thereafter -- see the :ref:`committing guidelines\n+  <committing-guidlines>` for more details,\n \n-* Documentation and tests, if needed. Actually tests are always needed, except\n-  for documentation changes.\n+* documentation and tests, if needed -- actually tests are always needed,\n+  except for documentation changes.\n \n-* The test suite passes and the documentation builds without warnings.\n+The test suite must pass and the documentation must build without warnings.\n \n Once you have created your pull request, you should add a comment in the\n-related Trac ticket explaining what you've done. In particular you should tell\n-in which environment you've run the tests, for instance: \"all tests pass under\n-SQLite and MySQL\".\n+related Trac ticket explaining what you've done. In particular you should note\n+the environment in which you ran the tests, for instance: \"all tests pass\n+under SQLite and MySQL\".\n \n-Your pull request should be ready for merging into Django. Pull requests at\n-GitHub have only two states: open and closed. The committers who deals with\n-your pull request has only two options: merge it or close it. For this reason,\n-it isn't useful to make a pull request until the code is ready for merging --\n-or sufficiently close that a committer will finish it himself.\n+Pull requests at GitHub have only two states: open and closed. The committer\n+who will deal with your pull request has only two options: merge it or close\n+it. For this reason, it isn't useful to make a pull request until the code is\n+ready for merging -- or sufficiently close that a committer will finish it\n+himself.\n \n Rebasing branches\n ~~~~~~~~~~~~~~~~~\n \n In the example above you created two commits, the \"Fixed ticket_xxxxx\" commit\n-and \"Added two more tests\" commit. We do not want to have the \"Added two more\n-tests\" commit in the Django's repository as it would just be useless noise.\n-Instead, we would like to only have one commit. To rework the history of your\n-branch you can squash the commits into one by using interactive rebase::\n+and \"Added two more tests\" commit.\n+\n+We do not want to have the entire history of your working process in your\n+repository. Your commit \"Added two more tests\" would be unhelpful noise.\n+Instead, we would rather only have one commit containing all your work.\n+\n+To rework the history of your branch you can squash the commits into one by\n+using interactive rebase::\n \n     git rebase -i HEAD~2\n \n The HEAD~2 above is shorthand for two latest commits. The above command\n will open an editor showing the two commits, prefixed with the word \"pick\".\n-You should change the second line to \"squash\" instead. This will keep the\n-first commit, and squash the second commit to the first one. Save and quit\n-the editor. A second editor window should open. Here you can reword the\n-commit message for the commit.\n+\n+Change the second line to \"squash\" instead. This will keep the\n+first commit, and squash the second commit into the first one. Save and quit\n+the editor. A second editor window should open, so you can reword the\n+commit message for the commit now that it includes both your steps.\n \n You can also use the \"edit\" option in rebase. This way you can change a single\n-commit. For example::\n+commit, for example to fix a typo in a docstring::\n \n     git rebase -i HEAD~3\n     # Choose edit, pick, pick for the commits\n@@ -148,17 +165,18 @@ commit. For example::\n     git commit --amend\n     # reword the commit message if needed\n     git rebase --continue\n-    # The second and third commit should be applied.\n+    # The second and third commits should be applied.\n \n-If you need to change an already published topic branch at GitHub, you will\n-need to force-push the changes::\n+If your topic branch is already published at GitHub, for example if you're\n+making minor changes to take into account a review, you will need to force-\n+push the changes::\n \n     git push -f origin ticket_xxxxx\n \n Note that this will rewrite history of ticket_xxxxx - if you check the commit\n hashes before and after the operation at GitHub you will notice that the\n-commit hashes do not match any more. This is acceptable, as the branch is topic\n-branch, and nobody should be basing their work on this branch.\n+commit hashes do not match any more. This is acceptable, as the branch is merely\n+a topic branch, and nobody should be basing their work on it.\n \n After upstream has changed\n ~~~~~~~~~~~~~~~~~~~~~~~~~~\n@@ -173,48 +191,54 @@ The work is automatically rebased using the branch you forked on, in the\n example case using upstream/master.\n \n The rebase command removes all your local commits temporarily, applies the\n-upstream commits, and then applies your local commits again on the work. If\n-there are merge conflicts you will need to resolve them and then use ``git\n+upstream commits, and then applies your local commits again on the work.\n+\n+If there are merge conflicts you will need to resolve them and then use ``git\n rebase --continue``. At any point you can use ``git rebase --abort`` to return\n to the original state.\n \n-Note that you want to rebase on upstream, not merge the upstream. The reason\n-for this is that by rebasing, your commits will always be on top of the\n-upstream's work, not mixed with the changes in the upstream. This way your\n-branch only contains commits related to its topic, and this makes squashing\n-easier.\n+Note that you want to *rebase* on upstream, not *merge* the upstream.\n+\n+The reason for this is that by rebasing, your commits will always be *on\n+top of* the upstream's work, not *mixed in with* the changes in the upstream.\n+This way your branch will contain only commits related to its topic, which\n+makes squashing easier.\n \n After review\n ------------\n \n It is unusual to get any non-trivial amount of code into core without changes\n requested by reviewers. In this case, it is often a good idea to add the\n changes as one incremental commit to your work. This allows the reviewer to\n-easily check what changes you have done::\n+easily check what changes you have done.\n \n-  # Do changes required by the reviewer, commit often.\n-  # Before publishing the changes, rebase your work. Assume you added two\n-  # commits to the work.\n-  git rebase -i HEAD~2\n-  # squash the second commit into the first, write a commit message something\n-  # like this:\n-  Made changes asked in review by the_reviewer\n+In this case, do the changes required by the reviewer. Commit as often as\n+necessary. Before publishing the changes, rebase your work. If you added two\n+commits, you would run::\n \n-    - Fixed whitespace errors in foo/bar\n-    - Reworded the doc string of the_method()\n+    git rebase -i HEAD~2\n \n-  # Push your work back to your github repo, there should not be any need\n-  # for force (-f) push, as you didn't touch the public commits in the rebase.\n-  git push origin ticket_xxxxx\n-  # Check your pull request, it should now contain the new commit, too.\n+Squash the second commit into the first. Write a commit message along the lines of::\n+\n+    Made changes asked in review by <reviewer>\n+\n+    - Fixed whitespace errors in foobar\n+    - Reworded the docstring of bar()\n+\n+Finally push your work back to your GitHub repository. Since you didn't touch\n+the public commits during the rebase, you should not need to force-push::\n+\n+    git push origin ticket_xxxxx\n+\n+Your pull request should now contain the new commit too.\n \n-The committer is likely to squash the review commit into the previous commit\n+Note that the committer is likely to squash the review commit into the previous commit\n when committing the code.\n \n Summary\n -------\n \n-* Work on GitHub if possible.\n+* Work on GitHub if you can.\n * Announce your work on the Trac ticket by linking to your GitHub branch.\n * When you have something ready, make a pull request.\n * Make your pull requests as good as you can."
        },
        {
            "sha": "948f9a1f7e57bb30a8e90e8fc35878eff13ba88a",
            "filename": "docs/internals/git.txt",
            "status": "modified",
            "additions": 33,
            "deletions": 25,
            "changes": 58,
            "blob_url": "https://github.com/django/django/blob/329bb9296f402c6e7d7b648937b72b13a6f5756c/docs%2Finternals%2Fgit.txt",
            "raw_url": "https://github.com/django/django/raw/329bb9296f402c6e7d7b648937b72b13a6f5756c/docs%2Finternals%2Fgit.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fgit.txt?ref=329bb9296f402c6e7d7b648937b72b13a6f5756c",
            "patch": "@@ -4,10 +4,13 @@ The Django source code repository\n \n When deploying a Django application into a real production environment, you\n will almost always want to use `an official packaged release of Django`_.\n+\n However, if you'd like to try out in-development code from an upcoming release\n or contribute to the development of Django, you'll need to obtain a clone of\n-Django's source code repository. This document covers the way the code\n-repository is laid out and how to work with and find things in it.\n+Django's source code repository.\n+\n+This document covers the way the code repository is laid out and how to work\n+with and find things in it.\n \n .. _an official packaged release of Django: https://www.djangoproject.com/download/\n \n@@ -17,12 +20,14 @@ High-level overview\n The Django source code repository uses `Git`_ to track changes to the code\n over time, so you'll need a copy of the Git client (a program called ``git``)\n on your computer, and you'll want to familiarize yourself with the basics of\n-how Git works. Git's web site offers downloads for various operating systems.\n-The site contains also vast amounts of `documentation`_.\n+how Git works.\n+\n+Git's web site offers downloads for various operating systems. The site also\n+contains vast amounts of `documentation`_.\n \n The Django Git repository is located online at `github.com/django/django\n-<https://github.com/django/django>`_. It contains the full source\n-code for all Django releases, and you can browse it online.\n+<https://github.com/django/django>`_. It contains the full source code for all\n+Django releases, which you can browse online.\n \n The Git repository includes several `branches`_:\n \n@@ -39,11 +44,10 @@ The Git repository includes several `branches`_:\n * ``attic/<project>`` branches were used to develop major or experimental new\n   features without affecting the rest of Django's code.\n \n-The Git repository also contains `tags`_. They identify snapshots of Django's\n-code at various important points in its history. Mostly these are the exact\n-revisions from which packaged Django releases were produced.\n+The Git repository also contains `tags`_. These are the exact revisions from\n+which packaged Django releases were produced, since version 1.0.\n \n-The source code for `Djangoproject.com <https://www.djangoproject.com/>`_ Web\n+The source code for the `Djangoproject.com <https://www.djangoproject.com/>`_ web\n site can be found at `github.com/django/djangoproject.com\n <https://github.com/django/djangoproject.com>`_.\n \n@@ -52,8 +56,8 @@ site can be found at `github.com/django/djangoproject.com\n .. _branches: https://github.com/django/django/branches\n .. _tags: https://github.com/django/django/tags\n \n-Working with Django's master branch\n-===================================\n+The master branch\n+=================\n \n If you'd like to try out the in-development code for the next release of\n Django, or if you'd like to contribute to Django by fixing bugs or developing\n@@ -76,15 +80,15 @@ over to :doc:`the documentation for contributing to Django\n </internals/contributing/index>`, which covers things like the preferred\n coding style and how to generate and submit a patch.\n \n-Branches\n-========\n+Other branches\n+==============\n \n Django uses branches for two main purposes:\n \n 1. Development of major or experimental features, to keep them from\n    affecting progress on other work in master.\n \n-2. Security and bug-fix support for older releases of Django, during\n+2. Security and bugfix support for older releases of Django, during\n    their support lifetimes.\n \n Feature-development branches\n@@ -154,9 +158,10 @@ part of Django itself, and so are no longer separately maintained:\n \n When Django moved from SVN to Git, the information about branch merges wasn't\n preserved in the source code repository. This means that the ``master`` branch\n-of Django doesn't contain merge commits for the above branches. However, this\n-information is `available as a grafts file`_. You can restore it by putting\n-the following lines in ``.git/info/grafts`` in your local clone::\n+of Django doesn't contain merge commits for the above branches.\n+\n+However, this information is `available as a grafts file`_. You can restore it\n+by putting the following lines in ``.git/info/grafts`` in your local clone::\n \n   ac64e91a0cadc57f4bc5cd5d66955832320ca7a1 553a20075e6991e7a60baee51ea68c8adc520d9a 0cb8e31823b2e9f05c4ae868c19f5f38e78a5f2e\n   79e68c225b926302ebb29c808dda8afa49856f5c d0f57e7c7385a112cb9e19d314352fc5ed5b0747 aa239e3e5405933af6a29dac3cf587b59a099927\n@@ -202,15 +207,18 @@ Support and bugfix branches\n ---------------------------\n \n In addition to fixing bugs in current master, the Django project provides\n-official bug-fix support for the most recent released version of Django, and\n-security support for the two most recently-released versions of Django. This\n-support is provided via branches in which the necessary bug or security fixes\n-are applied; the branches are then used as the basis for issuing bugfix or\n-security releases.\n+official bugfix support for the most recent released version of Django, and\n+security support for the two most recently-released versions of Django.\n+\n+This support is provided via branches in which the necessary bug or security\n+fixes are applied; the branches are then used as the basis for issuing bugfix\n+or security releases.\n \n These branches can be found in the repository as ``stable/A.B.x``\n branches, and new branches will be created there after each new Django\n-release. For example, shortly after the release of Django 1.0, the branch\n+release.\n+\n+For example, shortly after the release of Django 1.0, the branch\n ``stable/1.0.x`` was created to receive bug fixes, and shortly after the\n release of Django 1.1 the branch ``stable/1.1.x`` was created.\n \n@@ -222,7 +230,7 @@ used them to provide unofficial support for old Django releases.\n Tags\n ====\n \n-Each Django release is tagged and signed by Django's release manage.\n+Each Django release is tagged and signed by Django's release manager.\n \n The tags can be found on GitHub's `tags`_ page.\n "
        },
        {
            "sha": "97adb4a3f6c8b68c9cce7daa0e65e6a56f9f7a4a",
            "filename": "docs/internals/release-process.txt",
            "status": "modified",
            "additions": 5,
            "deletions": 5,
            "changes": 10,
            "blob_url": "https://github.com/django/django/blob/329bb9296f402c6e7d7b648937b72b13a6f5756c/docs%2Finternals%2Frelease-process.txt",
            "raw_url": "https://github.com/django/django/raw/329bb9296f402c6e7d7b648937b72b13a6f5756c/docs%2Finternals%2Frelease-process.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Frelease-process.txt?ref=329bb9296f402c6e7d7b648937b72b13a6f5756c",
            "patch": "@@ -198,15 +198,15 @@ and an rc complete with string freeze two weeks before the end of the schedule.\n Bug-fix releases\n ----------------\n \n-After a minor release (e.g. 1.1), the previous release will go into bug-fix\n+After a minor release (e.g. 1.1), the previous release will go into bugfix\n mode.\n \n A branch will be created of the form ``branches/releases/1.0.X`` to track\n-bug-fixes to the previous release. Critical bugs fixed on trunk must\n-*also* be fixed on the bug-fix branch; this means that commits need to cleanly\n+bugfixes to the previous release. Critical bugs fixed on trunk must\n+*also* be fixed on the bugfix branch; this means that commits need to cleanly\n separate bug fixes from feature additions. The developer who commits a fix to\n-trunk will be responsible for also applying the fix to the current bug-fix\n-branch.  Each bug-fix branch will have a maintainer who will work with the\n+trunk will be responsible for also applying the fix to the current bugfix\n+branch.  Each bugfix branch will have a maintainer who will work with the\n committers to keep them honest on backporting bug fixes.\n \n How this all fits together"
        },
        {
            "sha": "2a2554432eb0ad05f4025a3bc7a22e28f2866f03",
            "filename": "docs/releases/1.0-beta-2.txt",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/django/django/blob/329bb9296f402c6e7d7b648937b72b13a6f5756c/docs%2Freleases%2F1.0-beta-2.txt",
            "raw_url": "https://github.com/django/django/raw/329bb9296f402c6e7d7b648937b72b13a6f5756c/docs%2Freleases%2F1.0-beta-2.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Freleases%2F1.0-beta-2.txt?ref=329bb9296f402c6e7d7b648937b72b13a6f5756c",
            "patch": "@@ -69,7 +69,7 @@ the remaining features to be implemented for Django 1.0, and on the\n bugs that need to be resolved before the final release. As of this\n beta release, Django is in its final \"feature freeze\" for 1.0; feature\n requests will be deferred to later releases, and the development\n-effort will be focused solely on bug-fixing and stability. Django is\n+effort will be focused solely on bugfixing and stability. Django is\n also now in a \"string freeze\"; translatable strings (labels, error\n messages, etc.) in Django's codebase will not be changed prior to the\n release, in order to allow our translators to produce the final 1.0"
        },
        {
            "sha": "2a612ed11f02001dc4c9b92f131c9df57e0649ff",
            "filename": "docs/releases/1.3.txt",
            "status": "modified",
            "additions": 1,
            "deletions": 1,
            "changes": 2,
            "blob_url": "https://github.com/django/django/blob/329bb9296f402c6e7d7b648937b72b13a6f5756c/docs%2Freleases%2F1.3.txt",
            "raw_url": "https://github.com/django/django/raw/329bb9296f402c6e7d7b648937b72b13a6f5756c/docs%2Freleases%2F1.3.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Freleases%2F1.3.txt?ref=329bb9296f402c6e7d7b648937b72b13a6f5756c",
            "patch": "@@ -830,7 +830,7 @@ now pending deprecation.\n ~~~~~~~~~~~~~~~~\n \n Previously, ``django.http`` exposed an undocumented ``CompatCookie`` class,\n-which was a bug-fix wrapper around the standard library ``SimpleCookie``. As the\n+which was a bugfix wrapper around the standard library ``SimpleCookie``. As the\n fixes are moving upstream, this is now deprecated - you should use ``from\n django.http import SimpleCookie`` instead.\n "
        }
    ],
    "stats": {
        "total": 350,
        "additions": 199,
        "deletions": 151
    }
}