{
    "author": "jezdez",
    "message": "Fixed #16248 -- Corrected a few typos in the security docs. Thanks, buddelkiste.\n\ngit-svn-id: http://code.djangoproject.com/svn/django/trunk@16397 bcc190cf-cafb-0310-a4f2-bffc1f526a37",
    "sha": "3ee076b1355f888133b9f5915e9118066ee2acc1",
    "files": [
        {
            "sha": "3940c0836a9c7a451998ba8ccc86433718d60a09",
            "filename": "docs/topics/security.txt",
            "status": "modified",
            "additions": 5,
            "deletions": 5,
            "changes": 10,
            "blob_url": "https://github.com/django/django/blob/3ee076b1355f888133b9f5915e9118066ee2acc1/docs%2Ftopics%2Fsecurity.txt",
            "raw_url": "https://github.com/django/django/raw/3ee076b1355f888133b9f5915e9118066ee2acc1/docs%2Ftopics%2Fsecurity.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Ftopics%2Fsecurity.txt?ref=3ee076b1355f888133b9f5915e9118066ee2acc1",
            "patch": "@@ -13,7 +13,7 @@ Cross site scripting (XSS) protection\n .. highlightlang:: html+django\n \n XSS attacks allow a user to inject client side scripts into the\n-browsers of other users. This is usually acheived by storing the malicious\n+browsers of other users. This is usually achieved by storing the malicious\n scripts to the database where it will be retrieved and displayed to other users\n or to get users to click a link containing variables containing scripts that\n will be rendered by the user's browser. However, XSS attacks can originate\n@@ -25,7 +25,7 @@ and its limitations.\n \n Django templates :ref:`escape specific characters <automatic-html-escaping>`\n which are particularly dangerous to HTML. While this protects users from most\n-malications input, it is not entirely foolproof. For example, it will not\n+malicious input, it is not entirely foolproof. For example, it will not\n protect the following:\n \n .. code-block:: html+django\n@@ -97,7 +97,7 @@ Django contains :ref:`clickjacking protection <clickjacking-prevention>` in\n the form of the\n :mod:`X-Frame-Options middleware <django.middleware.clickjacking.XFrameOptionsMiddleware>`\n which in a supporting browser can prevent a site from being rendered inside\n-of a frame. It is possible to disable the protection on a per view basis\n+a frame. It is possible to disable the protection on a per view basis\n or to configure the exact header value sent.\n \n The middleware is strongly recommended for any site that does not need to have\n@@ -139,7 +139,7 @@ information is not leaked:\n   :setting:`CSRF_COOKIE_SECURE` settings to ``True``. This instructs the browser\n   to only send these cookies over HTTPS connections. Note that this will mean\n   that sessions will not work over HTTP, and the CSRF protection will prevent\n-  any data POST data being accepted over HTTP (which will be fine if you are\n+  any POST data being accepted over HTTP (which will be fine if you are\n   redirecting all HTTP traffic to HTTPS).\n \n .. _additional-security-topics:\n@@ -157,7 +157,7 @@ security protection of the web server, operating system and other components.\n   brute-force attacks against the authentication system, you may consider\n   deploying a Django plugin or web server module to throttle these requests.\n * If your site accepts file uploads, it is strongly advised that you limit\n-  the these uploads in your web server configuration to a reasonable\n+  these uploads in your web server configuration to a reasonable\n   size in order to prevent denial of service (DOS) attacks. In Apache, this\n   can be easily set using the LimitRequestBody_ directive.\n * Keep your :setting:`SECRET_KEY` a secret."
        }
    ],
    "stats": {
        "total": 10,
        "additions": 5,
        "deletions": 5
    }
}