{
    "author": "jezdez",
    "message": "Fixed #15796 -- Restructured the contributing documentation and added note about newly added Trac abilities. Many thanks to Julien Phalip.\n\ngit-svn-id: http://code.djangoproject.com/svn/django/trunk@16284 bcc190cf-cafb-0310-a4f2-bffc1f526a37",
    "sha": "407f62fd31689b6158902d3ffdcde64aa27679a7",
    "files": [
        {
            "sha": "5d17ae69aa1f75f7f837e1891b3c436f125b9773",
            "filename": "docs/howto/contribute.txt",
            "status": "removed",
            "additions": 0,
            "deletions": 321,
            "changes": 321,
            "blob_url": "https://github.com/django/django/blob/69cfee2f167f64c15de6bfcd6b9779534132db2f/docs%2Fhowto%2Fcontribute.txt",
            "raw_url": "https://github.com/django/django/raw/69cfee2f167f64c15de6bfcd6b9779534132db2f/docs%2Fhowto%2Fcontribute.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Fhowto%2Fcontribute.txt?ref=69cfee2f167f64c15de6bfcd6b9779534132db2f",
            "patch": "@@ -1,321 +0,0 @@\n-===========================\n-How to contribute to Django\n-===========================\n-\n-Django is developed 100% by the community, and the more people that are actively\n-involved in the code the better Django will be. We recognize that contributing\n-to Django can be daunting at first and sometimes confusing even to\n-veterans. While we have our official \"Contributing to Django\" documentation\n-which spells out the technical details of triaging tickets and submitting\n-patches, it leaves a lot of room for interpretation. This guide aims to offer\n-more general advice on issues such as how to interpret the various stages and\n-flags in Trac, and how new contributors can get started.\n-\n-.. seealso::\n-\n-    This guide is meant to answer the most common questions about\n-    contributing to Django, however it is no substitute for the\n-    :doc:`/internals/contributing` reference. Please make sure to\n-    read that document to understand the specific details\n-    involved in reporting issues and submitting patches.\n-\n-.. _the-spirit-of-contributing:\n-\n-\"The Spirit of Contributing\"\n-============================\n-\n-Django uses Trac_ for managing our progress, and Trac is a community-tended\n-garden of the bugs people have found and the features people would like to see\n-added. As in any garden, sometimes there are weeds to be pulled and sometimes\n-there are flowers and vegetables that need picking. We need your help to sort\n-out one from the other, and in the end we all benefit together.\n-\n-Like all gardens, we can aspire to perfection but in reality there's no such\n-thing. Even in the most pristine garden there are still snails and insects. In a\n-community garden there are also helpful people who--with the best of\n-intentions--fertilize the weeds and poison the roses. It's the job of the\n-community as a whole to self-manage, keep the problems to a minimum, and educate\n-those coming into the community so that they can become valuable contributing\n-members.\n-\n-Similarly, while we aim for Trac to be a perfect representation of the state of\n-Django's progress, we acknowledge that this simply will not happen. By\n-distributing the load of Trac maintenance to the community, we accept that there\n-will be mistakes. Trac is \"mostly accurate\", and we give allowances for the fact\n-that sometimes it will be wrong. That's okay. We're perfectionists with\n-deadlines.\n-\n-We rely on the community to keep participating, keep tickets as accurate as\n-possible, and raise issues for discussion on our mailing lists when there is\n-confusion or disagreement.\n-\n-Django is a community project, and every contribution helps. We can't do this\n-without YOU!\n-\n-.. _Trac: http://code.djangoproject.com/\n-\n-Understanding Trac\n-==================\n-\n-Trac is Django's sole official issue tracker. All known bugs, desired features\n-and ideas for changes are logged there.\n-\n-However, Trac can be quite confusing even to veteran contributors.  Having to\n-look at both flags and triage stages isn't immediately obvious, and the stages\n-themselves can be misinterpreted.\n-\n-.. _triage-stages-explained:\n-\n-What Django's triage stages \"really mean\"\n------------------------------------------\n-\n-Unreviewed\n-~~~~~~~~~~\n-\n-The ticket has not been reviewed by anyone who felt qualified to make a judgment\n-about whether the ticket contained a valid issue, a viable feature, or ought to\n-be closed for any of the various reasons.\n-\n-Accepted\n-~~~~~~~~\n-\n-The big grey area! The absolute meaning of \"accepted\" is that the issue\n-described in the ticket is valid and is in some stage of being worked on. Beyond\n-that there are several considerations\n-\n-\n-* **Accepted + No Flags**\n-\n-  The ticket is valid, but no one has submitted a patch for it yet. Often this\n-  means you could safely start writing a patch for it.\n-\n-* **Accepted + Has Patch**\n-\n-  The ticket is waiting for people to review the supplied patch. This means\n-  downloading the patch and trying it out, verifying that it contains tests and\n-  docs, running the test suite with the included patch, and leaving feedback on\n-  the ticket.\n-\n-\n-* **Accepted + Has Patch + (any other flag)**\n-\n-  This means the ticket has been reviewed, and has been found to need further\n-  work. \"Needs tests\" and \"Needs documentation\" are self-explanatory. \"Patch\n-  needs improvement\" will generally be accompanied by a comment on the ticket\n-  explaining what is needed to improve the code.\n-\n-Design Decision Needed\n-~~~~~~~~~~~~~~~~~~~~~~\n-\n-This stage is for issues which may be contentious, may be backwards\n-incompatible, or otherwise involve high-level design decisions. These decisions\n-are generally made by the core committers, however that is not a\n-requirement. See the FAQ below for \"My ticket has been in DDN forever!  What\n-should I do?\"\n-\n-Ready For Checkin\n-~~~~~~~~~~~~~~~~~\n-\n-The ticket was reviewed by any member of the community other than the person who\n-supplied the patch and found to meet all the requirements for a commit-ready\n-patch. A core committer now needs to give the patch a final review prior to\n-being committed. See the FAQ below for \"My ticket has been in RFC forever!  What\n-should I do?\"\n-\n-Someday/Maybe?\n-~~~~~~~~~~~~~~\n-\n-Generally only used for vague/high-level features or design ideas. These tickets\n-are uncommon and overall less useful since they don't describe concrete\n-actionable issues.\n-\n-Fixed on a branch\n-~~~~~~~~~~~~~~~~~\n-\n-Used to indicate that a ticket is resolved as part of a major body of work that\n-will eventually be merged to trunk.  Tickets in this stage generally don't need\n-further work. This may happen in the case of major features/refactors in each\n-release cycle, or as part of the annual Google Summer of Code efforts.\n-\n-.. _closing-tickets:\n-\n-Closing Tickets\n----------------\n-\n-When a ticket has completed its useful lifecycle, it's time for it to be closed.\n-Closing a ticket is a big responsibility, though. You have to be sure that\n-the issue is really resolved, and you need to keep in mind that the reporter\n-of the ticket may not be happy to have their ticket closed (unless it's fixed,\n-of course). If you're not certain about closing a ticket, just leave a comment\n-with your thoughts instead.\n-\n-If you do close a ticket, you should always make sure of the following:\n-\n-  * Be certain that the issue is resolved.\n-\n-  * Leave a comment explaining the decision to close the ticket.\n-\n-  * If there is a way they can improve the ticket to reopen it, let them know.\n-\n-  * If the ticket is a duplicate, reference the original ticket.\n-\n-  * **Be polite.** No one likes having their ticket closed. It can be\n-    frustrating or even discouraging. The best way to avoid turning people\n-    off from contributing to Django is to be polite and friendly and to offer\n-    suggestions for how they could improve this ticket and other tickets in the\n-    future.\n-\n-.. seealso::\n-\n-    The :ref:`contributing reference <ticket-resolutions>` contains a\n-    description of each of the available resolutions in Trac.\n-\n-Example Trac workflow\n----------------------\n-\n-Here we see the life-cycle of an average ticket:\n-\n-* Alice creates a ticket, and uploads an incomplete patch (no tests, incorrect\n-  implementation).\n-\n-* Bob reviews the patch, marks it \"Accepted\", \"needs tests\", and \"patch needs\n-  improvement\", and leaves a comment telling Alice how the patch could be\n-  improved.\n-\n-* Alice updates the patch, adding tests (but not changing the\n-  implementation). She removes the two flags.\n-\n-* Charlie reviews the patch and resets the \"patch needs improvement\" flag with\n-  another comment about improving the implementation.\n-\n-* Alice updates the patch, fixing the implementation. She removes the \"patch\n-  needs improvement\" flag.\n-\n-* Daisy reviews the patch, and marks it RFC.\n-\n-* Jacob reviews the RFC patch, applies it to his checkout, and commits it.\n-\n-Some tickets require much less feedback than this, but then again some tickets\n-require much much more.\n-\n-Advice for new contributors\n-===========================\n-\n-New contributor and not sure what to do? Want to help but just don't know how to\n-get started? This is the section for you.\n-\n-* **Pick a subject area that you care about, that you are familiar with, or that\n-  you want to learn about.**\n-\n-  You don't already have to be an expert on the area you want to work on; you\n-  become an expert through your ongoing contributions to the code.\n-\n-* **Triage tickets.**\n-\n-  If a ticket is unreviewed and reports a bug, try and duplicate it.  If you can\n-  duplicate it and it seems valid, make a note that you confirmed the bug and\n-  accept the ticket. Make sure the ticket is filed under the correct component\n-  area. Consider writing a patch that adds a test for the bug's behavior, even\n-  if you don't fix the bug itself.\n-\n-* **Look for tickets that are accepted and review patches to build familiarity\n-  with the codebase and the process.**\n-\n-  Mark the appropriate flags if a patch needs docs or tests. Look through the\n-  changes a patch makes, and keep an eye out for syntax that is incompatible\n-  with older but still supported versions of Python. Run the tests and make sure\n-  they pass on your system.  Where possible and relevant, try them out on a\n-  database other than SQLite. Leave comments and feedback!\n-\n-* **Keep old patches up to date.**\n-\n-  Oftentimes the codebase will change between a patch being submitted and the\n-  time it gets reviewed. Make sure it still applies cleanly and functions as\n-  expected. Simply updating a patch is both useful and important!\n-\n-* **Trac isn't an absolute; the context is just as important as the words.**\n-\n-  When reading Trac, you need to take into account who says things, and when\n-  they were said. Support for an idea two years ago doesn't necessarily mean\n-  that the idea will still have support. You also need to pay attention to who\n-  *hasn't* spoken -- for example, if a core team member hasn't been recently\n-  involved in a discussion, then a ticket may not have the support required to\n-  get into trunk.\n-\n-* **Start small.**\n-\n-  It's easier to get feedback on a little issue than on a big one.\n-\n-* **If you're going to engage in a big task, make sure that your idea has\n-  support first.**\n-\n-  This means getting someone else to confirm that a bug is real before you fix\n-  the issue, and ensuring that the core team supports a proposed feature before\n-  you go implementing it.\n-\n-* **Be bold! Leave feedback!**\n-\n-  Sometimes it can be scary to put your opinion out to the world and say \"this\n-  ticket is correct\" or \"this patch needs work\", but it's the only way the\n-  project moves forward. The contributions of the broad Django community\n-  ultimately have a much greater impact than that of the core developers. We\n-  can't do it without YOU!\n-\n-* **Err on the side of caution when marking things Ready For Check-in.**\n-\n-  If you're really not certain if a ticket is ready, don't mark it as\n-  such. Leave a comment instead, letting others know your thoughts.  If you're\n-  mostly certain, but not completely certain, you might also try asking on IRC\n-  to see if someone else can confirm your suspicions.\n-\n-* **Wait for feedback, and respond to feedback that you receive.**\n-\n-  Focus on one or two tickets, see them through from start to finish, and\n-  repeat. The shotgun approach of taking on lots of tickets and letting some\n-  fall by the wayside ends up doing more harm than good.\n-\n-* **Be rigorous.**\n-\n-  When we say \":pep:`8`, and must have docs and tests\", we mean it. If a patch\n-  doesn't have docs and tests, there had better be a good reason. Arguments like\n-  \"I couldn't find any existing tests of this feature\" don't carry much\n-  weight--while it may be true, that means you have the extra-important job of\n-  writing the very first tests for that feature, not that you get a pass from\n-  writing tests altogether.\n-\n-.. note::\n-\n-    The `Reports page`_ contains links to many useful Trac queries, including\n-    several that are useful for triaging tickets and reviewing patches as\n-    suggested above.\n-\n-    .. _Reports page: http://code.djangoproject.com/wiki/Reports\n-\n-\n-FAQs\n-====\n-\n-**This ticket I care about has been ignored for days/weeks/months! What can I do\n-to get it committed?**\n-\n-* First off, it's not personal. Django is entirely developed by volunteers (even\n-  the core devs), and sometimes folks just don't have time. The best thing to do\n-  is to send a gentle reminder to the Django Developers mailing list asking for\n-  review on the ticket, or to bring it up in the #django-dev IRC channel.\n-\n-\n-**I'm sure my ticket is absolutely 100% perfect, can I mark it as RFC myself?**\n-\n-* Short answer: No. It's always better to get another set of eyes on a\n-  ticket. If you're having trouble getting that second set of eyes, see question\n-  1, above.\n-\n-\n-**My ticket has been in DDN forever! What should I do?**\n-\n-* Design Decision Needed requires consensus about the right solution.  At the\n-  very least it needs consensus among the core developers, and ideally it has\n-  consensus from the community as well. The best way to accomplish this is to\n-  start a thread on the Django Developers mailing list, and for very complex\n-  issues to start a wiki page summarizing the problem and the possible\n-  solutions."
        },
        {
            "sha": "49d06440343a3eaccabb755215d50ea00e0b4a1c",
            "filename": "docs/howto/index.txt",
            "status": "modified",
            "additions": 0,
            "deletions": 1,
            "changes": 1,
            "blob_url": "https://github.com/django/django/blob/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Fhowto%2Findex.txt",
            "raw_url": "https://github.com/django/django/raw/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Fhowto%2Findex.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Fhowto%2Findex.txt?ref=407f62fd31689b6158902d3ffdcde64aa27679a7",
            "patch": "@@ -11,7 +11,6 @@ you quickly accomplish common tasks.\n \n    apache-auth\n    auth-remote-user\n-   contribute\n    custom-management-commands\n    custom-model-fields\n    custom-template-tags"
        },
        {
            "sha": "2c090d98c56e1bb7728d4e8bee3a58c686249f59",
            "filename": "docs/index.txt",
            "status": "modified",
            "additions": 2,
            "deletions": 2,
            "changes": 4,
            "blob_url": "https://github.com/django/django/blob/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Findex.txt",
            "raw_url": "https://github.com/django/django/raw/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Findex.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Findex.txt?ref=407f62fd31689b6158902d3ffdcde64aa27679a7",
            "patch": "@@ -200,7 +200,7 @@ The Django open-source project\n ==============================\n \n     * **Community:**\n-      :doc:`How to get involved <internals/contributing>` |\n+      :doc:`How to get involved <internals/contributing/index>` |\n       :doc:`The release process <internals/release-process>` |\n       :doc:`Team of committers <internals/committers>` |\n       :doc:`The Django source code repository <internals/svn>`\n@@ -209,7 +209,7 @@ The Django open-source project\n       :doc:`Overview <misc/design-philosophies>`\n \n     * **Documentation:**\n-      :doc:`About this documentation <internals/documentation>`\n+      :doc:`About this documentation <internals/contributing/writing-documentation>`\n \n     * **Third-party distributions:**\n       :doc:`Overview <misc/distributions>`"
        },
        {
            "sha": "7b727d6cfd94e8b82c2fd7e6bb572ce2a92ffa43",
            "filename": "docs/internals/committers.txt",
            "status": "modified",
            "additions": 2,
            "deletions": 0,
            "changes": 2,
            "blob_url": "https://github.com/django/django/blob/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcommitters.txt",
            "raw_url": "https://github.com/django/django/raw/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcommitters.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcommitters.txt?ref=407f62fd31689b6158902d3ffdcde64aa27679a7",
            "patch": "@@ -58,6 +58,8 @@ Current developers\n \n Currently, Django is led by a team of volunteers from around the globe.\n \n+.. _django-bdfls:\n+\n BDFLs\n -----\n "
        },
        {
            "sha": "4e2bad91ad2c7b9cb4abead37b9d2be5a86d14de",
            "filename": "docs/internals/contributing.txt",
            "status": "removed",
            "additions": 0,
            "deletions": 1377,
            "changes": 1377,
            "blob_url": "https://github.com/django/django/blob/69cfee2f167f64c15de6bfcd6b9779534132db2f/docs%2Finternals%2Fcontributing.txt",
            "raw_url": "https://github.com/django/django/raw/69cfee2f167f64c15de6bfcd6b9779534132db2f/docs%2Finternals%2Fcontributing.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing.txt?ref=69cfee2f167f64c15de6bfcd6b9779534132db2f",
            "patch": "@@ -1,1377 +0,0 @@\n-======================\n-Contributing to Django\n-======================\n-\n-If you think working *with* Django is fun, wait until you start working *on*\n-it. We're passionate about helping Django users make the jump to contributing\n-members of the community, so there are many ways you can help Django's\n-development:\n-\n-    * Blog about Django. We syndicate all the Django blogs we know about on\n-      the `community page`_; contact jacob@jacobian.org if you've got a blog\n-      you'd like to see on that page.\n-\n-    * Report bugs and request features in our `ticket tracker`_. Please read\n-      `Reporting bugs`_, below, for the details on how we like our bug reports\n-      served up.\n-\n-    * Submit patches for new and/or fixed behavior. Please read `Submitting\n-      patches`_, below, for details on how to submit a patch. If you're looking\n-      for an easy way to start contributing to Django have a look at the\n-      `easy-pickings`_ tickets.\n-\n-    * Join the `django-developers`_ mailing list and share your ideas for how\n-      to improve Django. We're always open to suggestions, although we're\n-      likely to be skeptical of large-scale suggestions without some code to\n-      back it up.\n-\n-    * Triage patches that have been submitted by other users. Please read\n-      `Ticket triage`_ below, for details on the triage process.\n-\n-That's all you need to know if you'd like to join the Django development\n-community. The rest of this document describes the details of how our community\n-works and how it handles bugs, mailing lists, and all the other minutiae of\n-Django development.\n-\n-.. seealso::\n-\n-    This document contains specific details for contributing to\n-    Django. However, many new contributors find this guide confusing\n-    or intimidating at first. For a simpler introduction\n-    to becoming a contributor please see the :doc:`/howto/contribute` guide.\n-\n-.. _reporting-bugs:\n-\n-Reporting bugs\n-==============\n-\n-Well-written bug reports are *incredibly* helpful. However, there's a certain\n-amount of overhead involved in working with any bug tracking system so your\n-help in keeping our ticket tracker as useful as possible is appreciated. In\n-particular:\n-\n-    * **Do** read the :doc:`FAQ </faq/index>` to see if your issue might\n-      be a well-known question.\n-\n-    * **Do** `search the tracker`_ to see if your issue has already been filed.\n-\n-    * **Do** ask on `django-users`_ *first* if you're not sure if what you're\n-      seeing is a bug.\n-\n-    * **Do** write complete, reproducible, specific bug reports. Include as\n-      much information as you possibly can, complete with code snippets, test\n-      cases, etc. This means including a clear, concise description of the\n-      problem, and a clear set of instructions for replicating the problem.\n-      A minimal example that illustrates the bug in a nice small test case\n-      is the best possible bug report.\n-\n-    * **Don't** use the ticket system to ask support questions. Use the\n-      `django-users`_ list, or the `#django`_ IRC channel for that.\n-\n-    * **Don't** use the ticket system to make large-scale feature requests.\n-      We like to discuss any big changes to Django's core on the\n-      `django-developers`_ list before actually working on them.\n-\n-    * **Don't** reopen issues that have been marked \"wontfix\". This mark\n-      means that the decision has been made that we can't or won't fix\n-      this particular issue. If you're not sure why, please ask\n-      on `django-developers`_.\n-\n-    * **Don't** use the ticket tracker for lengthy discussions, because they're\n-      likely to get lost. If a particular ticket is controversial, please move\n-      discussion to `django-developers`_.\n-\n-    * **Don't** post to django-developers just to announce that you have filed\n-      a bug report. All the tickets are mailed to another list\n-      (`django-updates`_), which is tracked by developers and interested\n-      community members; we see them as they are filed.\n-\n-.. _django-updates: http://groups.google.com/group/django-updates\n-\n-.. _reporting-security-issues:\n-\n-Reporting security issues\n-=========================\n-\n-Report security issues to security@djangoproject.com. This is a private list\n-only open to long-time, highly trusted Django developers, and its archives are\n-not publicly readable.\n-\n-In the event of a confirmed vulnerability in Django itself, we will take the\n-following actions:\n-\n-    * Acknowledge to the reporter that we've received the report and that a\n-      fix is forthcoming. We'll give a rough timeline and ask the reporter\n-      to keep the issue confidential until we announce it.\n-\n-    * Focus on developing a fix as quickly as possible and produce patches\n-      against the current and two previous releases.\n-\n-    * Determine a go-public date for announcing the vulnerability and the fix.\n-      To try to mitigate a possible \"arms race\" between those applying the\n-      patch and those trying to exploit the hole, we will not announce\n-      security problems immediately.\n-\n-    * Pre-notify third-party distributors of Django (\"vendors\"). We will send\n-      these vendor notifications through private email which will include\n-      documentation of the vulnerability, links to the relevant patch(es), and a\n-      request to keep the vulnerability confidential until the official\n-      go-public date.\n-\n-    * Publicly announce the vulnerability and the fix on the pre-determined\n-      go-public date. This will probably mean a new release of Django, but\n-      in some cases it may simply be patches against current releases.\n-\n-Submitting patches\n-==================\n-\n-We're always grateful for patches to Django's code. Indeed, bug reports\n-with associated patches will get fixed *far* more quickly than those\n-without patches.\n-\n-\"Claiming\" tickets\n-------------------\n-\n-In an open-source project with hundreds of contributors around the world, it's\n-important to manage communication efficiently so that work doesn't get\n-duplicated and contributors can be as effective as possible. Hence, our policy\n-is for contributors to \"claim\" tickets in order to let other developers know\n-that a particular bug or feature is being worked on.\n-\n-If you have identified a contribution you want to make and you're capable of\n-fixing it (as measured by your coding ability, knowledge of Django internals\n-and time availability), claim it by following these steps:\n-\n-    * `Create an account`_ to use in our ticket system.\n-\n-    * If a ticket for this issue doesn't exist yet, create one in our\n-      `ticket tracker`_.\n-\n-    * If a ticket for this issue already exists, make sure nobody else has\n-      claimed it. To do this, look at the \"Assigned to\" section of the ticket.\n-      If it's assigned to \"nobody,\" then it's available to be claimed.\n-      Otherwise, somebody else is working on this ticket, and you either find\n-      another bug/feature to work on, or contact the developer working on the\n-      ticket to offer your help.\n-\n-    * Log into your account, if you haven't already, by clicking \"Login\" in the\n-      upper right of the ticket page.\n-\n-    * Claim the ticket by clicking the radio button next to \"Accept ticket\"\n-      near the bottom of the page, then clicking \"Submit changes.\"\n-\n-If you have an account but have forgotten your password, you can reset it\n-using the `password reset page`_.\n-\n-.. _Create an account: http://www.djangoproject.com/accounts/register/\n-.. _password reset page: http://www.djangoproject.com/accounts/password/reset/\n-\n-Ticket claimers' responsibility\n-~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n-\n-Once you've claimed a ticket, you have a responsibility to work on that ticket\n-in a reasonably timely fashion. If you don't have time to work on it, either\n-unclaim it or don't claim it in the first place!\n-\n-If there's no sign of progress on a particular claimed ticket for a week or\n-two, another developer may ask you to relinquish the ticket claim so that it's\n-no longer monopolized and somebody else can claim it.\n-\n-If you've claimed a ticket and it's taking a long time (days or weeks) to code,\n-keep everybody updated by posting comments on the ticket. If you don't provide\n-regular updates, and you don't respond to a request for a progress report,\n-your claim on the ticket may be revoked. As always, more communication is\n-better than less communication!\n-\n-Which tickets should be claimed?\n-~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n-\n-Of course, going through the steps of claiming tickets is overkill in some\n-cases. In the case of small changes, such as typos in the documentation or\n-small bugs that will only take a few minutes to fix, you don't need to jump\n-through the hoops of claiming tickets. Just submit your patch and be done with\n-it.\n-\n-Patch style\n------------\n-\n-    * Make sure your code matches our `coding style`_.\n-\n-    * Submit patches in the format returned by the ``svn diff`` command.\n-      An exception is for code changes that are described more clearly in\n-      plain English than in code. Indentation is the most common example; it's\n-      hard to read patches when the only difference in code is that it's\n-      indented.\n-\n-      Patches in ``git diff`` format are also acceptable.\n-\n-    * When creating patches, always run ``svn diff`` from the top-level\n-      ``trunk`` directory -- i.e., the one that contains ``django``, ``docs``,\n-      ``tests``, ``AUTHORS``, etc. This makes it easy for other people to\n-      apply your patches.\n-\n-    * Attach patches to a ticket in the `ticket tracker`_, using the \"attach\n-      file\" button. Please *don't* put the patch in the ticket description\n-      or comment unless it's a single line patch.\n-\n-    * Name the patch file with a ``.diff`` extension; this will let the ticket\n-      tracker apply correct syntax highlighting, which is quite helpful.\n-\n-    * Check the \"Has patch\" box on the ticket details. This will make it\n-      obvious that the ticket includes a patch, and it will add the ticket to\n-      the `list of tickets with patches`_.\n-\n-    * The code required to fix a problem or add a feature is an essential part\n-      of a patch, but it is not the only part. A good patch should also include\n-      a regression test to validate the behavior that has been fixed\n-      (and prevent the problem from arising again).\n-\n-    * If the code associated with a patch adds a new feature, or modifies\n-      behavior of an existing feature, the patch should also contain\n-      documentation.\n-\n-Non-trivial patches\n--------------------\n-\n-A \"non-trivial\" patch is one that is more than a simple bug fix. It's a patch\n-that introduces Django functionality and makes some sort of design decision.\n-\n-If you provide a non-trivial patch, include evidence that alternatives have\n-been discussed on `django-developers`_. If you're not sure whether your patch\n-should be considered non-trivial, just ask.\n-\n-Ticket triage\n-=============\n-\n-Unfortunately, not all bug reports in the `ticket tracker`_ provide all\n-the `required details`_. A number of tickets have patches, but those patches\n-don't meet all the requirements of a `good patch`_.\n-\n-One way to help out is to *triage* bugs that have been reported by other\n-users. The core team--as well as many community members--work on this\n-regularly, but more help is always appreciated.\n-\n-Most of the workflow is based around the concept of a ticket's \"triage stage\".\n-This stage describes where in its lifetime a given ticket is at any time.\n-Along with a handful of flags, this field easily tells us what and who each\n-ticket is waiting on.\n-\n-Since a picture is worth a thousand words, let's start there:\n-\n-.. image:: _images/djangotickets.png\n-   :height: 451\n-   :width: 590\n-   :alt: Django's ticket workflow\n-\n-We've got two roles in this diagram:\n-\n-    * Core developers: people with commit access who are responsible for\n-      making the big decisions, writing large portions of the code and\n-      integrating the contributions of the community.\n-\n-    * Ticket triagers: anyone in the Django community who chooses to\n-      become involved in Django's development process. Our Trac installation\n-      is :ref:`intentionally left open to the public\n-      <the-spirit-of-contributing>`, and anyone can triage tickets.\n-      Django is a community project, and we encourage `triage by the\n-      community`_.\n-\n-Triage stages\n--------------\n-\n-Second, note the five triage stages:\n-\n-    1. A ticket starts as **Unreviewed**, meaning that nobody has examined\n-       the ticket.\n-\n-    2. **Design decision needed** means \"this concept requires a design\n-       decision,\" which should be discussed either in the ticket comments or on\n-       `django-developers`_. The \"Design decision needed\" step will generally\n-       only be used for feature requests. It can also be used for issues\n-       that *might* be bugs, depending on opinion or interpretation. Obvious\n-       bugs (such as crashes, incorrect query results, or non-compliance with a\n-       standard) skip this step and move straight to \"Accepted\".\n-\n-    3. Once a ticket is ruled to be approved for fixing, it's moved into the\n-       **Accepted** stage. This stage is where all the real work gets done.\n-\n-    4. In some cases, a ticket might get moved to the **Someday/Maybe** state.\n-       This means the ticket is an enhancement request that we might consider\n-       adding to the framework if an excellent patch is submitted. These\n-       tickets are not a high priority.\n-\n-    5. If a ticket has an associated patch (see below), it will be reviewed\n-       by the community. If the patch is complete, it'll be marked as **Ready\n-       for checkin** so that a core developer knows to review and commit the\n-       patch.\n-\n-The second part of this workflow involves a set of flags the describe what the\n-ticket has or needs in order to be \"ready for checkin\":\n-\n-    \"Has patch\"\n-        This means the ticket has an associated patch_. These will be\n-        reviewed to see if the patch is \"good\".\n-\n-    \"Needs documentation\"\n-        This flag is used for tickets with patches that need associated\n-        documentation. Complete documentation of features is a prerequisite\n-        before we can check them into the codebase.\n-\n-    \"Needs tests\"\n-        This flags the patch as needing associated unit tests. Again, this is a\n-        required part of a valid patch.\n-\n-    \"Patch needs improvement\"\n-        This flag means that although the ticket *has* a patch, it's not quite\n-        ready for checkin. This could mean the patch no longer applies\n-        cleanly, there is a flaw in the implementation, or that the code\n-        doesn't meet our standards.\n-\n-.. seealso::\n-\n-    The :ref:`contributing howto guide <triage-stages-explained>` has a detailed\n-    explanation of each of the triage stages and how the triage process works in\n-    Trac.\n-\n-.. _ticket-resolutions:\n-\n-Ticket Resolutions\n-------------------\n-\n-A ticket can be resolved in a number of ways:\n-\n-    \"fixed\"\n-        Used by the core developers once a patch has been rolled into\n-        Django and the issue is fixed.\n-\n-    \"invalid\"\n-        Used if the ticket is found to be incorrect. This means that the\n-        issue in the ticket is actually the result of a user error, or\n-        describes a problem with something other than Django, or isn't\n-        a bug report or feature request at all (for example, some new users\n-        submit support queries as tickets).\n-\n-    \"wontfix\"\n-        Used when a core developer decides that this request is not\n-        appropriate for consideration in Django. This is usually chosen after\n-        discussion in the ``django-developers`` mailing list. Feel free to\n-        start or join in discussions of \"wontfix\" tickets on the mailing list,\n-        but please do not reopen tickets closed as \"wontfix\" by core\n-        developers.\n-\n-    \"duplicate\"\n-        Used when another ticket covers the same issue. By closing duplicate\n-        tickets, we keep all the discussion in one place, which helps everyone.\n-\n-    \"worksforme\"\n-        Used when the ticket doesn't contain enough detail to replicate\n-        the original bug.\n-\n-    \"needsinfo\"\n-        Used when the ticket does not contain enough information to replicate\n-        the reported issue but is potentially still valid. The ticket\n-        should be reopened when more information is supplied.\n-\n-If you believe that the ticket was closed in error -- because you're\n-still having the issue, or it's popped up somewhere else, or the triagers have\n-made a mistake -- please reopen the ticket and provide further information.\n-Please do not reopen tickets that have been marked as \"wontfix\" by core\n-developers.\n-\n-.. seealso::\n-\n-    For more information on what to do when closing a ticket, please see the\n-    :ref:`contributing howto guide <closing-tickets>`.\n-\n-.. _required details: `Reporting bugs`_\n-.. _good patch: `Patch style`_\n-.. _triage by the community: `Triage by the general community`_\n-.. _patch: `Submitting patches`_\n-\n-Triage by the general community\n--------------------------------\n-\n-Although the core developers make the big decisions in the ticket triage\n-process, there's a lot that general community members can do to help the\n-triage process. In particular, you can help out by:\n-\n-    * Closing \"Unreviewed\" tickets as \"invalid\", \"worksforme\" or \"duplicate.\"\n-\n-    * Promoting \"Unreviewed\" tickets to \"Design decision needed\" if a design\n-      decision needs to be made, or \"Accepted\" in case of obvious bugs.\n-\n-    * Correcting the \"Needs tests\", \"Needs documentation\", or \"Has patch\"\n-      flags for tickets where they are incorrectly set.\n-\n-    * Adding the `easy-pickings`_ keyword to tickets that are small and\n-      relatively straightforward.\n-\n-    * Checking that old tickets are still valid. If a ticket hasn't seen\n-      any activity in a long time, it's possible that the problem has been\n-      fixed but the ticket hasn't yet been closed.\n-\n-    * Contacting the owners of tickets that have been claimed but have not\n-      seen any recent activity. If the owner doesn't respond after a week\n-      or so, remove the owner's claim on the ticket.\n-\n-    * Identifying trends and themes in the tickets. If there a lot of bug\n-      reports about a particular part of Django, it may indicate we should\n-      consider refactoring that part of the code. If a trend is emerging,\n-      you should raise it for discussion (referencing the relevant tickets)\n-      on `django-developers`_.\n-\n-However, we do ask the following of all general community members working in\n-the ticket database:\n-\n-    * Please **don't** close tickets as \"wontfix.\" The core developers will\n-      make the final determination of the fate of a ticket, usually after\n-      consultation with the community.\n-\n-    * Please **don't** promote your own tickets to \"Ready for checkin\". You\n-      may mark other people's tickets which you've reviewed as \"Ready for\n-      checkin\", but you should get at minimum one other community member to\n-      review a patch that you submit.\n-\n-    * Please **don't** reverse a decision that has been made by a core\n-      developer. If you disagree with a decision that has been made,\n-      please post a message to `django-developers`_.\n-\n-    * If you're unsure if you should be making a change, don't make the change\n-      but instead leave a comment with your concerns on the ticket, or\n-      post a message to `django-developers`_. It's okay to be unsure, but\n-      your input is still valuable.\n-\n-.. _contributing-translations:\n-\n-Submitting and maintaining translations\n-=======================================\n-\n-Various parts of Django, such as the admin site and validation error messages,\n-are internationalized. This means they display different text depending on a\n-user's language setting. For this, Django uses the same internationalization\n-infrastructure available to Django applications described in the\n-:doc:`i18n documentation</topics/i18n/index>`.\n-\n-These translations are contributed by Django users worldwide. If you find an\n-incorrect translation or want to discuss specific translations, go to the\n-`translation team`_ page for that language. If you would like to help out\n-with translating or add a language that isn't yet translated, here's what\n-to do:\n-\n-    * Join the `Django i18n mailing list`_ and introduce yourself.\n-\n-    * Make sure you read the notes about :ref:`specialties-of-django-i18n`.\n-\n-    * Signup at `Transifex`_ and visit the `Django project page`_.\n-\n-    * On the \"`Translation Teams`_\" page, choose the language team you want\n-      to work with, **or** -- in case the language team doesn't exist yet --\n-      request a new team by clicking on the \"Request a new team\" button\n-      and select the appropriate language.\n-\n-    * Then, click the \"Join this Team\" button to become a member of this team.\n-      Every team has at least one coordinator who is responsible to review\n-      your membership request. You can of course also contact the team\n-      coordinator to clarify procedural problems and handle the actual\n-      translation process.\n-\n-    * Once you are a member of a team choose the translation resource you\n-      want update on the team page. For example the \"core\" resource refers\n-      to the translation catalogue that contains all non-app translations.\n-      Each of the contrib apps also have a resource (prefixed with \"contrib-\").\n-\n-      .. note::\n-         For more information about how to use Transifex, see the\n-         `Transifex Help`_\n-\n-    * Optionally, review and update the ``conf/locale/<locale>/formats.py``\n-      file to describe the date, time and numbers formatting particularities\n-      of your locale. These files aren't covered by the use of Transifex and\n-      require a patch against the Django source tree, just as a code change\n-      would:\n-\n-      * Create a diff against the current Subversion trunk.\n-\n-      * Open a ticket in Django's ticket system, set its ``Component`` field\n-        to ``Translations``, and attach the patch to it. See\n-        :ref:`format-localization` for details.\n-\n-.. _Django i18n mailing list: http://groups.google.com/group/django-i18n/\n-.. _Transifex: http://www.transifex.net/\n-.. _Django project page: http://www.transifex.net/projects/p/django/\n-.. _translation teams: http://www.transifex.net/projects/p/django/teams/\n-.. _translation team: http://www.transifex.net/projects/p/django/teams/\n-.. _Transifex Help: http://help.transifex.net/\n-\n-Submitting javascript patches\n-=============================\n-\n-.. versionadded:: 1.2\n-\n-Django's admin system leverages the jQuery framework to increase the\n-capabilities of the admin interface. In conjunction, there is an emphasis on\n-admin javascript performance and minimizing overall admin media file size.\n-Serving compressed or \"minified\" versions of javascript files is considered\n-best practice in this regard.\n-\n-To that end, patches for javascript files should include both the original\n-code for future development (e.g. \"foo.js\"), and a compressed version for\n-production use (e.g. \"foo.min.js\"). Any links to the file in the codebase\n-should point to the compressed version.\n-\n-To simplify the process of providing optimized javascript code, Django\n-includes a handy script which should be used to create a \"minified\" version.\n-This script is located at ``/contrib/admin/media/js/compress.py``.\n-\n-Behind the scenes, ``compress.py`` is a front-end for Google's\n-`Closure Compiler`_ which is written in Java. However, the Closure Compiler\n-library is not bundled with Django directly, so those wishing to contribute\n-complete javascript patches will need to download and install the library\n-independently.\n-\n-The Closure Compiler library requires Java version 6 or higher (Java 1.6 or\n-higher on Mac OS X). Note that Mac OS X 10.5 and earlier did not ship with Java\n-1.6 by default, so it may be necessary to upgrade your Java installation before\n-the tool will be functional. Also note that even after upgrading Java, the\n-default `/usr/bin/java` command may remain linked to the previous Java\n-binary, so relinking that command may be necessary as well.\n-\n-Please don't forget to run ``compress.py`` and include the ``diff`` of the\n-minified scripts when submitting patches for Django's javascript.\n-\n-.. _Closure Compiler: http://code.google.com/closure/compiler/\n-\n-Django conventions\n-==================\n-\n-Various Django-specific code issues are detailed in this section.\n-\n-Use of ``django.conf.settings``\n--------------------------------\n-\n-Modules should not in general use settings stored in ``django.conf.settings``\n-at the top level (i.e. evaluated when the module is imported). The explanation\n-for this is as follows:\n-\n-Manual configuration of settings (i.e. not relying on the\n-``DJANGO_SETTINGS_MODULE`` environment variable) is allowed and possible as\n-follows::\n-\n-    from django.conf import settings\n-\n-    settings.configure({}, SOME_SETTING='foo')\n-\n-However, if any setting is accessed before the ``settings.configure`` line,\n-this will not work. (Internally, ``settings`` is a ``LazyObject`` which\n-configures itself automatically when the settings are accessed if it has not\n-already been configured).\n-\n-So, if there is a module containing some code as follows::\n-\n-    from django.conf import settings\n-    from django.core.urlresolvers import get_callable\n-\n-    default_foo_view = get_callable(settings.FOO_VIEW)\n-\n-...then importing this module will cause the settings object to be configured.\n-That means that the ability for third parties to import the module at the top\n-level is incompatible with the ability to configure the settings object\n-manually, or makes it very difficult in some circumstances.\n-\n-Instead of the above code, a level of laziness or indirection must be used,\n-such as `django.utils.functional.LazyObject``, ``django.utils.functional.lazy``\n-or ``lambda``.\n-\n-Coding style\n-============\n-\n-Please follow these coding standards when writing code for inclusion in Django:\n-\n-    * Unless otherwise specified, follow :pep:`8`.\n-\n-      You could use a tool like `pep8.py`_ to check for some problems in this\n-      area, but remember that PEP 8 is only a guide, so respect the style of\n-      the surrounding code as a primary goal.\n-\n-    * Use four spaces for indentation.\n-\n-    * Use underscores, not camelCase, for variable, function and method names\n-      (i.e. ``poll.get_unique_voters()``, not ``poll.getUniqueVoters``).\n-\n-    * Use ``InitialCaps`` for class names (or for factory functions that\n-      return classes).\n-\n-    * Mark all strings for internationalization; see the :doc:`i18n\n-      documentation </topics/i18n/index>` for details.\n-\n-    * In docstrings, use \"action words\" such as::\n-\n-          def foo():\n-              \"\"\"\n-              Calculates something and returns the result.\n-              \"\"\"\n-              pass\n-\n-      Here's an example of what not to do::\n-\n-          def foo():\n-              \"\"\"\n-              Calculate something and return the result.\n-              \"\"\"\n-              pass\n-\n-    * Please don't put your name in the code you contribute. Our policy is to\n-      keep contributors' names in the ``AUTHORS`` file distributed with Django\n-      -- not scattered throughout the codebase itself. Feel free to include a\n-      change to the ``AUTHORS`` file in your patch if you make more than a\n-      single trivial change.\n-\n-Template style\n---------------\n-\n-    * In Django template code, put one (and only one) space between the curly\n-      brackets and the tag contents.\n-\n-      Do this:\n-\n-      .. code-block:: html+django\n-\n-          {{ foo }}\n-\n-      Don't do this:\n-\n-      .. code-block:: html+django\n-\n-          {{foo}}\n-\n-View style\n-----------\n-\n-    * In Django views, the first parameter in a view function should be called\n-      ``request``.\n-\n-      Do this::\n-\n-          def my_view(request, foo):\n-              # ...\n-\n-      Don't do this::\n-\n-          def my_view(req, foo):\n-              # ...\n-\n-Model style\n------------\n-\n-    * Field names should be all lowercase, using underscores instead of\n-      camelCase.\n-\n-      Do this::\n-\n-          class Person(models.Model):\n-              first_name = models.CharField(max_length=20)\n-              last_name = models.CharField(max_length=40)\n-\n-      Don't do this::\n-\n-          class Person(models.Model):\n-              FirstName = models.CharField(max_length=20)\n-              Last_Name = models.CharField(max_length=40)\n-\n-    * The ``class Meta`` should appear *after* the fields are defined, with\n-      a single blank line separating the fields and the class definition.\n-\n-      Do this::\n-\n-          class Person(models.Model):\n-              first_name = models.CharField(max_length=20)\n-              last_name = models.CharField(max_length=40)\n-\n-              class Meta:\n-                  verbose_name_plural = 'people'\n-\n-      Don't do this::\n-\n-          class Person(models.Model):\n-              first_name = models.CharField(max_length=20)\n-              last_name = models.CharField(max_length=40)\n-              class Meta:\n-                  verbose_name_plural = 'people'\n-\n-      Don't do this, either::\n-\n-          class Person(models.Model):\n-              class Meta:\n-                  verbose_name_plural = 'people'\n-\n-              first_name = models.CharField(max_length=20)\n-              last_name = models.CharField(max_length=40)\n-\n-    * The order of model inner classes and standard methods should be as\n-      follows (noting that these are not all required):\n-\n-        * All database fields\n-        * Custom manager attributes\n-        * ``class Meta``\n-        * ``def __unicode__()``\n-        * ``def __str__()``\n-        * ``def save()``\n-        * ``def get_absolute_url()``\n-        * Any custom methods\n-\n-    * If ``choices`` is defined for a given model field, define the choices as\n-      a tuple of tuples, with an all-uppercase name, either near the top of the\n-      model module or just above the model class. Example::\n-\n-          GENDER_CHOICES = (\n-              ('M', 'Male'),\n-              ('F', 'Female'),\n-          )\n-\n-Documentation style\n-===================\n-\n-We place a high importance on consistency and readability of documentation.\n-(After all, Django was created in a journalism environment!)\n-\n-How to document new features\n-----------------------------\n-\n-We treat our documentation like we treat our code: we aim to improve it as\n-often as possible. This section explains how writers can craft their\n-documentation changes in the most useful and least error-prone ways.\n-\n-Documentation changes come in two forms:\n-\n-    * General improvements -- Typo corrections, error fixes and better\n-      explanations through clearer writing and more examples.\n-\n-    * New features -- Documentation of features that have been added to the\n-      framework since the last release.\n-\n-Our policy is:\n-\n-    **All documentation of new features should be written in a way that clearly\n-    designates the features are only available in the Django development\n-    version. Assume documentation readers are using the latest release, not the\n-    development version.**\n-\n-Our preferred way for marking new features is by prefacing the features'\n-documentation with: \".. versionadded:: X.Y\", followed by an optional one line\n-comment and a mandatory blank line.\n-\n-General improvements, or other changes to the APIs that should be emphasized\n-should use the \".. versionchanged:: X.Y\" directive (with the same format as the\n-``versionadded`` mentioned above.\n-\n-There's a full page of information about the :doc:`Django documentation\n-system </internals/documentation>` that you should read prior to working on the\n-documentation.\n-\n-Guidelines for reST files\n--------------------------\n-\n-These guidelines regulate the format of our reST documentation:\n-\n-    * In section titles, capitalize only initial words and proper nouns.\n-\n-    * Wrap the documentation at 80 characters wide, unless a code example\n-      is significantly less readable when split over two lines, or for another\n-      good reason.\n-\n-Commonly used terms\n--------------------\n-\n-Here are some style guidelines on commonly used terms throughout the\n-documentation:\n-\n-    * **Django** -- when referring to the framework, capitalize Django. It is\n-      lowercase only in Python code and in the djangoproject.com logo.\n-\n-    * **email** -- no hyphen.\n-\n-    * **MySQL**\n-\n-    * **PostgreSQL**\n-\n-    * **Python** -- when referring to the language, capitalize Python.\n-\n-    * **realize**, **customize**, **initialize**, etc. -- use the American\n-      \"ize\" suffix, not \"ise.\"\n-\n-    * **SQLite**\n-\n-    * **subclass** -- it's a single word without a hyphen, both as a verb\n-      (\"subclass that model\") and as a noun (\"create a subclass\").\n-\n-    * **Web**, **World Wide Web**, **the Web** -- note Web is always\n-      capitalized when referring to the World Wide Web.\n-\n-    * **Web site** -- use two words, with Web capitalized.\n-\n-Django-specific terminology\n----------------------------\n-\n-    * **model** -- it's not capitalized.\n-\n-    * **template** -- it's not capitalized.\n-\n-    * **URLconf** -- use three capitalized letters, with no space before\n-      \"conf.\"\n-\n-    * **view** -- it's not capitalized.\n-\n-Committing code\n-===============\n-\n-Please follow these guidelines when committing code to Django's Subversion\n-repository:\n-\n-    * For any medium-to-big changes, where \"medium-to-big\" is according to your\n-      judgment, please bring things up on the `django-developers`_ mailing list\n-      before making the change.\n-\n-      If you bring something up on `django-developers`_ and nobody responds,\n-      please don't take that to mean your idea is great and should be\n-      implemented immediately because nobody contested it. Django's lead\n-      developers don't have a lot of time to read mailing-list discussions\n-      immediately, so you may have to wait a couple of days before getting a\n-      response.\n-\n-    * Write detailed commit messages in the past tense, not present tense.\n-\n-          * Good: \"Fixed Unicode bug in RSS API.\"\n-          * Bad: \"Fixes Unicode bug in RSS API.\"\n-          * Bad: \"Fixing Unicode bug in RSS API.\"\n-\n-    * For commits to a branch, prefix the commit message with the branch name.\n-      For example: \"magic-removal: Added support for mind reading.\"\n-\n-    * Limit commits to the most granular change that makes sense. This means,\n-      use frequent small commits rather than infrequent large commits. For\n-      example, if implementing feature X requires a small change to library Y,\n-      first commit the change to library Y, then commit feature X in a separate\n-      commit. This goes a *long way* in helping all core Django developers\n-      follow your changes.\n-\n-    * Separate bug fixes from feature changes.\n-\n-      Bug fixes need to be added to the current bugfix branch (e.g. the\n-      ``1.0.X`` branch) as well as the current trunk.\n-\n-    * If your commit closes a ticket in the Django `ticket tracker`_, begin\n-      your commit message with the text \"Fixed #abc\", where \"abc\" is the number\n-      of the ticket your commit fixes. Example: \"Fixed #123 -- Added support\n-      for foo\". We've rigged Subversion and Trac so that any commit message\n-      in that format will automatically close the referenced ticket and post a\n-      comment to it with the full commit message.\n-\n-      If your commit closes a ticket and is in a branch, use the branch name\n-      first, then the \"Fixed #abc.\" For example:\n-      \"magic-removal: Fixed #123 -- Added whizbang feature.\"\n-\n-      For the curious: We're using a `Trac post-commit hook`_ for this.\n-\n-      .. _Trac post-commit hook: http://trac.edgewall.org/browser/trunk/contrib/trac-post-commit-hook\n-\n-    * If your commit references a ticket in the Django `ticket tracker`_ but\n-      does *not* close the ticket, include the phrase \"Refs #abc\", where \"abc\"\n-      is the number of the ticket your commit references. We've rigged\n-      Subversion and Trac so that any commit message in that format will\n-      automatically post a comment to the appropriate ticket.\n-\n-Reverting commits\n------------------\n-\n-Nobody's perfect; mistakes will be committed. When a mistaken commit is\n-discovered, please follow these guidelines:\n-\n-    * Try very hard to ensure that mistakes don't happen. Just because we\n-      have a reversion policy doesn't relax your responsibility to aim for\n-      the highest quality possible. Really: double-check your work before\n-      you commit it in the first place!\n-\n-    * If possible, have the original author revert his/her own commit.\n-\n-    * Don't revert another author's changes without permission from the\n-      original author.\n-\n-    * If the original author can't be reached (within a reasonable amount\n-      of time -- a day or so) and the problem is severe -- crashing bug,\n-      major test failures, etc -- then ask for objections on django-dev\n-      then revert if there are none.\n-\n-    * If the problem is small (a feature commit after feature freeze,\n-      say), wait it out.\n-\n-    * If there's a disagreement between the committer and the\n-      reverter-to-be then try to work it out on the `django-developers`_\n-      mailing list. If an agreement can't be reached then it should\n-      be put to a vote.\n-\n-    * If the commit introduced a confirmed, disclosed security\n-      vulnerability then the commit may be reverted immediately without\n-      permission from anyone.\n-\n-    * The release branch maintainer may back out commits to the release\n-      branch without permission if the commit breaks the release branch.\n-\n-.. _unit-tests:\n-\n-Unit tests\n-==========\n-\n-Django comes with a test suite of its own, in the ``tests`` directory of the\n-Django tarball. It's our policy to make sure all tests pass at all times.\n-\n-The tests cover:\n-\n-    * Models and the database API (``tests/modeltests/``).\n-    * Everything else in core Django code (``tests/regressiontests``)\n-    * Contrib apps (``django/contrib/<contribapp>/tests``, see below)\n-\n-We appreciate any and all contributions to the test suite!\n-\n-The Django tests all use the testing infrastructure that ships with Django for\n-testing applications. See :doc:`Testing Django applications </topics/testing>`\n-for an explanation of how to write new tests.\n-\n-.. _running-unit-tests:\n-\n-Running the unit tests\n-----------------------\n-\n-Quickstart\n-~~~~~~~~~~\n-\n-Running the tests requires a Django settings module that defines the\n-databases to use. To make it easy to get started. Django provides a\n-sample settings module that uses the SQLite database. To run the tests\n-with this sample ``settings`` module, ``cd`` into the Django\n-``tests/`` directory and run:\n-\n-.. code-block:: bash\n-\n-    ./runtests.py --settings=test_sqlite\n-\n-If you get an ``ImportError: No module named django.contrib`` error,\n-you need to add your install of Django to your ``PYTHONPATH``. For\n-more details on how to do this, read `Pointing Python at the new\n-Django version`_ below.\n-\n-Using another ``settings`` module\n-~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n-\n-The included settings module allows you to run the test suite using\n-SQLite. If you want to test behavior using a different database (and\n-if you're proposing patches for Django, it's a good idea to test\n-across databases), you may need to define your own settings file.\n-\n-To run the tests with different settings, ``cd`` to the ``tests/`` directory\n-and type:\n-\n-.. code-block:: bash\n-\n-    ./runtests.py --settings=path.to.django.settings\n-\n-The :setting:`DATABASES` setting in this test settings module needs to define\n-two databases:\n-\n-    * A ``default`` database. This database should use the backend that\n-      you want to use for primary testing\n-\n-    * A database with the alias ``other``. The ``other`` database is\n-      used to establish that queries can be directed to different\n-      databases. As a result, this database can use any backend you\n-      want. It doesn't need to use the same backend as the ``default``\n-      database (although it can use the same backend if you want to).\n-\n-If you're using a backend that isn't SQLite, you will need to provide other\n-details for each database:\n-\n-    * The :setting:`USER` option for each of your databases needs to\n-      specify an existing user account for the database.\n-\n-    * The :setting:`PASSWORD` option needs to provide the password for\n-      the :setting:`USER` that has been specified.\n-\n-    * The :setting:`NAME` option must be the name of an existing database to\n-      which the given user has permission to connect. The unit tests will not\n-      touch this database; the test runner creates a new database whose name is\n-      :setting:`NAME` prefixed with ``test_``, and this test database is\n-      deleted when the tests are finished. This means your user account needs\n-      permission to execute ``CREATE DATABASE``.\n-\n-You will also need to ensure that your database uses UTF-8 as the default\n-character set. If your database server doesn't use UTF-8 as a default charset,\n-you will need to include a value for ``TEST_CHARSET`` in the settings\n-dictionary for the applicable database.\n-\n-Running only some of the tests\n-~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n-\n-Django's entire test suite takes a while to run, and running every single test\n-could be redundant if, say, you just added a test to Django that you want to\n-run quickly without running everything else. You can run a subset of the unit\n-tests by appending the names of the test modules to ``runtests.py`` on the\n-command line.\n-\n-For example, if you'd like to run tests only for generic relations and\n-internationalization, type:\n-\n-.. code-block:: bash\n-\n-    ./runtests.py --settings=path.to.settings generic_relations i18n\n-\n-How do you find out the names of individual tests? Look in ``tests/modeltests``\n-and ``tests/regressiontests`` -- each directory name there is the name of a\n-test.\n-\n-If you just want to run a particular class of tests, you can specify a list of\n-paths to individual test classes. For example, to run the ``TranslationTests``\n-of the ``i18n`` module, type:\n-\n-.. code-block:: bash\n-\n-    ./runtests.py --settings=path.to.settings i18n.TranslationTests\n-\n-Going beyond that, you can specify an individual test method like this:\n-\n-.. code-block:: bash\n-\n-    ./runtests.py --settings=path.to.settings i18n.TranslationTests.test_lazy_objects\n-\n-Running all the tests\n-~~~~~~~~~~~~~~~~~~~~~\n-\n-If you want to run the full suite of tests, you'll need to install a number of\n-dependencies:\n-\n-    *  PyYAML_\n-    *  Markdown_\n-    *  Textile_\n-    *  Docutils_\n-    *  setuptools_\n-    *  memcached_, plus a :ref:`supported Python binding <memcached>`\n-    *  gettext_ (:ref:`gettext_on_windows`)\n-\n-If you want to test the memcached cache backend, you'll also need to define\n-a :setting:`CACHES` setting that points at your memcached instance.\n-\n-Each of these dependencies is optional. If you're missing any of them, the\n-associated tests will be skipped.\n-\n-.. _PyYAML: http://pyyaml.org/wiki/PyYAML\n-.. _Markdown: http://pypi.python.org/pypi/Markdown/1.7\n-.. _Textile: http://pypi.python.org/pypi/textile\n-.. _docutils: http://pypi.python.org/pypi/docutils/0.4\n-.. _setuptools: http://pypi.python.org/pypi/setuptools/\n-.. _memcached: http://www.danga.com/memcached/\n-.. _gettext: http://www.gnu.org/software/gettext/manual/gettext.html\n-\n-Contrib apps\n-------------\n-\n-Tests for apps in ``django/contrib/`` go in their respective directories under\n-``django/contrib/``, in a ``tests.py`` file. (You can split the tests over\n-multiple modules by using a ``tests`` directory in the normal Python way.)\n-\n-For the tests to be found, a ``models.py`` file must exist (it doesn't\n-have to have anything in it). If you have URLs that need to be\n-mapped, put them in ``tests/urls.py``.\n-\n-To run tests for just one contrib app (e.g. ``markup``), use the same\n-method as above::\n-\n-    ./runtests.py --settings=settings markup\n-\n-Requesting features\n-===================\n-\n-We're always trying to make Django better, and your feature requests are a key\n-part of that. Here are some tips on how to make a request most effectively:\n-\n-    * Request the feature on `django-developers`_, not in the ticket tracker.\n-      It'll get read more closely if it's on the mailing list.\n-\n-    * Describe clearly and concisely what the missing feature is and how you'd\n-      like to see it implemented. Include example code (non-functional is OK)\n-      if possible.\n-\n-    * Explain *why* you'd like the feature. In some cases this is obvious, but\n-      since Django is designed to help real developers get real work done,\n-      you'll need to explain it, if it isn't obvious why the feature would be\n-      useful.\n-\n-As with most open-source projects, code talks. If you are willing to write the\n-code for the feature yourself or if (even better) you've already written it,\n-it's much more likely to be accepted. If it's a large feature that might need\n-multiple developers, we're always happy to give you an experimental branch in\n-our repository; see below.\n-\n-Branch policy\n-=============\n-\n-In general, the trunk must be kept stable. People should be able to run\n-production sites against the trunk at any time. Additionally, commits to trunk\n-ought to be as atomic as possible -- smaller changes are better. Thus, large\n-feature changes -- that is, changes too large to be encapsulated in a single\n-patch, or changes that need multiple eyes on them -- must happen on dedicated\n-branches.\n-\n-This means that if you want to work on a large feature -- anything that would\n-take more than a single patch, or requires large-scale refactoring -- you need\n-to do it on a feature branch. Our development process recognizes two options\n-for feature branches:\n-\n-    1. Feature branches using a distributed revision control system like\n-       Git_, Mercurial_, Bazaar_, etc.\n-\n-       If you're familiar with one of these tools, this is probably your best\n-       option since it doesn't require any support or buy-in from the Django\n-       core developers.\n-\n-       However, do keep in mind that Django will continue to use Subversion for\n-       the foreseeable future, and this will naturally limit the recognition of\n-       your branch. Further, if your branch becomes eligible for merging to\n-       trunk you'll need to find a core developer familiar with your DVCS of\n-       choice who'll actually perform the merge.\n-\n-       If you do decided to start a distributed branch of Django and choose to\n-       make it public, please add the branch to the `Django branches`_ wiki\n-       page.\n-\n-    2. Feature branches using SVN have a higher bar. If you want a branch\n-       in SVN itself, you'll need a \"mentor\" among the :doc:`core committers\n-       </internals/committers>`. This person is responsible for actually\n-       creating the branch, monitoring your process (see below), and\n-       ultimately merging the branch into trunk.\n-\n-       If you want a feature branch in SVN, you'll need to ask in\n-       `django-developers`_ for a mentor.\n-\n-.. _git: http://git-scm.com/\n-.. _mercurial: http://mercurial.selenic.com/\n-.. _bazaar: http://bazaar.canonical.com/\n-.. _django branches: http://code.djangoproject.com/wiki/DjangoBranches\n-\n-Branch rules\n-------------\n-\n-We've got a few rules for branches born out of experience with what makes a\n-successful Django branch.\n-\n-DVCS branches are obviously not under central control, so we have no way of\n-enforcing these rules. However, if you're using a DVCS, following these rules\n-will give you the best chance of having a successful branch (read: merged back\n-to trunk).\n-\n-Developers with branches in SVN, however, **must** follow these rules. The\n-branch mentor will keep on eye on the branch and **will delete it** if these\n-rules are broken.\n-\n-    * Only branch entire copies of the Django tree, even if work is only\n-      happening on part of that tree. This makes it painless to switch to a\n-      branch.\n-\n-    * Merge changes from trunk no less than once a week, and preferably every\n-      couple-three days.\n-\n-      In our experience, doing regular trunk merges is often the difference\n-      between a successful branch and one that fizzles and dies.\n-\n-      If you're working on an SVN branch, you should be using `svnmerge.py`_\n-      to track merges from trunk.\n-\n-    * Keep tests passing and documentation up-to-date. As with patches,\n-      we'll only merge a branch that comes with tests and documentation.\n-\n-.. _svnmerge.py: http://www.orcaware.com/svn/wiki/Svnmerge.py\n-\n-Once the branch is stable and ready to be merged into the trunk, alert\n-`django-developers`_.\n-\n-After a branch has been merged, it should be considered \"dead\"; write access to\n-it will be disabled, and old branches will be periodically \"trimmed.\" To keep\n-our SVN wrangling to a minimum, we won't be merging from a given branch into\n-the trunk more than once.\n-\n-Using branches\n---------------\n-\n-To use a branch, you'll need to do two things:\n-\n-    * Get the branch's code through Subversion.\n-\n-    * Point your Python ``site-packages`` directory at the branch's version of\n-      the ``django`` package rather than the version you already have\n-      installed.\n-\n-Getting the code from Subversion\n-~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n-\n-To get the latest version of a branch's code, check it out using Subversion:\n-\n-.. code-block:: bash\n-\n-    svn co http://code.djangoproject.com/svn/django/branches/<branch>/\n-\n-...where ``<branch>`` is the branch's name. See the `list of branch names`_.\n-\n-Alternatively, you can automatically convert an existing directory of the\n-Django source code as long as you've checked it out via Subversion. To do the\n-conversion, execute this command from within your ``django`` directory:\n-\n-.. code-block:: bash\n-\n-    svn switch http://code.djangoproject.com/svn/django/branches/<branch>/\n-\n-The advantage of using ``svn switch`` instead of ``svn co`` is that the\n-``switch`` command retains any changes you might have made to your local copy\n-of the code. It attempts to merge those changes into the \"switched\" code. The\n-disadvantage is that it may cause conflicts with your local changes if the\n-\"switched\" code has altered the same lines of code.\n-\n-(Note that if you use ``svn switch``, you don't need to point Python at the new\n-version, as explained in the next section.)\n-\n-.. _list of branch names: http://code.djangoproject.com/browser/django/branches\n-\n-Pointing Python at the new Django version\n-~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n-\n-Once you've retrieved the branch's code, you'll need to change your Python\n-``site-packages`` directory so that it points to the branch version of the\n-``django`` directory. (The ``site-packages`` directory is somewhere such as\n-``/usr/lib/python2.4/site-packages`` or\n-``/usr/local/lib/python2.4/site-packages`` or ``C:\\Python\\site-packages``.)\n-\n-The simplest way to do this is by renaming the old ``django`` directory to\n-``django.OLD`` and moving the trunk version of the code into the directory\n-and calling it ``django``.\n-\n-Alternatively, you can use a symlink called ``django`` that points to the\n-location of the branch's ``django`` package. If you want to switch back, just\n-change the symlink to point to the old code.\n-\n-A third option is to use a `path file`_ (``<something>.pth``) which should\n-work on all systems (including Windows, which doesn't have symlinks\n-available). First, make sure there are no files, directories or symlinks named\n-``django`` in your ``site-packages`` directory. Then create a text file named\n-``django.pth`` and save it to your ``site-packages`` directory. That file\n-should contain a path to your copy of Django on a single line and optional\n-comments. Here is an example that points to multiple branches. Just uncomment\n-the line for the branch you want to use ('Trunk' in this example) and make\n-sure all other lines are commented::\n-\n-    # Trunk is a svn checkout of:\n-    #   http://code.djangoproject.com/svn/django/trunk/\n-    #\n-    /path/to/trunk\n-\n-    # <branch> is a svn checkout of:\n-    #   http://code.djangoproject.com/svn/django/branches/<branch>/\n-    #\n-    #/path/to/<branch>\n-\n-    # On windows a path may look like this:\n-    # C:/path/to/<branch>\n-\n-If you're using Django 0.95 or earlier and installed it using\n-``python setup.py install``, you'll have a directory called something like\n-``Django-0.95-py2.4.egg`` instead of ``django``. In this case, edit the file\n-``setuptools.pth`` and remove the line that references the Django ``.egg``\n-file. Then copy the branch's version of the ``django`` directory into\n-``site-packages``.\n-\n-.. _path file: http://docs.python.org/library/site.html\n-\n-How we make decisions\n-=====================\n-\n-Whenever possible, we strive for a rough consensus. To that end, we'll often\n-have informal votes on `django-developers`_ about a feature. In these votes we\n-follow the voting style invented by Apache and used on Python itself, where\n-votes are given as +1, +0, -0, or -1. Roughly translated, these votes mean:\n-\n-    * +1: \"I love the idea and I'm strongly committed to it.\"\n-\n-    * +0: \"Sounds OK to me.\"\n-\n-    * -0: \"I'm not thrilled, but I won't stand in the way.\"\n-\n-    * -1: \"I strongly disagree and would be very unhappy to see the idea turn\n-      into reality.\"\n-\n-Although these votes on django-developers are informal, they'll be taken very\n-seriously. After a suitable voting period, if an obvious consensus arises\n-we'll follow the votes.\n-\n-However, consensus is not always possible. If consensus cannot be reached, or\n-if the discussion towards a consensus fizzles out without a concrete decision,\n-we use a more formal process.\n-\n-Any core committer (see below) may call for a formal vote using the same\n-voting mechanism above. A proposition will be considered carried by the core\n-team if:\n-\n-    * There are three \"+1\" votes from members of the core team.\n-\n-    * There is no \"-1\" vote from any member of the core team.\n-\n-    * The BDFLs haven't stepped in and executed their positive or negative\n-      veto.\n-\n-When calling for a vote, the caller should specify a deadline by which\n-votes must be received. One week is generally suggested as the minimum\n-amount of time.\n-\n-Since this process allows any core committer to veto a proposal, any \"-1\"\n-votes (or BDFL vetos) should be accompanied by an explanation that explains\n-what it would take to convert that \"-1\" into at least a \"+0\".\n-\n-Whenever possible, these formal votes should be announced and held in\n-public on the `django-developers`_ mailing list. However, overly sensitive\n-or contentious issues -- including, most notably, votes on new core\n-committers -- may be held in private.\n-\n-Commit access\n-=============\n-\n-Django has two types of committers:\n-\n-Core committers\n-    These are people who have a long history of contributions to Django's\n-    codebase, a solid track record of being polite and helpful on the\n-    mailing lists, and a proven desire to dedicate serious time to Django's\n-    development. The bar is high for full commit access.\n-\n-Partial committers\n-    These are people who are \"domain experts.\" They have direct check-in access\n-    to the subsystems that fall under their jurisdiction, and they're given a\n-    formal vote in questions that involve their subsystems. This type of access\n-    is likely to be given to someone who contributes a large subframework to\n-    Django and wants to continue to maintain it.\n-\n-    Partial commit access is granted by the same process as full\n-    committers. However, the bar is set lower; proven expertise in the area\n-    in question is likely to be sufficient.\n-\n-Decisions on new committers will follow the process explained above in `how\n-we make decisions`_.\n-\n-To request commit access, please contact an existing committer privately.\n-Public requests for commit access are potential flame-war starters, and\n-will be ignored.\n-\n-.. _community page: http://www.djangoproject.com/community/\n-.. _ticket tracker: http://code.djangoproject.com/newticket\n-.. _django-developers: http://groups.google.com/group/django-developers\n-.. _search the tracker: http://code.djangoproject.com/search\n-.. _django-users: http://groups.google.com/group/django-users\n-.. _`#django`: irc://irc.freenode.net/django\n-.. _list of tickets with patches: http://code.djangoproject.com/query?status=new&status=assigned&status=reopened&has_patch=1&order=priority\n-.. _pep8.py: http://pypi.python.org/pypi/pep8/\n-.. _i18n branch: http://code.djangoproject.com/browser/django/branches/i18n\n-.. _`tags/releases`: http://code.djangoproject.com/browser/django/tags/releases\n-.. _`easy-pickings`: http://code.djangoproject.com/query?status=new&status=assigned&status=reopened&keywords=~easy-pickings&order=priority"
        },
        {
            "sha": "47cb580affd92c54d1a2d44f4d68b24641c10271",
            "filename": "docs/internals/contributing/bugs-and-features.txt",
            "status": "added",
            "additions": 181,
            "deletions": 0,
            "changes": 181,
            "blob_url": "https://github.com/django/django/blob/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fbugs-and-features.txt",
            "raw_url": "https://github.com/django/django/raw/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fbugs-and-features.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing%2Fbugs-and-features.txt?ref=407f62fd31689b6158902d3ffdcde64aa27679a7",
            "patch": "@@ -0,0 +1,181 @@\n+======================================\n+Reporting bugs and requesting features\n+======================================\n+\n+Before reporting a bug or requesting a new feature please consider these\n+general points:\n+\n+* Check that someone hasn't already filed the bug or feature request by\n+  `searching`_ or running `custom queries`_ in the ticket tracker.\n+\n+* Don't use the ticket system to ask support questions. Use the\n+  `django-users`_ list, or the `#django`_ IRC channel for that.\n+\n+* Don't reopen issues that have been marked \"wontfix\" by a core developer.\n+  This mark means that the decision has been made that we can't or won't fix\n+  this particular issue. If you're not sure why, please ask\n+  on `django-developers`_.\n+\n+* Don't use the ticket tracker for lengthy discussions, because they're\n+  likely to get lost. If a particular ticket is controversial, please move\n+  discussion to `django-developers`_.\n+\n+.. _reporting-bugs:\n+\n+Reporting bugs\n+--------------\n+\n+Well-written bug reports are *incredibly* helpful. However, there's a certain\n+amount of overhead involved in working with any bug tracking system so your\n+help in keeping our ticket tracker as useful as possible is appreciated. In\n+particular:\n+\n+    * **Do** read the :doc:`FAQ </faq/index>` to see if your issue might\n+      be a well-known question.\n+\n+    * **Do** ask on `django-users`_ *first* if you're not sure if what you're\n+      seeing is a bug.\n+\n+    * **Do** write complete, reproducible, specific bug reports. Include as\n+      much information as you possibly can, complete with code snippets, test\n+      cases, etc. This means including a clear, concise description of the\n+      problem, and a clear set of instructions for replicating the problem.\n+      A minimal example that illustrates the bug in a nice small test case\n+      is the best possible bug report.\n+\n+    * **Don't** post to django-developers just to announce that you have filed\n+      a bug report. All the tickets are mailed to another list\n+      (`django-updates`_), which is tracked by developers and interested\n+      community members; we see them as they are filed.\n+\n+To understand the lifecycle of your ticket once you have created it, refer to\n+:doc:`triaging-tickets`.\n+\n+.. _django-updates: http://groups.google.com/group/django-updates\n+\n+.. _reporting-security-issues:\n+\n+Reporting security issues\n+-------------------------\n+\n+.. Important::\n+\n+    Please report security issues **only** to security@djangoproject.com.\n+    This is a private list only open to long-time, highly trusted Django\n+    developers, and its archives are not publicly readable.\n+\n+In the event of a confirmed vulnerability in Django itself, we will take the\n+following actions:\n+\n+    * Acknowledge to the reporter that we've received the report and that a\n+      fix is forthcoming. We'll give a rough timeline and ask the reporter\n+      to keep the issue confidential until we announce it.\n+\n+    * Focus on developing a fix as quickly as possible and produce patches\n+      against the current and two previous releases.\n+\n+    * Determine a go-public date for announcing the vulnerability and the fix.\n+      To try to mitigate a possible \"arms race\" between those applying the\n+      patch and those trying to exploit the hole, we will not announce\n+      security problems immediately.\n+\n+    * Pre-notify third-party distributors of Django (\"vendors\"). We will send\n+      these vendor notifications through private email which will include\n+      documentation of the vulnerability, links to the relevant patch(es), and\n+      a request to keep the vulnerability confidential until the official\n+      go-public date.\n+\n+    * Publicly announce the vulnerability and the fix on the pre-determined\n+      go-public date. This will probably mean a new release of Django, but\n+      in some cases it may simply be patches against current releases.\n+\n+Requesting features\n+-------------------\n+\n+We're always trying to make Django better, and your feature requests are a key\n+part of that. Here are some tips on how to make a request most effectively:\n+\n+    * First request the feature on `django-developers`_, not in the ticket\n+      tracker. It'll get read more closely if it's on the mailing list.\n+\n+    * Describe clearly and concisely what the missing feature is and how you'd\n+      like to see it implemented. Include example code (non-functional is OK)\n+      if possible.\n+\n+    * Explain *why* you'd like the feature. In some cases this is obvious, but\n+      since Django is designed to help real developers get real work done,\n+      you'll need to explain it, if it isn't obvious why the feature would be\n+      useful.\n+\n+    * Don't use the ticket system to make large-scale feature requests.\n+      We like to discuss any big changes to Django's core on the\n+      `django-developers`_ list before actually working on them.\n+\n+As with most open-source projects, code talks. If you are willing to write the\n+code for the feature yourself or if (even better) you've already written it,\n+it's much more likely to be accepted. If it's a large feature that might need\n+multiple developers, we're always happy to give you an experimental branch in\n+our repository; see the :doc:`writing-code/branch-policy`.\n+\n+To understand the lifecycle of your ticket once you have created it, refer to\n+:doc:`triaging-tickets`.\n+\n+See also: :ref:`documenting-new-features`.\n+\n+.. _how-we-make-decisions:\n+\n+How we make decisions\n+---------------------\n+\n+Whenever possible, we strive for a rough consensus. To that end, we'll often\n+have informal votes on `django-developers`_ about a feature. In these votes we\n+follow the voting style invented by Apache and used on Python itself, where\n+votes are given as +1, +0, -0, or -1. Roughly translated, these votes mean:\n+\n+    * +1: \"I love the idea and I'm strongly committed to it.\"\n+\n+    * +0: \"Sounds OK to me.\"\n+\n+    * -0: \"I'm not thrilled, but I won't stand in the way.\"\n+\n+    * -1: \"I strongly disagree and would be very unhappy to see the idea turn\n+      into reality.\"\n+\n+Although these votes on django-developers are informal, they'll be taken very\n+seriously. After a suitable voting period, if an obvious consensus arises\n+we'll follow the votes.\n+\n+However, consensus is not always possible. If consensus cannot be reached, or\n+if the discussion towards a consensus fizzles out without a concrete decision,\n+we use a more formal process.\n+\n+Any :doc:`core committer</internals/committers>` may call for a formal vote\n+using the same voting mechanism above. A proposition will be considered carried\n+by the core team if:\n+\n+    * There are three \"+1\" votes from members of the core team.\n+\n+    * There is no \"-1\" vote from any member of the core team.\n+\n+    * The :ref:`BDFLs<django-bdfls>` haven't stepped in and executed their\n+      positive or negative veto.\n+\n+When calling for a vote, the caller should specify a deadline by which\n+votes must be received. One week is generally suggested as the minimum\n+amount of time.\n+\n+Since this process allows any core committer to veto a proposal, any \"-1\"\n+votes (or BDFL vetos) should be accompanied by an explanation that explains\n+what it would take to convert that \"-1\" into at least a \"+0\".\n+\n+Whenever possible, these formal votes should be announced and held in\n+public on the `django-developers`_ mailing list. However, overly sensitive\n+or contentious issues -- including, most notably, votes on new core\n+committers -- may be held in private.\n+\n+\n+.. _searching: http://code.djangoproject.com/search\n+.. _`custom queries`: https://code.djangoproject.com/query\n+.. _django-developers: http://groups.google.com/group/django-developers\n+.. _django-users: http://groups.google.com/group/django-users\n+.. _`#django`: irc://irc.freenode.net/django"
        },
        {
            "sha": "601d1a0ef2737a402a67767741ae80e584ed02bc",
            "filename": "docs/internals/contributing/committing-code.txt",
            "status": "added",
            "additions": 133,
            "deletions": 0,
            "changes": 133,
            "blob_url": "https://github.com/django/django/blob/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fcommitting-code.txt",
            "raw_url": "https://github.com/django/django/raw/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fcommitting-code.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing%2Fcommitting-code.txt?ref=407f62fd31689b6158902d3ffdcde64aa27679a7",
            "patch": "@@ -0,0 +1,133 @@\n+===============\n+Committing code\n+===============\n+\n+This section is addressed to the :doc:`/internals/committers` and to anyone\n+interested in knowing how code gets committed into Django core.\n+\n+Commit access\n+-------------\n+\n+Django has two types of committers:\n+\n+Core committers\n+    These are people who have a long history of contributions to Django's\n+    codebase, a solid track record of being polite and helpful on the\n+    mailing lists, and a proven desire to dedicate serious time to Django's\n+    development. The bar is high for full commit access.\n+\n+Partial committers\n+    These are people who are \"domain experts.\" They have direct check-in\n+    access to the subsystems that fall under their jurisdiction, and they're\n+    given a formal vote in questions that involve their subsystems. This type\n+    of access is likely to be given to someone who contributes a large\n+    subframework to Django and wants to continue to maintain it.\n+\n+    Partial commit access is granted by the same process as full\n+    committers. However, the bar is set lower; proven expertise in the area\n+    in question is likely to be sufficient.\n+\n+Decisions on new committers will follow the process explained in\n+:ref:`how-we-make-decisions`.\n+\n+To request commit access, please contact an existing committer privately.\n+Public requests for commit access are potential flame-war starters, and\n+will be ignored.\n+\n+Committing guidelines\n+---------------------\n+\n+Please follow these guidelines when committing code to Django's Subversion\n+repository:\n+\n+    * For any medium-to-big changes, where \"medium-to-big\" is according to\n+      your judgment, please bring things up on the `django-developers`_\n+      mailing list before making the change.\n+\n+      If you bring something up on `django-developers`_ and nobody responds,\n+      please don't take that to mean your idea is great and should be\n+      implemented immediately because nobody contested it. Django's lead\n+      developers don't have a lot of time to read mailing-list discussions\n+      immediately, so you may have to wait a couple of days before getting a\n+      response.\n+\n+    * Write detailed commit messages in the past tense, not present tense.\n+\n+          * Good: \"Fixed Unicode bug in RSS API.\"\n+          * Bad: \"Fixes Unicode bug in RSS API.\"\n+          * Bad: \"Fixing Unicode bug in RSS API.\"\n+\n+    * For commits to a branch, prefix the commit message with the branch name.\n+      For example: \"magic-removal: Added support for mind reading.\"\n+\n+    * Limit commits to the most granular change that makes sense. This means,\n+      use frequent small commits rather than infrequent large commits. For\n+      example, if implementing feature X requires a small change to library Y,\n+      first commit the change to library Y, then commit feature X in a\n+      separate commit. This goes a *long way* in helping all core Django\n+      developers follow your changes.\n+\n+    * Separate bug fixes from feature changes.\n+\n+      Bug fixes need to be added to the current bugfix branch (e.g. the\n+      ``1.0.X`` branch) as well as the current trunk.\n+\n+    * If your commit closes a ticket in the Django `ticket tracker`_, begin\n+      your commit message with the text \"Fixed #abc\", where \"abc\" is the\n+      number of the ticket your commit fixes. Example: \"Fixed #123 -- Adde\n+      support for foo\". We've rigged Subversion and Trac so that any commit\n+      message in that format will automatically close the referenced ticket\n+      and post a comment to it with the full commit message.\n+\n+      If your commit closes a ticket and is in a branch, use the branch name\n+      first, then the \"Fixed #abc.\" For example:\n+      \"magic-removal: Fixed #123 -- Added whizbang feature.\"\n+\n+      For the curious: We're using a `Trac post-commit hook`_ for this.\n+\n+      .. _Trac post-commit hook: http://trac.edgewall.org/browser/trunk/contrib/trac-post-commit-hook\n+\n+    * If your commit references a ticket in the Django `ticket tracker`_ but\n+      does *not* close the ticket, include the phrase \"Refs #abc\", where \"abc\"\n+      is the number of the ticket your commit references. We've rigged\n+      Subversion and Trac so that any commit message in that format will\n+      automatically post a comment to the appropriate ticket.\n+\n+Reverting commits\n+-----------------\n+\n+Nobody's perfect; mistakes will be committed. When a mistaken commit is\n+discovered, please follow these guidelines:\n+\n+    * Try very hard to ensure that mistakes don't happen. Just because we\n+      have a reversion policy doesn't relax your responsibility to aim for\n+      the highest quality possible. Really: double-check your work before\n+      you commit it in the first place!\n+\n+    * If possible, have the original author revert his/her own commit.\n+\n+    * Don't revert another author's changes without permission from the\n+      original author.\n+\n+    * If the original author can't be reached (within a reasonable amount\n+      of time -- a day or so) and the problem is severe -- crashing bug,\n+      major test failures, etc -- then ask for objections on django-dev\n+      then revert if there are none.\n+\n+    * If the problem is small (a feature commit after feature freeze,\n+      say), wait it out.\n+\n+    * If there's a disagreement between the committer and the\n+      reverter-to-be then try to work it out on the `django-developers`_\n+      mailing list. If an agreement can't be reached then it should\n+      be put to a vote.\n+\n+    * If the commit introduced a confirmed, disclosed security\n+      vulnerability then the commit may be reverted immediately without\n+      permission from anyone.\n+\n+    * The release branch maintainer may back out commits to the release\n+      branch without permission if the commit breaks the release branch.\n+\n+.. _django-developers: http://groups.google.com/group/django-developers\n+.. _ticket tracker: http://code.djangoproject.com/newticket"
        },
        {
            "sha": "b326ad90b98ac7135277f724c9eb0a0309e3dd4d",
            "filename": "docs/internals/contributing/index.txt",
            "status": "added",
            "additions": 48,
            "deletions": 0,
            "changes": 48,
            "blob_url": "https://github.com/django/django/blob/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Findex.txt",
            "raw_url": "https://github.com/django/django/raw/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Findex.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing%2Findex.txt?ref=407f62fd31689b6158902d3ffdcde64aa27679a7",
            "patch": "@@ -0,0 +1,48 @@\n+======================\n+Contributing to Django\n+======================\n+\n+If you think working *with* Django is fun, wait until you start working *on*\n+it. We're passionate about helping Django users make the jump to contributing\n+members of the community, so there are several ways you can help Django's\n+development:\n+\n+    * Blog about Django. We syndicate all the Django blogs we know about on\n+      the `community page`_; if you'd like to see your blog on that page you\n+      can `register it here`_.\n+\n+    * :doc:`Report bugs and request features<bugs-and-features>` in our\n+      `ticket tracker`_.\n+\n+    * Join the `django-developers`_ mailing list and share your ideas for how\n+      to improve Django. We're always open to suggestions.\n+\n+    * :doc:`Submit patches<writing-code/submitting-patches>` for new and/or\n+      fixed behavior. If you're looking for an easy way to start contributing\n+      to Django have a look at the `easy pickings`_ tickets.\n+\n+    * :doc:`Improve the documentation<writing-documentation>` or\n+      :doc:`write unit tests<writing-code/unit-tests>`.\n+\n+    * :doc:`Triage tickets<triaging-tickets>` that have been created by other\n+      users.\n+\n+... and many more ways! Really, **ANYONE** can do something to help make\n+Django better and greater. Browse the following sections to find out how:\n+\n+.. toctree::\n+   :maxdepth: 2\n+\n+   new-contributors\n+   bugs-and-features\n+   triaging-tickets\n+   writing-code/index\n+   writing-documentation\n+   translations\n+   committing-code\n+\n+.. _django-developers: http://groups.google.com/group/django-developers\n+.. _ticket tracker: http://code.djangoproject.com/newticket\n+.. _community page: http://www.djangoproject.com/community/\n+.. _`easy pickings`: http://code.djangoproject.com/query?status=!closed&easy=1\n+.. _`register it here`: http://www.djangoproject.com/community/add/blogs/"
        },
        {
            "sha": "f1673b3618bd9e8f70847e2493b07f2064df8f87",
            "filename": "docs/internals/contributing/new-contributors.txt",
            "status": "added",
            "additions": 137,
            "deletions": 0,
            "changes": 137,
            "blob_url": "https://github.com/django/django/blob/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fnew-contributors.txt",
            "raw_url": "https://github.com/django/django/raw/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fnew-contributors.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing%2Fnew-contributors.txt?ref=407f62fd31689b6158902d3ffdcde64aa27679a7",
            "patch": "@@ -0,0 +1,137 @@\n+===========================\n+Advice for new contributors\n+===========================\n+\n+New contributor and not sure what to do? Want to help but just don't know how\n+to get started? This is the section for you.\n+\n+* **Pick a subject area that you care about, that you are familiar with, or\n+  that you want to learn about**\n+\n+  You don't already have to be an expert on the area you want to work on; you\n+  become an expert through your ongoing contributions to the code.\n+\n+* **Triage tickets**\n+\n+  If a ticket is unreviewed and reports a bug, try and reproduce it. If you\n+  can reproduce it and it seems valid, make a note that you confirmed the bug\n+  and accept the ticket. Make sure the ticket is filed under the correct\n+  component area. Consider writing a patch that adds a test for the bug's\n+  behavior, even if you don't fix the bug itself. See more at\n+  :ref:`how-can-i-help-with-triaging`\n+\n+* **Look for tickets that are accepted and review patches to build familiarity\n+  with the codebase and the process**\n+\n+  Mark the appropriate flags if a patch needs docs or tests. Look through the\n+  changes a patch makes, and keep an eye out for syntax that is incompatible\n+  with older but still supported versions of Python. Run the tests and make\n+  sure they pass on your system.  Where possible and relevant, try them out on\n+  a database other than SQLite. Leave comments and feedback!\n+\n+* **Keep old patches up to date**\n+\n+  Oftentimes the codebase will change between a patch being submitted and the\n+  time it gets reviewed. Make sure it still applies cleanly and functions as\n+  expected. Simply updating a patch is both useful and important! See more on\n+  :doc:`writing-code/submitting-patches`.\n+\n+* **Write some documentation**\n+\n+  Django's documentation is great but it can always be improved. Did you find\n+  a typo? Do you think that something should be clarified? Go ahead and\n+  suggest a documentation patch! See also the guide on\n+  :doc:`writing-documentation`, in particular the tips for\n+  :ref:`improving-the-documentation`.\n+\n+* **Analyze the ticket's context and history**\n+\n+  Trac isn't an absolute; the context is just as important as the words.\n+  When reading Trac, you need to take into account who says things, and when\n+  they were said. Support for an idea two years ago doesn't necessarily mean\n+  that the idea will still have support. You also need to pay attention to who\n+  *hasn't* spoken -- for example, if a core team member hasn't been recently\n+  involved in a discussion, then a ticket may not have the support required to\n+  get into trunk.\n+\n+* **Start small**\n+\n+  It's easier to get feedback on a little issue than on a big one. See the\n+  `easy pickings`_.\n+\n+* **If you're going to engage in a big task, make sure that your idea has\n+  support first**\n+\n+  This means getting someone else to confirm that a bug is real before you fix\n+  the issue, and ensuring that the core team supports a proposed feature\n+  before you go implementing it.\n+\n+* **Be bold! Leave feedback!**\n+\n+  Sometimes it can be scary to put your opinion out to the world and say \"this\n+  ticket is correct\" or \"this patch needs work\", but it's the only way the\n+  project moves forward. The contributions of the broad Django community\n+  ultimately have a much greater impact than that of the core developers. We\n+  can't do it without YOU!\n+\n+* **Err on the side of caution when marking things Ready For Check-in**\n+\n+  If you're really not certain if a ticket is ready, don't mark it as\n+  such. Leave a comment instead, letting others know your thoughts.  If you're\n+  mostly certain, but not completely certain, you might also try asking on IRC\n+  to see if someone else can confirm your suspicions.\n+\n+* **Wait for feedback, and respond to feedback that you receive**\n+\n+  Focus on one or two tickets, see them through from start to finish, and\n+  repeat. The shotgun approach of taking on lots of tickets and letting some\n+  fall by the wayside ends up doing more harm than good.\n+\n+* **Be rigorous**\n+\n+  When we say \":pep:`8`, and must have docs and tests\", we mean it. If a patch\n+  doesn't have docs and tests, there had better be a good reason. Arguments\n+  like \"I couldn't find any existing tests of this feature\" don't carry much\n+  weight--while it may be true, that means you have the extra-important job of\n+  writing the very first tests for that feature, not that you get a pass from\n+  writing tests altogether.\n+\n+.. note::\n+\n+    The `Reports page`_ contains links to many useful Trac queries, including\n+    several that are useful for triaging tickets and reviewing patches as\n+    suggested above.\n+\n+    .. _Reports page: http://code.djangoproject.com/wiki/Reports\n+\n+.. _new-contributors-faq:\n+\n+FAQ\n+---\n+\n+1. **This ticket I care about has been ignored for days/weeks/months! What can\n+   I do to get it committed?**\n+\n+   First off, it's not personal. Django is entirely developed by volunteers\n+   (even the core developers), and sometimes folks just don't have time. The\n+   best thing to do is to send a gentle reminder to the Django Developers\n+   mailing list asking for review on the ticket, or to bring it up in the\n+   #django-dev IRC channel.\n+\n+2. **I'm sure my ticket is absolutely 100% perfect, can I mark it as RFC\n+   myself?**\n+\n+   Short answer: No. It's always better to get another set of eyes on a\n+   ticket. If you're having trouble getting that second set of eyes, see\n+   question 1, above.\n+\n+3. **My ticket has been in DDN forever! What should I do?**\n+\n+   Design Decision Needed requires consensus about the right solution.  At the\n+   very least it needs consensus among the core developers, and ideally it has\n+   consensus from the community as well. The best way to accomplish this is to\n+   start a thread on the Django Developers mailing list, and for very complex\n+   issues to start a wiki page summarizing the problem and the possible\n+   solutions.\n+\n+.. _`easy pickings`: http://code.djangoproject.com/query?status=!closed&easy=1"
        },
        {
            "sha": "ade04e6c3cb553e013dadf9d1ee7d8eeecd9ebec",
            "filename": "docs/internals/contributing/translations.txt",
            "status": "added",
            "additions": 60,
            "deletions": 0,
            "changes": 60,
            "blob_url": "https://github.com/django/django/blob/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Ftranslations.txt",
            "raw_url": "https://github.com/django/django/raw/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Ftranslations.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing%2Ftranslations.txt?ref=407f62fd31689b6158902d3ffdcde64aa27679a7",
            "patch": "@@ -0,0 +1,60 @@\n+=======================================\n+Submitting and maintaining translations\n+=======================================\n+\n+Various parts of Django, such as the admin site and validation error messages,\n+are internationalized. This means they display different text depending on a\n+user's language setting. For this, Django uses the same internationalization\n+infrastructure available to Django applications described in the\n+:doc:`i18n documentation</topics/i18n/index>`.\n+\n+These translations are contributed by Django users worldwide. If you find an\n+incorrect translation or want to discuss specific translations, go to the\n+`translation team`_ page for that language. If you would like to help out\n+with translating or add a language that isn't yet translated, here's what\n+to do:\n+\n+    * Join the `Django i18n mailing list`_ and introduce yourself.\n+\n+    * Make sure you read the notes about :ref:`specialties-of-django-i18n`.\n+\n+    * Signup at `Transifex`_ and visit the `Django project page`_.\n+\n+    * On the \"`Translation Teams`_\" page, choose the language team you want\n+      to work with, **or** -- in case the language team doesn't exist yet --\n+      request a new team by clicking on the \"Request a new team\" button\n+      and select the appropriate language.\n+\n+    * Then, click the \"Join this Team\" button to become a member of this team.\n+      Every team has at least one coordinator who is responsible to review\n+      your membership request. You can of course also contact the team\n+      coordinator to clarify procedural problems and handle the actual\n+      translation process.\n+\n+    * Once you are a member of a team choose the translation resource you\n+      want to update on the team page. For example the \"core\" resource refers\n+      to the translation catalogue that contains all non-contrib translations.\n+      Each of the contrib apps also have a resource (prefixed with \"contrib\").\n+\n+      .. note::\n+         For more information about how to use Transifex, see the\n+         `Transifex Help`_\n+\n+    * Optionally, review and update the ``conf/locale/<locale>/formats.py``\n+      file to describe the date, time and numbers formatting particularities\n+      of your locale. These files aren't covered by the use of Transifex and\n+      require a patch against the Django source tree, just as a code change\n+      would:\n+\n+      * Create a diff against the current Subversion trunk.\n+\n+      * Open a ticket in Django's ticket system, set its ``Component`` field\n+        to ``Translations``, and attach the patch to it. See\n+        :ref:`format-localization` for details.\n+\n+.. _Django i18n mailing list: http://groups.google.com/group/django-i18n/\n+.. _Transifex: http://www.transifex.net/\n+.. _Django project page: http://www.transifex.net/projects/p/django/\n+.. _translation teams: http://www.transifex.net/projects/p/django/teams/\n+.. _translation team: http://www.transifex.net/projects/p/django/teams/\n+.. _Transifex Help: http://help.transifex.net/"
        },
        {
            "sha": "a59d01b22f3696a8dd23bc25d412d06845e48b9c",
            "filename": "docs/internals/contributing/triaging-tickets.txt",
            "status": "added",
            "additions": 389,
            "deletions": 0,
            "changes": 389,
            "blob_url": "https://github.com/django/django/blob/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Ftriaging-tickets.txt",
            "raw_url": "https://github.com/django/django/raw/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Ftriaging-tickets.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing%2Ftriaging-tickets.txt?ref=407f62fd31689b6158902d3ffdcde64aa27679a7",
            "patch": "@@ -0,0 +1,389 @@\n+================\n+Triaging tickets\n+================\n+\n+Django uses Trac_ for managing our progress, and Trac is a community-tended\n+garden of the bugs people have found and the features people would like to see\n+added. As in any garden, sometimes there are weeds to be pulled and sometimes\n+there are flowers and vegetables that need picking. We need your help to sort\n+out one from the other, and in the end we all benefit together.\n+\n+Like all gardens, we can aspire to perfection but in reality there's no such\n+thing. Even in the most pristine garden there are still snails and insects.\n+In a community garden there are also helpful people who--with the best of\n+intentions--fertilize the weeds and poison the roses. It's the job of the\n+community as a whole to self-manage, keep the problems to a minimum, and\n+educate those coming into the community so that they can become valuable\n+contributing members.\n+\n+Similarly, while we aim for Trac to be a perfect representation of the state\n+of Django's progress, we acknowledge that this simply will not happen. By\n+distributing the load of Trac maintenance to the community, we accept that\n+there will be mistakes. Trac is \"mostly accurate\", and we give allowances for\n+the fact that sometimes it will be wrong. That's okay. We're perfectionists\n+with deadlines.\n+\n+We rely on the community to keep participating, keep tickets as accurate as\n+possible, and raise issues for discussion on our mailing lists when there is\n+confusion or disagreement.\n+\n+Django is a community project, and every contribution helps. We can't do this\n+without YOU!\n+\n+Triage workflow\n+---------------\n+\n+Unfortunately, not all bug reports and feature requests in the ticket tracker\n+provide all the :doc:`required details<bugs-and-features>`. A number of\n+tickets have patches, but those patches don't meet all the requirements of a\n+:ref:`good patch<patch-style>`.\n+\n+One way to help out is to *triage* tickets that have been created by other\n+users. The core team--as well as many community members--work on this\n+regularly, but more help is always appreciated.\n+\n+Most of the workflow is based around the concept of a ticket's\n+:ref:`triage stages <triage-stages>`. Each stage describes where in its\n+lifetime a given ticket is at any time. Along with a handful of flags, this\n+attribute easily tells us what and who each ticket is waiting on.\n+\n+Since a picture is worth a thousand words, let's start there:\n+\n+.. image:: /internals/_images/djangotickets.png\n+   :height: 451\n+   :width: 590\n+   :alt: Django's ticket triage workflow\n+\n+We've got two roles in this diagram:\n+\n+    * :doc:`Committers</internals/committers>` (also called core developers):\n+      people with commit access who are responsible for making the big\n+      decisions, writing large portions of the code and integrating the\n+      contributions of the community.\n+\n+    * Ticket triagers: anyone in the Django community who chooses to\n+      become involved in Django's development process. Our Trac installation\n+      is intentionally left open to the public, and anyone can triage tickets.\n+      Django is a community project, and we encourage :ref:`triage by the\n+      community<how-can-i-help-with-triaging>`.\n+\n+By way of example, here we see the lifecycle of an average ticket:\n+\n+* Alice creates a ticket, and uploads an incomplete patch (no tests, incorrect\n+  implementation).\n+\n+* Bob reviews the patch, marks it \"Accepted\", \"needs tests\", and \"patch needs\n+  improvement\", and leaves a comment telling Alice how the patch could be\n+  improved.\n+\n+* Alice updates the patch, adding tests (but not changing the\n+  implementation). She removes the two flags.\n+\n+* Charlie reviews the patch and resets the \"patch needs improvement\" flag with\n+  another comment about improving the implementation.\n+\n+* Alice updates the patch, fixing the implementation. She removes the \"patch\n+  needs improvement\" flag.\n+\n+* Daisy reviews the patch, and marks it RFC.\n+\n+* Jacob, a core developer, reviews the RFC patch, applies it to his checkout,\n+  and commits it.\n+\n+Some tickets require much less feedback than this, but then again some tickets\n+require much much more.\n+\n+.. _triage-stages:\n+\n+Triage stages\n+-------------\n+\n+Below we describe in more detail the various stages that a ticket may flow\n+through during its lifetime.\n+\n+Unreviewed\n+~~~~~~~~~~\n+\n+The ticket has not been reviewed by anyone who felt qualified to make a\n+judgment about whether the ticket contained a valid issue, a viable feature,\n+or ought to be closed for any of the various reasons.\n+\n+Accepted\n+~~~~~~~~\n+\n+The big grey area! The absolute meaning of \"accepted\" is that the issue\n+described in the ticket is valid and is in some stage of being worked on.\n+Beyond that there are several considerations:\n+\n+* **Accepted + No Flags**\n+\n+  The ticket is valid, but no one has submitted a patch for it yet. Often this\n+  means you could safely start writing a patch for it.\n+\n+* **Accepted + Has Patch**\n+\n+  The ticket is waiting for people to review the supplied patch. This means\n+  downloading the patch and trying it out, verifying that it contains tests\n+  and docs, running the test suite with the included patch, and leaving\n+  feedback on the ticket.\n+\n+* **Accepted + Has Patch + (any other flag)**\n+\n+  This means the ticket has been reviewed, and has been found to need further\n+  work. \"Needs tests\" and \"Needs documentation\" are self-explanatory. \"Patch\n+  needs improvement\" will generally be accompanied by a comment on the ticket\n+  explaining what is needed to improve the code.\n+\n+Design Decision Needed\n+~~~~~~~~~~~~~~~~~~~~~~\n+\n+This stage is for issues which may be contentious, may be backwards\n+incompatible, or otherwise involve high-level design decisions. These issues\n+should be discussed either in the ticket comments or on `django-developers`_.\n+\n+If a ticket has been marked as \"DDN\", decisions are generally eventually\n+made by the core committers, however that is not a requirement. See the\n+:ref:`New contributors' FAQ<new-contributors-faq>` for \"My ticket has been in\n+DDN forever! What should I do?\"\n+\n+This stage will generally only be used for feature\n+requests. It can also be used for issues that *might* be bugs, depending on\n+opinion or interpretation. Obvious bugs (such as crashes, incorrect query\n+results, or non-compliance with a standard) skip this stage and move straight\n+to \"Accepted\".\n+\n+Ready For Checkin\n+~~~~~~~~~~~~~~~~~\n+\n+The ticket was reviewed by any member of the community other than the person\n+who supplied the patch and found to meet all the requirements for a\n+commit-ready patch. A core committer now needs to give the patch a final\n+review prior to being committed. See the\n+:ref:`New contributors' FAQ<new-contributors-faq>` for \"My ticket has been in\n+RFC forever! What should I do?\"\n+\n+Someday/Maybe\n+~~~~~~~~~~~~~\n+\n+Generally only used for vague/high-level features or design ideas. These\n+tickets are uncommon and overall less useful since they don't describe\n+concrete actionable issues. They are enhancement requests that we might\n+consider adding someday to the framework if an excellent patch is submitted.\n+These tickets are not a high priority.\n+\n+Fixed on a branch\n+~~~~~~~~~~~~~~~~~\n+\n+Used to indicate that a ticket is resolved as part of a major body of work\n+that will eventually be merged to trunk. Tickets in this stage generally\n+don't need further work. This may happen in the case of major\n+features/refactors in each release cycle, or as part of the annual Google\n+Summer of Code efforts.\n+\n+Other triage attributes\n+-----------------------\n+\n+A number of flags, appearing as checkboxes in Trac, can be set on a ticket:\n+\n+  * Has patch\n+        This means the ticket has an associated\n+        :doc:`patch<writing-code/submitting-patches>`. These will be reviewed\n+        to see if the patch is \"good\".\n+  * Needs documentation:\n+        This flag is used for tickets with patches that need associated\n+        documentation. Complete documentation of features is a prerequisite\n+        before we can check them into the codebase.\n+  * Needs tests\n+        This flags the patch as needing associated unit tests. Again, this\n+        is a required part of a valid patch.\n+  * Patch needs improvement\n+        This flag means that although the ticket *has* a patch, it's not quite\n+        ready for checkin. This could mean the patch no longer applies\n+        cleanly, there is a flaw in the implementation, or that the code\n+        doesn't meet our standards.\"\n+  * Easy pickings\n+        Tickets that would require small, easy, patches.\n+\n+Tickets should be categorized by *type* between:\n+\n+  * New Feature\n+        For adding something new.\n+\n+  * Bug\n+        For when an existing thing is broken or not behaving as expected.\n+\n+  * Cleanup/optimization\n+        For when nothing is broken but something could be made cleaner,\n+        better, faster, stronger.\n+\n+Tickets should also be classified into *components* indicating which area of\n+the Django codebase they belong to. This makes tickets better organized and\n+easier to find.\n+\n+The *severity* attribute is used to identify blockers, that is, issues which\n+should get fixed before releasing the next version of Django. Typically those\n+issues are bugs causing regressions from earlier versions or potentially\n+causing severe data losses. This attribute is quite rarely used and the vast\n+majority of tickets have a severity of \"Normal\".\n+\n+Finally, it is possible to use the *version* attribute to indicate in which\n+version the reported bug was identified.\n+\n+.. _closing-tickets:\n+\n+Closing Tickets\n+---------------\n+\n+When a ticket has completed its useful lifecycle, it's time for it to be\n+closed. Closing a ticket is a big responsibility, though. You have to be sure\n+that the issue is really resolved, and you need to keep in mind that the\n+reporter of the ticket may not be happy to have their ticket closed (unless\n+it's fixed, of course). If you're not certain about closing a ticket, just\n+leave a comment with your thoughts instead.\n+\n+If you do close a ticket, you should always make sure of the following:\n+\n+  * Be certain that the issue is resolved.\n+\n+  * Leave a comment explaining the decision to close the ticket.\n+\n+  * If there is a way they can improve the ticket to reopen it, let them know.\n+\n+  * If the ticket is a duplicate, reference the original ticket. Also\n+    cross-reference the closed ticket by living a comment in the original one\n+    -- this allows to access more related information about the reported bug\n+    or requested feature.\n+\n+  * **Be polite.** No one likes having their ticket closed. It can be\n+    frustrating or even discouraging. The best way to avoid turning people\n+    off from contributing to Django is to be polite and friendly and to offer\n+    suggestions for how they could improve this ticket and other tickets in\n+    the future.\n+\n+A ticket can be resolved in a number of ways:\n+\n+  * fixed\n+        Used by the core developers once a patch has been rolled into\n+        Django and the issue is fixed.\n+\n+  * invalid\n+        Used if the ticket is found to be incorrect. This means that the\n+        issue in the ticket is actually the result of a user error, or\n+        describes a problem with something other than Django, or isn't\n+        a bug report or feature request at all (for example, some new users\n+        submit support queries as tickets).\n+\n+  * wontfix\n+        Used when a core developer decides that this request is not\n+        appropriate for consideration in Django. This is usually chosen after\n+        discussion in the `django-developers`_ mailing list. Feel free to\n+        start or join in discussions of \"wontfix\" tickets on the\n+        django-developers_ mailing list, but please do not reopen tickets\n+        closed as \"wontfix\" by core developers.\n+\n+  * duplicate\n+        Used when another ticket covers the same issue. By closing duplicate\n+        tickets, we keep all the discussion in one place, which helps\n+        everyone.\n+\n+  * worksforme\n+        Used when the ticket doesn't contain enough detail to replicate\n+        the original bug.\n+\n+  * needsinfo\n+        Used when the ticket does not contain enough information to replicate\n+        the reported issue but is potentially still valid. The ticket\n+        should be reopened when more information is supplied.\n+\n+If you believe that the ticket was closed in error -- because you're\n+still having the issue, or it's popped up somewhere else, or the triagers have\n+made a mistake -- please reopen the ticket and provide further information.\n+Again, please do not reopen tickets that have been marked as \"wontfix\" by core\n+developers and bring the issue to django-developers_ instead.\n+\n+.. _how-can-i-help-with-triaging:\n+\n+How can I help with triaging?\n+-----------------------------\n+\n+Although the core developers make the big decisions in the ticket triage\n+process, there's a lot that general community members can do to help the\n+triage process. Really, **ANYONE** can help.\n+\n+Start by `creating an account on Trac`_. If you have an account but have\n+forgotten your password, you can reset it using the `password reset page`_.\n+\n+Then, you can help out by:\n+\n+    * Closing \"Unreviewed\" tickets as \"invalid\", \"worksforme\" or \"duplicate.\"\n+\n+    * Promoting \"Unreviewed\" tickets to \"Design decision needed\" if a design\n+      decision needs to be made, or \"Accepted\" in case of obvious bugs or\n+      sensible, clearly defined, feature requests.\n+\n+    * Correcting the \"Needs tests\", \"Needs documentation\", or \"Has patch\"\n+      flags for tickets where they are incorrectly set.\n+\n+    * Setting the \"`Easy pickings`_\" flag for tickets that are small and\n+      relatively straightforward.\n+\n+    * Checking that old tickets are still valid. If a ticket hasn't seen\n+      any activity in a long time, it's possible that the problem has been\n+      fixed but the ticket hasn't yet been closed.\n+\n+    * Contacting the owners of tickets that have been claimed but have not\n+      seen any recent activity. If the owner doesn't respond after a week\n+      or so, remove the owner's claim on the ticket.\n+\n+    * Identifying trends and themes in the tickets. If there a lot of bug\n+      reports about a particular part of Django, it may indicate we should\n+      consider refactoring that part of the code. If a trend is emerging,\n+      you should raise it for discussion (referencing the relevant tickets)\n+      on `django-developers`_.\n+\n+    * Set the *type* of tickets that are still uncategorized.\n+\n+    * Verify if patches submitted by other users are correct. If they do and\n+      also contain appropriate documentation and tests then move them to the\n+      \"Ready for Checkin\" stage. If they don't then leave a comment to explain\n+      why and set the corresponding flags (\"Patch needs improvement\",\n+      \"Needs tests\" etc.).\n+\n+.. note::\n+\n+    The `Reports page`_ contains links to many useful Trac queries, including\n+    several that are useful for triaging tickets and reviewing patches as\n+    suggested above.\n+\n+    You can also find more :doc:`new-contributors`.\n+\n+    .. _Reports page: http://code.djangoproject.com/wiki/Reports\n+\n+However, we do ask the following of all general community members working in\n+the ticket database:\n+\n+    * Please **don't** close tickets as \"wontfix.\" The core developers will\n+      make the final determination of the fate of a ticket, usually after\n+      consultation with the community.\n+\n+    * Please **don't** promote your own tickets to \"Ready for checkin\". You\n+      may mark other people's tickets which you've reviewed as \"Ready for\n+      checkin\", but you should get at minimum one other community member to\n+      review a patch that you submit.\n+\n+    * Please **don't** reverse a decision that has been made by a core\n+      developer. If you disagree with a decision that has been made,\n+      please post a message to `django-developers`_.\n+\n+    * If you're unsure if you should be making a change, don't make the\n+      change but instead leave a comment with your concerns on the ticket,\n+      or post a message to `django-developers`_. It's okay to be unsure,\n+      but your input is still valuable.\n+\n+.. _Trac: http://code.djangoproject.com/\n+.. _django-developers: http://groups.google.com/group/django-developers\n+.. _i18n branch: http://code.djangoproject.com/browser/django/branches/i18n\n+.. _`tags/releases`: http://code.djangoproject.com/browser/django/tags/releases\n+.. _`easy pickings`: http://code.djangoproject.com/query?status=!closed&easy=1\n+.. _`creating an account on Trac`: http://www.djangoproject.com/accounts/register/\n+.. _password reset page: http://www.djangoproject.com/accounts/password/reset/"
        },
        {
            "sha": "08dfe8bc769fbcc17176c829084770f107de0f6f",
            "filename": "docs/internals/contributing/writing-code/branch-policy.txt",
            "status": "added",
            "additions": 180,
            "deletions": 0,
            "changes": 180,
            "blob_url": "https://github.com/django/django/blob/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fwriting-code%2Fbranch-policy.txt",
            "raw_url": "https://github.com/django/django/raw/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fwriting-code%2Fbranch-policy.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing%2Fwriting-code%2Fbranch-policy.txt?ref=407f62fd31689b6158902d3ffdcde64aa27679a7",
            "patch": "@@ -0,0 +1,180 @@\n+=============\n+Branch policy\n+=============\n+\n+In general, the trunk must be kept stable. People should be able to run\n+production sites against the trunk at any time. Additionally, commits to trunk\n+ought to be as atomic as possible -- smaller changes are better. Thus, large\n+feature changes -- that is, changes too large to be encapsulated in a single\n+patch, or changes that need multiple eyes on them -- must happen on dedicated\n+branches.\n+\n+This means that if you want to work on a large feature -- anything that would\n+take more than a single patch, or requires large-scale refactoring -- you need\n+to do it on a feature branch. Our development process recognizes two options\n+for feature branches:\n+\n+    1. Feature branches using a distributed revision control system like\n+       Git_, Mercurial_, Bazaar_, etc.\n+\n+       If you're familiar with one of these tools, this is probably your best\n+       option since it doesn't require any support or buy-in from the Django\n+       core developers.\n+\n+       However, do keep in mind that Django will continue to use Subversion\n+       for the foreseeable future, and this will naturally limit the\n+       recognition of your branch. Further, if your branch becomes eligible\n+       for merging to trunk you'll need to find a core developer familiar\n+       with your DVCS of choice who'll actually perform the merge.\n+\n+       If you do decided to start a distributed branch of Django and choose to\n+       make it public, please add the branch to the `Django branches`_ wiki\n+       page.\n+\n+    2. Feature branches using SVN have a higher bar. If you want a branch\n+       in SVN itself, you'll need a \"mentor\" among the :doc:`core committers\n+       </internals/committers>`. This person is responsible for actually\n+       creating the branch, monitoring your process (see below), and\n+       ultimately merging the branch into trunk.\n+\n+       If you want a feature branch in SVN, you'll need to ask in\n+       `django-developers`_ for a mentor.\n+\n+.. _git: http://git-scm.com/\n+.. _mercurial: http://mercurial.selenic.com/\n+.. _bazaar: http://bazaar.canonical.com/\n+.. _django branches: http://code.djangoproject.com/wiki/DjangoBranches\n+\n+Branch rules\n+------------\n+\n+We've got a few rules for branches born out of experience with what makes a\n+successful Django branch.\n+\n+DVCS branches are obviously not under central control, so we have no way of\n+enforcing these rules. However, if you're using a DVCS, following these rules\n+will give you the best chance of having a successful branch (read: merged back\n+to trunk).\n+\n+Developers with branches in SVN, however, **must** follow these rules. The\n+branch mentor will keep on eye on the branch and **will delete it** if these\n+rules are broken.\n+\n+    * Only branch entire copies of the Django tree, even if work is only\n+      happening on part of that tree. This makes it painless to switch to a\n+      branch.\n+\n+    * Merge changes from trunk no less than once a week, and preferably every\n+      couple-three days.\n+\n+      In our experience, doing regular trunk merges is often the difference\n+      between a successful branch and one that fizzles and dies.\n+\n+      If you're working on an SVN branch, you should be using `svnmerge.py`_\n+      to track merges from trunk.\n+\n+    * Keep tests passing and documentation up-to-date. As with patches,\n+      we'll only merge a branch that comes with tests and documentation.\n+\n+.. _svnmerge.py: http://www.orcaware.com/svn/wiki/Svnmerge.py\n+\n+Once the branch is stable and ready to be merged into the trunk, alert\n+`django-developers`_.\n+\n+After a branch has been merged, it should be considered \"dead\"; write access\n+to it will be disabled, and old branches will be periodically \"trimmed.\"\n+To keep our SVN wrangling to a minimum, we won't be merging from a given\n+branch into the trunk more than once.\n+\n+Using branches\n+--------------\n+\n+To use a branch, you'll need to do two things:\n+\n+    * Get the branch's code through Subversion.\n+\n+    * Point your Python ``site-packages`` directory at the branch's version of\n+      the ``django`` package rather than the version you already have\n+      installed.\n+\n+Getting the code from Subversion\n+~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n+\n+To get the latest version of a branch's code, check it out using Subversion:\n+\n+.. code-block:: bash\n+\n+    svn co http://code.djangoproject.com/svn/django/branches/<branch>/\n+\n+...where ``<branch>`` is the branch's name. See the `list of branch names`_.\n+\n+Alternatively, you can automatically convert an existing directory of the\n+Django source code as long as you've checked it out via Subversion. To do the\n+conversion, execute this command from within your ``django`` directory:\n+\n+.. code-block:: bash\n+\n+    svn switch http://code.djangoproject.com/svn/django/branches/<branch>/\n+\n+The advantage of using ``svn switch`` instead of ``svn co`` is that the\n+``switch`` command retains any changes you might have made to your local copy\n+of the code. It attempts to merge those changes into the \"switched\" code. The\n+disadvantage is that it may cause conflicts with your local changes if the\n+\"switched\" code has altered the same lines of code.\n+\n+(Note that if you use ``svn switch``, you don't need to point Python at the\n+new version, as explained in the next section.)\n+\n+.. _list of branch names: http://code.djangoproject.com/browser/django/branches\n+\n+.. _pointing-python-at-the-new-django-version:\n+\n+Pointing Python at the new Django version\n+~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n+\n+Once you've retrieved the branch's code, you'll need to change your Python\n+``site-packages`` directory so that it points to the branch version of the\n+``django`` directory. (The ``site-packages`` directory is somewhere such as\n+``/usr/lib/python2.4/site-packages`` or\n+``/usr/local/lib/python2.4/site-packages`` or ``C:\\Python\\site-packages``.)\n+\n+The simplest way to do this is by renaming the old ``django`` directory to\n+``django.OLD`` and moving the trunk version of the code into the directory\n+and calling it ``django``.\n+\n+Alternatively, you can use a symlink called ``django`` that points to the\n+location of the branch's ``django`` package. If you want to switch back, just\n+change the symlink to point to the old code.\n+\n+A third option is to use a `path file`_ (``<something>.pth``) which should\n+work on all systems (including Windows, which doesn't have symlinks\n+available). First, make sure there are no files, directories or symlinks named\n+``django`` in your ``site-packages`` directory. Then create a text file named\n+``django.pth`` and save it to your ``site-packages`` directory. That file\n+should contain a path to your copy of Django on a single line and optional\n+comments. Here is an example that points to multiple branches. Just uncomment\n+the line for the branch you want to use ('Trunk' in this example) and make\n+sure all other lines are commented::\n+\n+    # Trunk is a svn checkout of:\n+    #   http://code.djangoproject.com/svn/django/trunk/\n+    #\n+    /path/to/trunk\n+\n+    # <branch> is a svn checkout of:\n+    #   http://code.djangoproject.com/svn/django/branches/<branch>/\n+    #\n+    #/path/to/<branch>\n+\n+    # On windows a path may look like this:\n+    # C:/path/to/<branch>\n+\n+If you're using Django 0.95 or earlier and installed it using\n+``python setup.py install``, you'll have a directory called something like\n+``Django-0.95-py2.4.egg`` instead of ``django``. In this case, edit the file\n+``setuptools.pth`` and remove the line that references the Django ``.egg``\n+file. Then copy the branch's version of the ``django`` directory into\n+``site-packages``.\n+\n+.. _path file: http://docs.python.org/library/site.html\n+.. _django-developers: http://groups.google.com/group/django-developers"
        },
        {
            "sha": "616550dcefd53262a266af2e41d6d798f5d569ff",
            "filename": "docs/internals/contributing/writing-code/coding-style.txt",
            "status": "added",
            "additions": 190,
            "deletions": 0,
            "changes": 190,
            "blob_url": "https://github.com/django/django/blob/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fwriting-code%2Fcoding-style.txt",
            "raw_url": "https://github.com/django/django/raw/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fwriting-code%2Fcoding-style.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing%2Fwriting-code%2Fcoding-style.txt?ref=407f62fd31689b6158902d3ffdcde64aa27679a7",
            "patch": "@@ -0,0 +1,190 @@\n+============\n+Coding Style\n+============\n+\n+Please follow these coding standards when writing code for inclusion in Django.\n+\n+Python style\n+------------\n+\n+    * Unless otherwise specified, follow :pep:`8`.\n+\n+      You could use a tool like `pep8.py`_ to check for some problems in this\n+      area, but remember that PEP 8 is only a guide, so respect the style of\n+      the surrounding code as a primary goal.\n+\n+    * Use four spaces for indentation.\n+\n+    * Use underscores, not camelCase, for variable, function and method names\n+      (i.e. ``poll.get_unique_voters()``, not ``poll.getUniqueVoters``).\n+\n+    * Use ``InitialCaps`` for class names (or for factory functions that\n+      return classes).\n+\n+    * In docstrings, use \"action words\" such as::\n+\n+          def foo():\n+              \"\"\"\n+              Calculates something and returns the result.\n+              \"\"\"\n+              pass\n+\n+      Here's an example of what not to do::\n+\n+          def foo():\n+              \"\"\"\n+              Calculate something and return the result.\n+              \"\"\"\n+              pass\n+\n+Template style\n+--------------\n+\n+    * In Django template code, put one (and only one) space between the curly\n+      brackets and the tag contents.\n+\n+      Do this:\n+\n+      .. code-block:: html+django\n+\n+          {{ foo }}\n+\n+      Don't do this:\n+\n+      .. code-block:: html+django\n+\n+          {{foo}}\n+\n+View style\n+----------\n+\n+    * In Django views, the first parameter in a view function should be called\n+      ``request``.\n+\n+      Do this::\n+\n+          def my_view(request, foo):\n+              # ...\n+\n+      Don't do this::\n+\n+          def my_view(req, foo):\n+              # ...\n+\n+Model style\n+-----------\n+\n+    * Field names should be all lowercase, using underscores instead of\n+      camelCase.\n+\n+      Do this::\n+\n+          class Person(models.Model):\n+              first_name = models.CharField(max_length=20)\n+              last_name = models.CharField(max_length=40)\n+\n+      Don't do this::\n+\n+          class Person(models.Model):\n+              FirstName = models.CharField(max_length=20)\n+              Last_Name = models.CharField(max_length=40)\n+\n+    * The ``class Meta`` should appear *after* the fields are defined, with\n+      a single blank line separating the fields and the class definition.\n+\n+      Do this::\n+\n+          class Person(models.Model):\n+              first_name = models.CharField(max_length=20)\n+              last_name = models.CharField(max_length=40)\n+\n+              class Meta:\n+                  verbose_name_plural = 'people'\n+\n+      Don't do this::\n+\n+          class Person(models.Model):\n+              first_name = models.CharField(max_length=20)\n+              last_name = models.CharField(max_length=40)\n+              class Meta:\n+                  verbose_name_plural = 'people'\n+\n+      Don't do this, either::\n+\n+          class Person(models.Model):\n+              class Meta:\n+                  verbose_name_plural = 'people'\n+\n+              first_name = models.CharField(max_length=20)\n+              last_name = models.CharField(max_length=40)\n+\n+    * The order of model inner classes and standard methods should be as\n+      follows (noting that these are not all required):\n+\n+        * All database fields\n+        * Custom manager attributes\n+        * ``class Meta``\n+        * ``def __unicode__()``\n+        * ``def __str__()``\n+        * ``def save()``\n+        * ``def get_absolute_url()``\n+        * Any custom methods\n+\n+    * If ``choices`` is defined for a given model field, define the choices as\n+      a tuple of tuples, with an all-uppercase name, either near the top of\n+      the model module or just above the model class. Example::\n+\n+          GENDER_CHOICES = (\n+              ('M', 'Male'),\n+              ('F', 'Female'),\n+          )\n+\n+Use of ``django.conf.settings``\n+-------------------------------\n+\n+Modules should not in general use settings stored in ``django.conf.settings``\n+at the top level (i.e. evaluated when the module is imported). The explanation\n+for this is as follows:\n+\n+Manual configuration of settings (i.e. not relying on the\n+``DJANGO_SETTINGS_MODULE`` environment variable) is allowed and possible as\n+follows::\n+\n+    from django.conf import settings\n+\n+    settings.configure({}, SOME_SETTING='foo')\n+\n+However, if any setting is accessed before the ``settings.configure`` line,\n+this will not work. (Internally, ``settings`` is a ``LazyObject`` which\n+configures itself automatically when the settings are accessed if it has not\n+already been configured).\n+\n+So, if there is a module containing some code as follows::\n+\n+    from django.conf import settings\n+    from django.core.urlresolvers import get_callable\n+\n+    default_foo_view = get_callable(settings.FOO_VIEW)\n+\n+...then importing this module will cause the settings object to be configured.\n+That means that the ability for third parties to import the module at the top\n+level is incompatible with the ability to configure the settings object\n+manually, or makes it very difficult in some circumstances.\n+\n+Instead of the above code, a level of laziness or indirection must be used,\n+such as `django.utils.functional.LazyObject``, ``django.utils.functional.lazy``\n+or ``lambda``.\n+\n+Miscellaneous\n+-------------\n+\n+    * Mark all strings for internationalization; see the :doc:`i18n\n+      documentation </topics/i18n/index>` for details.\n+\n+    * Please don't put your name in the code you contribute. Our policy is to\n+      keep contributors' names in the ``AUTHORS`` file distributed with Django\n+      -- not scattered throughout the codebase itself. Feel free to include a\n+      change to the ``AUTHORS`` file in your patch if you make more than a\n+      single trivial change.\n+\n+.. _pep8.py: http://pypi.python.org/pypi/pep8/"
        },
        {
            "sha": "bd9b2a346a3c68b3588ba5191315f20d5ddbc138",
            "filename": "docs/internals/contributing/writing-code/index.txt",
            "status": "added",
            "additions": 15,
            "deletions": 0,
            "changes": 15,
            "blob_url": "https://github.com/django/django/blob/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fwriting-code%2Findex.txt",
            "raw_url": "https://github.com/django/django/raw/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fwriting-code%2Findex.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing%2Fwriting-code%2Findex.txt?ref=407f62fd31689b6158902d3ffdcde64aa27679a7",
            "patch": "@@ -0,0 +1,15 @@\n+============\n+Writing code\n+============\n+\n+So you'd like to write some code to improve Django. Awesome! Browse the\n+following sections to find out how to give your code patches the best\n+chances to be included in Django core:\n+\n+.. toctree::\n+   :maxdepth: 1\n+\n+   coding-style\n+   unit-tests\n+   submitting-patches\n+   branch-policy"
        },
        {
            "sha": "4eb74e1b1e332c48576b244eff2006882f50c8b3",
            "filename": "docs/internals/contributing/writing-code/submitting-patches.txt",
            "status": "added",
            "additions": 160,
            "deletions": 0,
            "changes": 160,
            "blob_url": "https://github.com/django/django/blob/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fwriting-code%2Fsubmitting-patches.txt",
            "raw_url": "https://github.com/django/django/raw/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fwriting-code%2Fsubmitting-patches.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing%2Fwriting-code%2Fsubmitting-patches.txt?ref=407f62fd31689b6158902d3ffdcde64aa27679a7",
            "patch": "@@ -0,0 +1,160 @@\n+==================\n+Submitting patches\n+==================\n+\n+We're always grateful for patches to Django's code. Indeed, bug reports\n+with associated patches will get fixed *far* more quickly than those\n+without patches.\n+\n+\"Claiming\" tickets\n+------------------\n+\n+In an open-source project with hundreds of contributors around the world, it's\n+important to manage communication efficiently so that work doesn't get\n+duplicated and contributors can be as effective as possible. Hence, our policy\n+is for contributors to \"claim\" tickets in order to let other developers know\n+that a particular bug or feature is being worked on.\n+\n+If you have identified a contribution you want to make and you're capable of\n+fixing it (as measured by your coding ability, knowledge of Django internals\n+and time availability), claim it by following these steps:\n+\n+    * `Create an account`_ to use in our ticket system. If you have an account\n+      but have forgotten your password, you can reset it using the\n+      `password reset page`_.\n+\n+    * If a ticket for this issue doesn't exist yet, create one in our\n+      `ticket tracker`_.\n+\n+    * If a ticket for this issue already exists, make sure nobody else has\n+      claimed it. To do this, look at the \"Assigned to\" section of the ticket.\n+      If it's assigned to \"nobody,\" then it's available to be claimed.\n+      Otherwise, somebody else is working on this ticket, and you either find\n+      another bug/feature to work on, or contact the developer working on the\n+      ticket to offer your help.\n+\n+    * Log into your account, if you haven't already, by clicking \"Login\" in\n+      the upper right of the ticket page.\n+\n+    * Claim the ticket by clicking the radio button next to \"Accept ticket\"\n+      near the bottom of the page, then clicking \"Submit changes.\"\n+\n+.. _Create an account: https://www.djangoproject.com/accounts/register/\n+.. _password reset page: https://www.djangoproject.com/accounts/password/reset/\n+\n+Ticket claimers' responsibility\n+~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n+\n+Once you've claimed a ticket, you have a responsibility to work on that ticket\n+in a reasonably timely fashion. If you don't have time to work on it, either\n+unclaim it or don't claim it in the first place!\n+\n+If there's no sign of progress on a particular claimed ticket for a week or\n+two, another developer may ask you to relinquish the ticket claim so that it's\n+no longer monopolized and somebody else can claim it.\n+\n+If you've claimed a ticket and it's taking a long time (days or weeks) to code,\n+keep everybody updated by posting comments on the ticket. If you don't provide\n+regular updates, and you don't respond to a request for a progress report,\n+your claim on the ticket may be revoked. As always, more communication is\n+better than less communication!\n+\n+Which tickets should be claimed?\n+~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n+\n+Of course, going through the steps of claiming tickets is overkill in some\n+cases. In the case of small changes, such as typos in the documentation or\n+small bugs that will only take a few minutes to fix, you don't need to jump\n+through the hoops of claiming tickets. Just submit your patch and be done with\n+it.\n+\n+.. _patch-style:\n+\n+Patch style\n+-----------\n+\n+    * Make sure your code matches our :doc:`coding-style`.\n+\n+    * Submit patches in the format returned by the ``svn diff`` command.\n+      An exception is for code changes that are described more clearly in\n+      plain English than in code. Indentation is the most common example; it's\n+      hard to read patches when the only difference in code is that it's\n+      indented.\n+\n+      Patches in ``git diff`` format are also acceptable.\n+\n+    * When creating patches, always run ``svn diff`` from the top-level\n+      ``trunk`` directory -- i.e., the one that contains ``django``, ``docs``,\n+      ``tests``, ``AUTHORS``, etc. This makes it easy for other people to\n+      apply your patches.\n+\n+    * Attach patches to a ticket in the `ticket tracker`_, using the \"attach\n+      file\" button. Please *don't* put the patch in the ticket description\n+      or comment unless it's a single line patch.\n+\n+    * Name the patch file with a ``.diff`` extension; this will let the ticket\n+      tracker apply correct syntax highlighting, which is quite helpful.\n+\n+    * Check the \"Has patch\" box on the ticket details. This will make it\n+      obvious that the ticket includes a patch, and it will add the ticket to\n+      the `list of tickets with patches`_.\n+\n+    * The code required to fix a problem or add a feature is an essential part\n+      of a patch, but it is not the only part. A good patch should also\n+      include a regression test to validate the behavior that has been fixed\n+      (and prevent the problem from arising again).\n+\n+    * If the code associated with a patch adds a new feature, or modifies\n+      behavior of an existing feature, the patch should also contain\n+      documentation.\n+\n+Non-trivial patches\n+-------------------\n+\n+A \"non-trivial\" patch is one that is more than a simple bug fix. It's a patch\n+that introduces Django functionality and makes some sort of design decision.\n+\n+If you provide a non-trivial patch, include evidence that alternatives have\n+been discussed on `django-developers`_. If you're not sure whether your patch\n+should be considered non-trivial, just ask.\n+\n+Javascript patches\n+------------------\n+\n+.. versionadded:: 1.2\n+\n+Django's admin system leverages the jQuery framework to increase the\n+capabilities of the admin interface. In conjunction, there is an emphasis on\n+admin javascript performance and minimizing overall admin media file size.\n+Serving compressed or \"minified\" versions of javascript files is considered\n+best practice in this regard.\n+\n+To that end, patches for javascript files should include both the original\n+code for future development (e.g. \"foo.js\"), and a compressed version for\n+production use (e.g. \"foo.min.js\"). Any links to the file in the codebase\n+should point to the compressed version.\n+\n+To simplify the process of providing optimized javascript code, Django\n+includes a handy script which should be used to create a \"minified\" version.\n+This script is located at ``/contrib/admin/media/js/compress.py``.\n+\n+Behind the scenes, ``compress.py`` is a front-end for Google's\n+`Closure Compiler`_ which is written in Java. However, the Closure Compiler\n+library is not bundled with Django directly, so those wishing to contribute\n+complete javascript patches will need to download and install the library\n+independently.\n+\n+The Closure Compiler library requires Java version 6 or higher (Java 1.6 or\n+higher on Mac OS X). Note that Mac OS X 10.5 and earlier did not ship with\n+Java 1.6 by default, so it may be necessary to upgrade your Java installation\n+before the tool will be functional. Also note that even after upgrading Java,\n+the default `/usr/bin/java` command may remain linked to the previous Java\n+binary, so relinking that command may be necessary as well.\n+\n+Please don't forget to run ``compress.py`` and include the ``diff`` of the\n+minified scripts when submitting patches for Django's javascript.\n+\n+.. _Closure Compiler: http://code.google.com/closure/compiler/\n+.. _django-developers: http://groups.google.com/group/django-developers\n+.. _list of tickets with patches: http://code.djangoproject.com/query?status=new&status=assigned&status=reopened&has_patch=1&order=priority\n+.. _ticket tracker: http://code.djangoproject.com/newticket"
        },
        {
            "sha": "fd9024e1a9e8a447c6143bcd3c06012d3d0bdea9",
            "filename": "docs/internals/contributing/writing-code/unit-tests.txt",
            "status": "added",
            "additions": 167,
            "deletions": 0,
            "changes": 167,
            "blob_url": "https://github.com/django/django/blob/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fwriting-code%2Funit-tests.txt",
            "raw_url": "https://github.com/django/django/raw/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fwriting-code%2Funit-tests.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing%2Fwriting-code%2Funit-tests.txt?ref=407f62fd31689b6158902d3ffdcde64aa27679a7",
            "patch": "@@ -0,0 +1,167 @@\n+==========\n+Unit tests\n+==========\n+\n+Django comes with a test suite of its own, in the ``tests`` directory of the\n+Django tarball. It's our policy to make sure all tests pass at all times.\n+\n+The tests cover:\n+\n+    * Models and the database API (``tests/modeltests/``).\n+    * Everything else in core Django code (``tests/regressiontests``)\n+    * Contrib apps (``django/contrib/<contribapp>/tests``, see below)\n+\n+We appreciate any and all contributions to the test suite!\n+\n+The Django tests all use the testing infrastructure that ships with Django for\n+testing applications. See :doc:`Testing Django applications </topics/testing>`\n+for an explanation of how to write new tests.\n+\n+.. _running-unit-tests:\n+\n+Running the unit tests\n+----------------------\n+\n+Quickstart\n+~~~~~~~~~~\n+\n+Running the tests requires a Django settings module that defines the\n+databases to use. To make it easy to get started. Django provides a\n+sample settings module that uses the SQLite database. To run the tests\n+with this sample ``settings`` module, ``cd`` into the Django\n+``tests/`` directory and run:\n+\n+.. code-block:: bash\n+\n+    ./runtests.py --settings=test_sqlite\n+\n+If you get an ``ImportError: No module named django.contrib`` error,\n+you need to add your install of Django to your ``PYTHONPATH``. For\n+more details on how to do this, read\n+:ref:`pointing-python-at-the-new-django-version`.\n+\n+Using another ``settings`` module\n+~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n+\n+The included settings module allows you to run the test suite using\n+SQLite. If you want to test behavior using a different database (and\n+if you're proposing patches for Django, it's a good idea to test\n+across databases), you may need to define your own settings file.\n+\n+To run the tests with different settings, ``cd`` to the ``tests/`` directory\n+and type:\n+\n+.. code-block:: bash\n+\n+    ./runtests.py --settings=path.to.django.settings\n+\n+The :setting:`DATABASES` setting in this test settings module needs to define\n+two databases:\n+\n+    * A ``default`` database. This database should use the backend that\n+      you want to use for primary testing\n+\n+    * A database with the alias ``other``. The ``other`` database is\n+      used to establish that queries can be directed to different\n+      databases. As a result, this database can use any backend you\n+      want. It doesn't need to use the same backend as the ``default``\n+      database (although it can use the same backend if you want to).\n+\n+If you're using a backend that isn't SQLite, you will need to provide other\n+details for each database:\n+\n+    * The :setting:`USER` option for each of your databases needs to\n+      specify an existing user account for the database.\n+\n+    * The :setting:`PASSWORD` option needs to provide the password for\n+      the :setting:`USER` that has been specified.\n+\n+    * The :setting:`NAME` option must be the name of an existing database to\n+      which the given user has permission to connect. The unit tests will not\n+      touch this database; the test runner creates a new database whose name\n+      is :setting:`NAME` prefixed with ``test_``, and this test database is\n+      deleted when the tests are finished. This means your user account needs\n+      permission to execute ``CREATE DATABASE``.\n+\n+You will also need to ensure that your database uses UTF-8 as the default\n+character set. If your database server doesn't use UTF-8 as a default charset,\n+you will need to include a value for ``TEST_CHARSET`` in the settings\n+dictionary for the applicable database.\n+\n+Running only some of the tests\n+~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n+\n+Django's entire test suite takes a while to run, and running every single test\n+could be redundant if, say, you just added a test to Django that you want to\n+run quickly without running everything else. You can run a subset of the unit\n+tests by appending the names of the test modules to ``runtests.py`` on the\n+command line.\n+\n+For example, if you'd like to run tests only for generic relations and\n+internationalization, type:\n+\n+.. code-block:: bash\n+\n+    ./runtests.py --settings=path.to.settings generic_relations i18n\n+\n+How do you find out the names of individual tests? Look in\n+``tests/modeltests`` and ``tests/regressiontests`` -- each directory name\n+there is the name of a test.\n+\n+If you just want to run a particular class of tests, you can specify a list of\n+paths to individual test classes. For example, to run the ``TranslationTests``\n+of the ``i18n`` module, type:\n+\n+.. code-block:: bash\n+\n+    ./runtests.py --settings=path.to.settings i18n.TranslationTests\n+\n+Going beyond that, you can specify an individual test method like this:\n+\n+.. code-block:: bash\n+\n+    ./runtests.py --settings=path.to.settings i18n.TranslationTests.test_lazy_objects\n+\n+Running all the tests\n+~~~~~~~~~~~~~~~~~~~~~\n+\n+If you want to run the full suite of tests, you'll need to install a number of\n+dependencies:\n+\n+    *  PyYAML_\n+    *  Markdown_\n+    *  Textile_\n+    *  Docutils_\n+    *  setuptools_\n+    *  memcached_, plus a :ref:`supported Python binding <memcached>`\n+    *  gettext_ (:ref:`gettext_on_windows`)\n+\n+If you want to test the memcached cache backend, you'll also need to define\n+a :setting:`CACHES` setting that points at your memcached instance.\n+\n+Each of these dependencies is optional. If you're missing any of them, the\n+associated tests will be skipped.\n+\n+.. _PyYAML: http://pyyaml.org/wiki/PyYAML\n+.. _Markdown: http://pypi.python.org/pypi/Markdown/1.7\n+.. _Textile: http://pypi.python.org/pypi/textile\n+.. _docutils: http://pypi.python.org/pypi/docutils/0.4\n+.. _setuptools: http://pypi.python.org/pypi/setuptools/\n+.. _memcached: http://www.danga.com/memcached/\n+.. _gettext: http://www.gnu.org/software/gettext/manual/gettext.html\n+\n+Contrib apps\n+------------\n+\n+Tests for apps in ``django/contrib/`` go in their respective directories under\n+``django/contrib/``, in a ``tests.py`` file. (You can split the tests over\n+multiple modules by using a ``tests`` directory in the normal Python way.)\n+\n+For the tests to be found, a ``models.py`` file must exist (it doesn't\n+have to have anything in it). If you have URLs that need to be\n+mapped, put them in ``tests/urls.py``.\n+\n+To run tests for just one contrib app (e.g. ``markup``), use the same\n+method as above::\n+\n+    ./runtests.py --settings=settings markup"
        },
        {
            "sha": "39723057dd1dc2658b080bc8902727999cf9280a",
            "filename": "docs/internals/contributing/writing-documentation.txt",
            "status": "renamed",
            "additions": 139,
            "deletions": 45,
            "changes": 184,
            "blob_url": "https://github.com/django/django/blob/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fwriting-documentation.txt",
            "raw_url": "https://github.com/django/django/raw/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Fcontributing%2Fwriting-documentation.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing%2Fwriting-documentation.txt?ref=407f62fd31689b6158902d3ffdcde64aa27679a7",
            "patch": "@@ -1,10 +1,28 @@\n-How the Django documentation works\n-==================================\n+=====================\n+Writing documentation\n+=====================\n \n-\\... and how to contribute.\n+We place a high importance on consistency and readability of documentation.\n+After all, Django was created in a journalism environment! So we treat our\n+documentation like we treat our code: we aim to improve it as often as\n+possible.\n \n-Django's documentation uses the Sphinx__ documentation system, which in turn is\n-based on docutils__. The basic idea is that lightly-formatted plain-text\n+Documentation changes generally come in two forms:\n+\n+    * General improvements -- Typo corrections, error fixes and better\n+      explanations through clearer writing and more examples.\n+\n+    * New features -- Documentation of features that have been added to the\n+      framework since the last release.\n+\n+This section explains how writers can craft their documentation changes\n+in the most useful and least error-prone ways.\n+\n+Getting started with Sphinx\n+---------------------------\n+\n+Django's documentation uses the Sphinx__ documentation system, which in turn\n+is based on docutils__. The basic idea is that lightly-formatted plain-text\n documentation is transformed into HTML, PDF, and any other output format.\n \n __ http://sphinx.pocoo.org/\n@@ -22,7 +40,8 @@ Sphinx -- ``easy_install Sphinx`` should do the trick.\n \n __ http://pygments.org\n \n-Then, building the HTML is easy; just ``make html`` from the ``docs`` directory.\n+Then, building the HTML is easy; just ``make html`` from the ``docs``\n+directory.\n \n To get started contributing, you'll want to read the `reStructuredText\n Primer`__. After that, you'll want to read about the `Sphinx-specific markup`__\n@@ -31,23 +50,78 @@ that's used to manage metadata, indexing, and cross-references.\n __ http://sphinx.pocoo.org/rest.html\n __ http://sphinx.pocoo.org/markup/\n \n-The main thing to keep in mind as you write and edit docs is that the more\n-semantic markup you can add the better. So::\n+Commonly used terms\n+-------------------\n+\n+Here are some style guidelines on commonly used terms throughout the\n+documentation:\n+\n+    * **Django** -- when referring to the framework, capitalize Django. It is\n+      lowercase only in Python code and in the djangoproject.com logo.\n+\n+    * **email** -- no hyphen.\n+\n+    * **MySQL**\n+\n+    * **PostgreSQL**\n+\n+    * **Python** -- when referring to the language, capitalize Python.\n+\n+    * **realize**, **customize**, **initialize**, etc. -- use the American\n+      \"ize\" suffix, not \"ise.\"\n+\n+    * **SQLite**\n+\n+    * **subclass** -- it's a single word without a hyphen, both as a verb\n+      (\"subclass that model\") and as a noun (\"create a subclass\").\n+\n+    * **Web**, **World Wide Web**, **the Web** -- note Web is always\n+      capitalized when referring to the World Wide Web.\n+\n+    * **Web site** -- use two words, with Web capitalized.\n+\n+Django-specific terminology\n+---------------------------\n+\n+    * **model** -- it's not capitalized.\n+\n+    * **template** -- it's not capitalized.\n+\n+    * **URLconf** -- use three capitalized letters, with no space before\n+      \"conf.\"\n \n-    Add ``django.contrib.auth`` to your ``INSTALLED_APPS``...\n+    * **view** -- it's not capitalized.\n \n-Isn't nearly as helpful as::\n+Guidelines for reStructuredText files\n+-------------------------------------\n \n-    Add :mod:`django.contrib.auth` to your :setting:`INSTALLED_APPS`...\n+These guidelines regulate the format of our reST (reStructuredText)\n+documentation:\n \n-This is because Sphinx will generate proper links for the latter, which greatly\n-helps readers. There's basically no limit to the amount of useful markup you can\n-add.\n+    * In section titles, capitalize only initial words and proper nouns.\n+\n+    * Wrap the documentation at 80 characters wide, unless a code example\n+      is significantly less readable when split over two lines, or for another\n+      good reason.\n+\n+    * The main thing to keep in mind as you write and edit docs is that the\n+      more semantic markup you can add the better. So::\n+\n+          Add ``django.contrib.auth`` to your ``INSTALLED_APPS``...\n+\n+      Isn't nearly as helpful as::\n+\n+          Add :mod:`django.contrib.auth` to your :setting:`INSTALLED_APPS`...\n+\n+      This is because Sphinx will generate proper links for the latter, which\n+      greatly helps readers. There's basically no limit to the amount of\n+      useful markup you can add.\n \n Django-specific markup\n ----------------------\n \n-Besides the `Sphinx built-in markup`__, Django's docs defines some extra description units:\n+Besides the `Sphinx built-in markup`__, Django's docs defines some extra\n+description units:\n \n __ http://sphinx.pocoo.org/markup/desc.html\n \n@@ -87,6 +161,26 @@ __ http://sphinx.pocoo.org/markup/desc.html\n \n       To link, use ``:djadminopt:`--traceback```.\n \n+.. _documenting-new-features:\n+\n+Documenting new features\n+------------------------\n+\n+Our policy for new features is:\n+\n+    **All documentation of new features should be written in a way that\n+    clearly designates the features are only available in the Django\n+    development version. Assume documentation readers are using the latest\n+    release, not the development version.**\n+\n+Our preferred way for marking new features is by prefacing the features'\n+documentation with: \"``.. versionadded:: X.Y``\", followed by an optional one\n+line comment and a mandatory blank line.\n+\n+General improvements, or other changes to the APIs that should be emphasized\n+should use the \"``.. versionchanged:: X.Y``\" directive (with the same format\n+as the ``versionadded`` mentioned above.\n+\n An example\n ----------\n \n@@ -127,7 +221,8 @@ example:\n         <available-settings>`. For a list of deprecated settings see\n         :ref:`deprecated-settings`.\n \n-        You can find both in the :doc:`settings reference document </ref/settings>`.\n+        You can find both in the :doc:`settings reference document\n+        </ref/settings>`.\n \n       We use the Sphinx doc_ cross reference element when we want to link to\n       another document as a whole and the ref_ element when we want to link to\n@@ -147,31 +242,34 @@ example:\n \n         Default: ``()`` (Empty tuple)\n \n-        Used for admin-site settings modules, this should be a tuple of settings\n-        modules (in the format ``'foo.bar.baz'``) for which this site is an\n-        admin.\n+        Used for admin-site settings modules, this should be a tuple of\n+        settings modules (in the format ``'foo.bar.baz'``) for which this site\n+        is an admin.\n \n         The admin site uses this in its automatically-introspected\n         documentation of models, views and template tags.\n \n       This marks up the following header as the \"canonical\" target for the\n-      setting ``ADMIN_FOR`` This means any time I talk about ``ADMIN_FOR``, I\n-      can reference it using ``:setting:`ADMIN_FOR```.\n+      setting ``ADMIN_FOR`` This means any time I talk about ``ADMIN_FOR``,\n+      I can reference it using ``:setting:`ADMIN_FOR```.\n \n That's basically how everything fits together.\n \n-TODO\n-----\n+.. _improving-the-documentation:\n+\n+Improving the documentation\n+---------------------------\n \n-The work is mostly done, but here's what's left, in rough order of priority.\n+A few small improvements can be made to make the documentation read and\n+look better:\n \n     * Most of the various ``index.txt`` documents have *very* short or even\n-      non-existent intro text. Each of those documents needs a good short intro\n-      the content below that point.\n+      non-existent intro text. Each of those documents needs a good short\n+      intro the content below that point.\n \n     * The glossary is very perfunctory. It needs to be filled out.\n \n-    * Add more metadata targets: there's lots of places that look like::\n+    * Add more metadata targets. Lots of places look like::\n \n             ``File.close()``\n             ~~~~~~~~~~~~~~~~\n@@ -194,28 +292,24 @@ The work is mostly done, but here's what's left, in rough order of priority.\n \n       __ http://sphinx.pocoo.org/markup/desc.html#info-field-lists\n \n-    * Add ``.. code-block:: <lang>`` to literal blocks so that they get\n-      highlighted.\n+    * Whenever possible, use links. So, use ``:setting:`ADMIN_FOR``` instead\n+      of ````ADMIN_FOR````.\n \n-Hints\n------\n+    * Use directives where appropriate. Some directives\n+      (e.g. ``.. setting::``) are prefix-style directives; they go *before*\n+      the unit they're describing. These are known as \"crossref\" directives.\n+      Others (e.g. ``.. class::``) generate their own markup; these should go\n+      inside the section they're describing. These are called\n+      \"description units\".\n \n-Some hints for making things look/read better:\n+      You can tell which are which by looking at in\n+      :file:`_ext/djangodocs.py`; it registers roles as one of the other.\n \n-    * Whenever possible, use links. So, use ``:setting:`ADMIN_FOR``` instead of\n-      ````ADMIN_FOR````.\n-\n-    * Some directives (``.. setting::``, for one) are prefix-style directives;\n-      they go *before* the unit they're describing. These are known as\n-      \"crossref\" directives. Others (``.. class::``, e.g.) generate their own\n-      markup; these should go inside the section they're describing. These are\n-      called \"description units\".\n-\n-      You can tell which are which by looking at in :file:`_ext/djangodocs.py`;\n-      it registers roles as one of the other.\n+    * Add ``.. code-block:: <lang>`` to literal blocks so that they get\n+      highlighted.\n \n-    * When referring to classes/functions/modules, etc., you'll want to use the\n-      fully-qualified name of the target\n+    * When referring to classes/functions/modules, etc., you'll want to use\n+      the fully-qualified name of the target\n       (``:class:`django.contrib.contenttypes.models.ContentType```).\n \n       Since this doesn't look all that awesome in the output -- it shows the",
            "previous_filename": "docs/internals/documentation.txt"
        },
        {
            "sha": "991236bb3e55400a39a44fd7d537c6407f8450d2",
            "filename": "docs/internals/index.txt",
            "status": "modified",
            "additions": 2,
            "deletions": 3,
            "changes": 5,
            "blob_url": "https://github.com/django/django/blob/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Findex.txt",
            "raw_url": "https://github.com/django/django/raw/407f62fd31689b6158902d3ffdcde64aa27679a7/docs%2Finternals%2Findex.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Findex.txt?ref=407f62fd31689b6158902d3ffdcde64aa27679a7",
            "patch": "@@ -14,10 +14,9 @@ the hood\".\n     these internals if we must.\n \n .. toctree::\n-   :maxdepth: 1\n+   :maxdepth: 2\n \n-   contributing\n-   documentation\n+   contributing/index\n    committers\n    release-process\n    deprecation"
        }
    ],
    "stats": {
        "total": 3554,
        "additions": 1805,
        "deletions": 1749
    }
}