{
    "author": "unknown",
    "message": "Fixed #16786 -- Minor cleanups in the memcached section of the caching topic guide. Thanks to jamesp for the report and patch.\n\n\ngit-svn-id: http://code.djangoproject.com/svn/django/trunk@16748 bcc190cf-cafb-0310-a4f2-bffc1f526a37",
    "sha": "6ce463aadb50bbc53378a7efc512ea265da9f601",
    "files": [
        {
            "sha": "4518353e15243eac29a78d7d9118e3e7c1391c8c",
            "filename": "docs/topics/cache.txt",
            "status": "modified",
            "additions": 13,
            "deletions": 12,
            "changes": 25,
            "blob_url": "https://github.com/django/django/blob/6ce463aadb50bbc53378a7efc512ea265da9f601/docs%2Ftopics%2Fcache.txt",
            "raw_url": "https://github.com/django/django/raw/6ce463aadb50bbc53378a7efc512ea265da9f601/docs%2Ftopics%2Fcache.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Ftopics%2Fcache.txt?ref=6ce463aadb50bbc53378a7efc512ea265da9f601",
            "patch": "@@ -63,17 +63,18 @@ settings file. Here's an explanation of all available values for\n Memcached\n ---------\n \n-By far the fastest, most efficient type of cache available to Django, Memcached\n-is an entirely memory-based cache framework originally developed to handle high\n-loads at LiveJournal.com and subsequently open-sourced by Danga Interactive.\n-It's used by sites such as Facebook and Wikipedia to reduce database access and\n-dramatically increase site performance.\n-\n-Memcached is available for free at http://memcached.org/. It runs as a\n-daemon and is allotted a specified amount of RAM. All it does is provide a\n-fast interface for adding, retrieving and deleting arbitrary data in the cache.\n-All data is stored directly in memory, so there's no overhead of database or\n-filesystem usage.\n+By far the fastest, most efficient type of cache available to Django,\n+Memcached__ is an entirely memory-based cache framework originally developed to\n+handle high loads at LiveJournal.com and subsequently open-sourced by Danga\n+Interactive.  It is used by sites such as Facebook and Wikipedia to reduce\n+database access and dramatically increase site performance.\n+\n+__ http://memcached.org/\n+\n+Memcached runs as a daemon and is allotted a specified amount of RAM. All it does is\n+provide a fast interface for adding, retrieving and deleting arbitrary data in\n+the cache.  All data is stored directly in memory, so there's no overhead of\n+database or filesystem usage.\n \n After installing Memcached itself, you'll need to install a memcached\n binding. There are several python memcached bindings available; the\n@@ -1144,7 +1145,7 @@ site's performance:\n       and ``Last-Modified`` headers.\n \n     * :class:`django.middleware.gzip.GZipMiddleware` compresses responses for all\n-      moderns browsers, saving bandwidth and transfer time.\n+      modern browsers, saving bandwidth and transfer time.\n \n Order of MIDDLEWARE_CLASSES\n ==========================="
        }
    ],
    "stats": {
        "total": 25,
        "additions": 13,
        "deletions": 12
    }
}