{
    "author": "timgraham",
    "message": "Fixed #10936 - Tempered recommendation of SQLite - thanks Karen Tracey for the feedback.",
    "sha": "9190d89829c4e0b9b0f36e1c717ea451a1a13efd",
    "files": [
        {
            "sha": "52994ed16ac9a8e819571f81866fe6e740cad0c8",
            "filename": "docs/topics/install.txt",
            "status": "modified",
            "additions": 6,
            "deletions": 4,
            "changes": 10,
            "blob_url": "https://github.com/django/django/blob/9190d89829c4e0b9b0f36e1c717ea451a1a13efd/docs%2Ftopics%2Finstall.txt",
            "raw_url": "https://github.com/django/django/raw/9190d89829c4e0b9b0f36e1c717ea451a1a13efd/docs%2Ftopics%2Finstall.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Ftopics%2Finstall.txt?ref=9190d89829c4e0b9b0f36e1c717ea451a1a13efd",
            "patch": "@@ -82,10 +82,12 @@ sure a database server is running. Django supports many different database\n servers and is officially supported with PostgreSQL_, MySQL_, Oracle_ and\n SQLite_.\n \n-It is common practice to use SQLite in a desktop development environment.\n-Unless you need database feature parity between your desktop development\n-environment and your deployment environment, using SQLite for development is\n-generally the simplest option as it doesn't require running a separate server.\n+If you are developing a simple project or something you don't plan to deploy\n+in a production environment, SQLite is generally the simplest option as it\n+doesn't require running a separate server. However, SQLite has many differences\n+from other databases, so if you are working on something substantial, it's\n+recommended to develop with the same database as you plan on using in\n+production.\n \n In addition to the officially supported databases, there are backends provided\n by 3rd parties that allow you to use other databases with Django:"
        }
    ],
    "stats": {
        "total": 10,
        "additions": 6,
        "deletions": 4
    }
}