{
    "author": "spookylukey",
    "message": "Grammar fixes and content tweaks to XSS section of security docs.\n\ngit-svn-id: http://code.djangoproject.com/svn/django/trunk@16545 bcc190cf-cafb-0310-a4f2-bffc1f526a37",
    "sha": "9896b0df73d5fe49c7c315ddcabbd25aa7c706b4",
    "files": [
        {
            "sha": "037b6b657d9cfbd1663129ffd7c858f653873088",
            "filename": "docs/topics/security.txt",
            "status": "modified",
            "additions": 9,
            "deletions": 8,
            "changes": 17,
            "blob_url": "https://github.com/django/django/blob/9896b0df73d5fe49c7c315ddcabbd25aa7c706b4/docs%2Ftopics%2Fsecurity.txt",
            "raw_url": "https://github.com/django/django/raw/9896b0df73d5fe49c7c315ddcabbd25aa7c706b4/docs%2Ftopics%2Fsecurity.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Ftopics%2Fsecurity.txt?ref=9896b0df73d5fe49c7c315ddcabbd25aa7c706b4",
            "patch": "@@ -12,12 +12,13 @@ Cross site scripting (XSS) protection\n \n .. highlightlang:: html+django\n \n-XSS attacks allow a user to inject client side scripts into the\n-browsers of other users. This is usually achieved by storing the malicious\n-scripts to the database where it will be retrieved and displayed to other users\n-or to get users to click a link containing variables containing scripts that\n-will be rendered by the user's browser. However, XSS attacks can originate\n-from any untrusted source of data such as cookies or web services.\n+XSS attacks allow a user to inject client side scripts into the browsers of\n+other users. This is usually achieved by storing the malicious scripts in the\n+database where it will be retrieved and displayed to other users, or by getting\n+users to click a link which will cause the attacker's javascript to be executred\n+by the user's browser. However, XSS attacks can originate from any untrusted\n+source of data, such as cookies or web services, whenever the data is not\n+sufficiently sanitized before including in a page.\n \n Using Django templates protects you against the majority of XSS attacks.\n However, it is important to understand what protections it provides\n@@ -44,8 +45,8 @@ In addition, if you are using the template system to output something other\n than HTML, there may be entirely separate characters and words which require\n escaping.\n \n-You should also be very careful when storing HTML to the database especially\n-when that HTML will be retrieved and displayed.\n+You should also be very careful when storing HTML in the database, especially\n+when that HTML is retrieved and displayed.\n \n Cross site request forgery (CSRF) protection\n ============================================"
        }
    ],
    "stats": {
        "total": 17,
        "additions": 9,
        "deletions": 8
    }
}