{
    "author": "unknown",
    "message": "Fixed #14401 -- Added a contributing howto guide for new users. Thank you to everyone who added their advice, feedback, and wisdom to the wiki article while constructing this new guide.\n\ngit-svn-id: http://code.djangoproject.com/svn/django/trunk@15645 bcc190cf-cafb-0310-a4f2-bffc1f526a37",
    "sha": "c250b8840b19c78fe87b614fee34cd1a46245c21",
    "files": [
        {
            "sha": "eb1dd105cc4f0407ae766f5d3969a69b5ffd7951",
            "filename": "docs/howto/contribute.txt",
            "status": "added",
            "additions": 286,
            "deletions": 0,
            "changes": 286,
            "blob_url": "https://github.com/django/django/blob/c250b8840b19c78fe87b614fee34cd1a46245c21/docs%2Fhowto%2Fcontribute.txt",
            "raw_url": "https://github.com/django/django/raw/c250b8840b19c78fe87b614fee34cd1a46245c21/docs%2Fhowto%2Fcontribute.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Fhowto%2Fcontribute.txt?ref=c250b8840b19c78fe87b614fee34cd1a46245c21",
            "patch": "@@ -0,0 +1,286 @@\n+===========================\r\n+How to contribute to Django\r\n+===========================\r\n+\r\n+Django is developed 100% by the community, and the more people that are actively\r\n+involved in the code the better Django will be. We recognize that contributing\r\n+to Django can be daunting at first and sometimes confusing even to\r\n+veterans. While we have our official \"Contributing to Django\" documentation\r\n+which spells out the technical details of triaging tickets and submitting\r\n+patches, it leaves a lot of room for interpretation. This guide aims to offer\r\n+more general advice on issues such as how to interpret the various stages and\r\n+flags in Trac, and how new contributors can get started.\r\n+\r\n+.. seealso::\r\n+\r\n+    This guide is meant to answer the most common questions about\r\n+    contributing to Django, however it is no substitute for the\r\n+    :doc:`/internals/contributing` reference. Please make sure to\r\n+    read that document to understand the specific details\r\n+    involved in reporting issues and submitting patches.\r\n+\r\n+.. _the-spirit-of-contributing:\r\n+\r\n+\"The Spirit of Contributing\"\r\n+============================\r\n+\r\n+Django uses Trac_ for managing our progress, and Trac is a community-tended\r\n+garden of the bugs people have found and the features people would like to see\r\n+added. As in any garden, sometimes there are weeds to be pulled and sometimes\r\n+there are flowers and vegetables that need picking. We need your help to sort\r\n+out one from the other, and in the end we all benefit together.\r\n+\r\n+Like all gardens, we can aspire to perfection but in reality there's no such\r\n+thing. Even in the most pristine garden there are still snails and insects. In a\r\n+community garden there are also helpful people who--with the best of\r\n+intentions--fertilize the weeds and poison the roses. It's the job of the\r\n+community as a whole to self-manage, keep the problems to a minimum, and educate\r\n+those coming into the community so that they can become valuable contributing\r\n+members.\r\n+\r\n+Similarly, while we aim for Trac to be a perfect representation of the state of\r\n+Django's progress, we acknowledge that this simply will not happen. By\r\n+distributing the load of Trac maintenance to the community, we accept that there\r\n+will be mistakes. Trac is \"mostly accurate\", and we give allowances for the fact\r\n+that sometimes it will be wrong. That's okay. We're perfectionists with\r\n+deadlines.\r\n+\r\n+We rely on the community to keep participating, keep tickets as accurate as\r\n+possible, and raise issues for discussion on our mailing lists when there is\r\n+confusion or disagreement.\r\n+\r\n+Django is a community project, and every contribution helps. We can't do this\r\n+without YOU!\r\n+\r\n+.. _Trac: http://code.djangoproject.com/\r\n+\r\n+Understanding Trac\r\n+==================\r\n+\r\n+Trac is Django's sole official issue tracker. All known bugs, desired features\r\n+and ideas for changes are logged there.\r\n+\r\n+However, Trac can be quite confusing even to veteran contributors.  Having to\r\n+look at both flags and triage stages isn't immediately obvious, and the stages\r\n+themselves can be misinterpreted.\r\n+\r\n+What Django's triage stages \"really mean\"\r\n+-----------------------------------------\r\n+\r\n+Unreviewed\r\n+~~~~~~~~~~\r\n+\r\n+The ticket has not been reviewed by anyone who felt qualified to make a judgment\r\n+about whether the ticket contained a valid issue, a viable feature, or ought to\r\n+be closed for any of the various reasons.\r\n+\r\n+Accepted\r\n+~~~~~~~~\r\n+\r\n+The big grey area! The absolute meaning of \"accepted\" is that the issue\r\n+described in the ticket is valid and is in some stage of being worked on. Beyond\r\n+that there are several considerations\r\n+\r\n+\r\n+* **Accepted + No Flags**\r\n+\r\n+  The ticket is valid, but no one has submitted a patch for it yet. Often this\r\n+  means you could safely start writing a patch for it.\r\n+\r\n+* **Accepted + Has Patch**\r\n+\r\n+  The ticket is waiting for people to review the supplied patch. This means\r\n+  downloading the patch and trying it out, verifying that it contains tests and\r\n+  docs, running the test suite with the included patch, and leaving feedback on\r\n+  the ticket.\r\n+\r\n+\r\n+* **Accepted + Has Patch + (any other flag)**\r\n+\r\n+  This means the ticket has been reviewed, and has been found to need further\r\n+  work. \"Needs tests\" and \"Needs documentation\" are self-explanatory. \"Patch\r\n+  needs improvement\" will generally be accompanied by a comment on the ticket\r\n+  explaining what is needed to improve the code.\r\n+\r\n+Design Decision Needed\r\n+~~~~~~~~~~~~~~~~~~~~~~\r\n+\r\n+This stage is for issues which may be contentious, may be backwards\r\n+incompatible, or otherwise involve high-level design decisions. These decisions\r\n+are generally made by the core committers, however that is not a\r\n+requirement. See the FAQ below for \"My ticket has been in DDN forever!  What\r\n+should I do?\"\r\n+\r\n+Ready For Checkin\r\n+~~~~~~~~~~~~~~~~~\r\n+\r\n+The ticket was reviewed by any member of the community other than the person who\r\n+supplied the patch and found to meet all the requirements for a commit-ready\r\n+patch. A core committer now needs to give the patch a final review prior to\r\n+being committed. See the FAQ below for \"My ticket has been in RFC forever!  What\r\n+should I do?\"\r\n+\r\n+Someday/Maybe?\r\n+~~~~~~~~~~~~~~\r\n+\r\n+Generally only used for vague/high-level features or design ideas. These tickets\r\n+are uncommon and overall less useful since they don't describe concrete\r\n+actionable issues.\r\n+\r\n+Fixed on a branch\r\n+~~~~~~~~~~~~~~~~~\r\n+\r\n+Used to indicate that a ticket is resolved as part of a major body of work that\r\n+will eventually be merged to trunk.  Tickets in this stage generally don't need\r\n+further work. This may happen in the case of major features/refactors in each\r\n+release cycle, or as part of the annual Google Summer of Code efforts.\r\n+\r\n+Example Trac workflow\r\n+---------------------\r\n+\r\n+Here we see the life-cycle of an average ticket:\r\n+\r\n+* Alice creates a ticket, and uploads an incomplete patch (no tests, incorrect\r\n+  implementation).\r\n+\r\n+* Bob reviews the patch, marks it \"Accepted\", \"needs tests\", and \"patch needs\r\n+  improvement\", and leaves a comment telling Alice how the patch could be\r\n+  improved.\r\n+\r\n+* Alice updates the patch, adding tests (but not changing the\r\n+  implementation). She removes the two flags.\r\n+\r\n+* Charlie reviews the patch and resets the \"patch needs improvement\" flag with\r\n+  another comment about improving the implementation.\r\n+\r\n+* Alice updates the patch, fixing the implementation. She removes the \"patch\r\n+  needs improvement\" flag.\r\n+\r\n+* Daisy reviews the patch, and marks it RFC.\r\n+\r\n+* Jacob reviews the RFC patch, applies it to his checkout, and commits it.\r\n+\r\n+Some tickets require much less feedback than this, but then again some tickets\r\n+require much much more.\r\n+\r\n+Advice for new contributors\r\n+===========================\r\n+\r\n+New contributor and not sure what to do? Want to help but just don't know how to\r\n+get started? This is the section for you.\r\n+\r\n+* **Pick a subject area that you care about, that you are familiar with, or that\r\n+  you want to learn about.**\r\n+\r\n+  You don't already have to be an expert on the area you want to work on; you\r\n+  become an expert through your ongoing contributions to the code.\r\n+\r\n+* **Triage tickets.**\r\n+\r\n+  If a ticket is unreviewed and reports a bug, try and duplicate it.  If you can\r\n+  duplicate it and it seems valid, make a note that you confirmed the bug and\r\n+  accept the ticket. Make sure the ticket is filed under the correct component\r\n+  area. Consider writing a patch that adds a test for the bug's behavior, even\r\n+  if you don't fix the bug itself.\r\n+\r\n+* **Look for tickets that are accepted and review patches to build familiarity\r\n+  with the codebase and the process.**\r\n+\r\n+  Mark the appropriate flags if a patch needs docs or tests. Look through the\r\n+  changes a patch makes, and keep an eye out for syntax that is incompatible\r\n+  with older but still supported versions of Python. Run the tests and make sure\r\n+  they pass on your system.  Where possible and relevant, try them out on a\r\n+  database other than SQLite. Leave comments and feedback!\r\n+\r\n+* **Keep old patches up to date.**\r\n+\r\n+  Oftentimes the codebase will change between a patch being submitted and the\r\n+  time it gets reviewed. Make sure it still applies cleanly and functions as\r\n+  expected. Simply updating a patch is both useful and important!\r\n+\r\n+* **Trac isn't an absolute; the context is just as important as the words.**\r\n+\r\n+  When reading Trac, you need to take into account who says things, and when\r\n+  they were said. Support for an idea two years ago doesn't necessarily mean\r\n+  that the idea will still have support. You also need to pay attention to who\r\n+  *hasn't* spoken -- for example, if a core team member hasn't been recently\r\n+  involved in a discussion, then a ticket may not have the support required to\r\n+  get into trunk.\r\n+\r\n+* **Start small.**\r\n+\r\n+  It's easier to get feedback on a little issue than on a big one.\r\n+\r\n+* **If you're going to engage in a big task, make sure that your idea has\r\n+  support first.**\r\n+\r\n+  This means getting someone else to confirm that a bug is real before you fix\r\n+  the issue, and ensuring that the core team supports a proposed feature before\r\n+  you go implementing it.\r\n+\r\n+* **Be bold! Leave feedback!**\r\n+\r\n+  Sometimes it can be scary to put your opinion out to the world and say \"this\r\n+  ticket is correct\" or \"this patch needs work\", but it's the only way the\r\n+  project moves forward. The contributions of the broad Django community\r\n+  ultimately have a much greater impact than that of the core developers. We\r\n+  can't do it without YOU!\r\n+\r\n+* **Err on the side of caution when marking things Ready For Check-in.**\r\n+\r\n+  If you're really not certain if a ticket is ready, don't mark it as\r\n+  such. Leave a comment instead, letting others know your thoughts.  If you're\r\n+  mostly certain, but not completely certain, you might also try asking on IRC\r\n+  to see if someone else can confirm your suspicions.\r\n+\r\n+* **Wait for feedback, and respond to feedback that you receive.**\r\n+\r\n+  Focus on one or two tickets, see them through from start to finish, and\r\n+  repeat. The shotgun approach of taking on lots of tickets and letting some\r\n+  fall by the wayside ends up doing more harm than good.\r\n+\r\n+* **Be rigorous.**\r\n+\r\n+  When we say \":pep:`8`, and must have docs and tests\", we mean it. If a patch\r\n+  doesn't have docs and tests, there had better be a good reason. Arguments like\r\n+  \"I couldn't find any existing tests of this feature\" don't carry much\r\n+  weight--while it may be true, that means you have the extra-important job of\r\n+  writing the very first tests for that feature, not that you get a pass from\r\n+  writing tests altogether.\r\n+\r\n+.. note::\r\n+\r\n+    The `Reports page`_ contains links to many useful Trac queries, including\r\n+    several that are useful for triaging tickets and reviewing patches as\r\n+    suggested above.\r\n+\r\n+    .. _Reports page: http://code.djangoproject.com/wiki/Reports\r\n+\r\n+\r\n+FAQs\r\n+====\r\n+\r\n+**This ticket I care about has been ignored for days/weeks/months! What can I do\r\n+to get it committed?**\r\n+\r\n+* First off, it's not personal. Django is entirely developed by volunteers (even\r\n+  the core devs), and sometimes folks just don't have time. The best thing to do\r\n+  is to send a gentle reminder to the Django Developers mailing list asking for\r\n+  review on the ticket, or to bring it up in the #django-dev IRC channel.\r\n+\r\n+\r\n+**I'm sure my ticket is absolutely 100% perfect, can I mark it as RFC myself?**\r\n+\r\n+* Short answer: No. It's always better to get another set of eyes on a\r\n+  ticket. If you're having trouble getting that second set of eyes, see question\r\n+  1, above.\r\n+\r\n+\r\n+**My ticket has been in DDN forever! What should I do?**\r\n+\r\n+* Design Decision Needed requires consensus about the right solution.  At the\r\n+  very least it needs consensus among the core developers, and ideally it has\r\n+  consensus from the community as well. The best way to accomplish this is to\r\n+  start a thread on the Django Developers mailing list, and for very complex\r\n+  issues to start a wiki page summarizing the problem and the possible\r\n+  solutions.\r"
        },
        {
            "sha": "7ce7d26ceb83b7de2c8ba79ba65a2d799b781e25",
            "filename": "docs/howto/index.txt",
            "status": "modified",
            "additions": 1,
            "deletions": 0,
            "changes": 1,
            "blob_url": "https://github.com/django/django/blob/c250b8840b19c78fe87b614fee34cd1a46245c21/docs%2Fhowto%2Findex.txt",
            "raw_url": "https://github.com/django/django/raw/c250b8840b19c78fe87b614fee34cd1a46245c21/docs%2Fhowto%2Findex.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Fhowto%2Findex.txt?ref=c250b8840b19c78fe87b614fee34cd1a46245c21",
            "patch": "@@ -11,6 +11,7 @@ you quickly accomplish common tasks.\n \n    apache-auth\n    auth-remote-user\n+   contribute\n    custom-management-commands\n    custom-model-fields\n    custom-template-tags"
        },
        {
            "sha": "3c271d64e6d8b8b3597af47099e34a325fa8d3d8",
            "filename": "docs/internals/contributing.txt",
            "status": "modified",
            "additions": 137,
            "deletions": 110,
            "changes": 247,
            "blob_url": "https://github.com/django/django/blob/c250b8840b19c78fe87b614fee34cd1a46245c21/docs%2Finternals%2Fcontributing.txt",
            "raw_url": "https://github.com/django/django/raw/c250b8840b19c78fe87b614fee34cd1a46245c21/docs%2Finternals%2Fcontributing.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing.txt?ref=c250b8840b19c78fe87b614fee34cd1a46245c21",
            "patch": "@@ -2,9 +2,10 @@\n Contributing to Django\n ======================\n \n-If you think working *with* Django is fun, wait until you start working *on* it.\n-We're passionate about helping Django users make the jump to contributing members\n-of the community, so there are many ways you can help Django's development:\n+If you think working *with* Django is fun, wait until you start working *on*\n+it. We're passionate about helping Django users make the jump to contributing\n+members of the community, so there are many ways you can help Django's\n+development:\n \n     * Blog about Django.  We syndicate all the Django blogs we know about on\n       the `community page`_; contact jacob@jacobian.org if you've got a blog\n@@ -32,17 +33,25 @@ community. The rest of this document describes the details of how our community\n works and how it handles bugs, mailing lists, and all the other minutiae of\n Django development.\n \n+.. seealso::\n+\n+    This document contains specific details for contributing to\n+    Django. However, many new contributors find this guide confusing\n+    or intimidating at first. For a simpler introduction\n+    to becoming a contributor please see the :doc:`/howto/contribute` guide.\n+\n .. _reporting-bugs:\n \n Reporting bugs\n ==============\n \n Well-written bug reports are *incredibly* helpful. However, there's a certain\n-amount of overhead involved in working with any bug tracking system, so your\n+amount of overhead involved in working with any bug tracking system so your\n help in keeping our ticket tracker as useful as possible is appreciated.  In\n particular:\n \n-    * **Do** read the :doc:`FAQ </faq/index>` to see if your issue might be a well-known question.\n+    * **Do** read the :doc:`FAQ </faq/index>` to see if your issue might\n+      be a well-known question.\n \n     * **Do** `search the tracker`_ to see if your issue has already been filed.\n \n@@ -60,21 +69,22 @@ particular:\n       `django-users`_ list, or the `#django`_ IRC channel for that.\n \n     * **Don't** use the ticket system to make large-scale feature requests.\n-      We like to discuss any big changes to Django's core on the `django-developers`_\n-      list before actually working on them.\n+      We like to discuss any big changes to Django's core on the\n+      `django-developers`_ list before actually working on them.\n \n-    * **Don't** reopen issues that have been marked \"wontfix\". This mark means\n-      that the decision has been made that we can't or won't fix this particular\n-      issue.  If you're not sure why, please ask on `django-developers`_.\n+    * **Don't** reopen issues that have been marked \"wontfix\". This mark\n+      means that the decision has been made that we can't or won't fix\n+      this particular issue.  If you're not sure why, please ask\n+      on `django-developers`_.\n \n     * **Don't** use the ticket tracker for lengthy discussions, because they're\n       likely to get lost. If a particular ticket is controversial, please move\n       discussion to `django-developers`_.\n \n     * **Don't** post to django-developers just to announce that you have filed\n       a bug report. All the tickets are mailed to another list\n-      (`django-updates`_), which is tracked by developers and triagers, so we\n-      see them as they are filed.\n+      (`django-updates`_), which is tracked by developers and interested\n+      community members; we see them as they are filed.\n \n .. _django-updates: http://groups.google.com/group/django-updates\n \n@@ -90,23 +100,23 @@ not publicly readable.\n In the event of a confirmed vulnerability in Django itself, we will take the\n following actions:\n \n-    * Acknowledge to the reporter that we've received the report and that a fix\n-      is forthcoming. We'll give a rough timeline and ask the reporter to keep\n-      the issue confidential until we announce it.\n+    * Acknowledge to the reporter that we've received the report and that a\n+      fix is forthcoming. We'll give a rough timeline and ask the reporter\n+      to keep the issue confidential until we announce it.\n \n-    * Halt all other development as long as is needed to develop a fix, including\n-      patches against the current and two previous releases.\n+    * Halt all other development as long as is needed to develop a fix,\n+      including patches against the current and two previous releases.\n \n     * Determine a go-public date for announcing the vulnerability and the fix.\n-      To try to mitigate a possible \"arms race\" between those applying the patch\n-      and those trying to exploit the hole, we will not announce security\n-      problems immediately.\n+      To try to mitigate a possible \"arms race\" between those applying the\n+      patch and those trying to exploit the hole, we will not announce\n+      security problems immediately.\n \n     * Pre-notify everyone we know to be running the affected version(s) of\n-      Django. We will send these notifications through private e-mail which will\n-      include documentation of the vulnerability, links to the relevant patch(es),\n-      and a request to keep the vulnerability confidential until the official\n-      go-public date.\n+      Django. We will send these notifications through private e-mail\n+      which will include documentation of the vulnerability, links to the\n+      relevant patch(es), and a request to keep the vulnerability\n+      confidential until the official go-public date.\n \n     * Publicly announce the vulnerability and the fix on the pre-determined\n       go-public date. This will probably mean a new release of Django, but\n@@ -115,8 +125,9 @@ following actions:\n Submitting patches\n ==================\n \n-We're always grateful for patches to Django's code. Indeed, bug reports with\n-associated patches will get fixed *far* more quickly than those without patches.\n+We're always grateful for patches to Django's code. Indeed, bug reports\n+with associated patches will get fixed *far* more quickly than those\n+without patches.\n \n \"Claiming\" tickets\n ------------------\n@@ -132,16 +143,20 @@ fixing it (as measured by your coding ability, knowledge of Django internals\n and time availability), claim it by following these steps:\n \n     * `Create an account`_ to use in our ticket system.\n+\n     * If a ticket for this issue doesn't exist yet, create one in our\n       `ticket tracker`_.\n+\n     * If a ticket for this issue already exists, make sure nobody else has\n       claimed it. To do this, look at the \"Assigned to\" section of the ticket.\n       If it's assigned to \"nobody,\" then it's available to be claimed.\n       Otherwise, somebody else is working on this ticket, and you either find\n       another bug/feature to work on, or contact the developer working on the\n       ticket to offer your help.\n+\n     * Log into your account, if you haven't already, by clicking \"Login\" in the\n       upper right of the ticket page.\n+\n     * Claim the ticket by clicking the radio button next to \"Accept ticket\"\n       near the bottom of the page, then clicking \"Submit changes.\"\n \n@@ -158,11 +173,9 @@ Once you've claimed a ticket, you have a responsibility to work on that ticket\n in a reasonably timely fashion. If you don't have time to work on it, either\n unclaim it or don't claim it in the first place!\n \n-Ticket triagers go through the list of claimed tickets from time to\n-time, checking whether any progress has been made. If there's no sign of\n-progress on a particular claimed ticket for a week or two, a triager may ask\n-you to relinquish the ticket claim so that it's no longer monopolized and\n-somebody else can claim it.\n+If there's no sign of progress on a particular claimed ticket for a week or\n+two, another developer may ask you to relinquish the ticket claim so that it's\n+no longer monopolized and somebody else can claim it.\n \n If you've claimed a ticket and it's taking a long time (days or weeks) to code,\n keep everybody updated by posting comments on the ticket. If you don't provide\n@@ -185,20 +198,21 @@ Patch style\n     * Make sure your code matches our `coding style`_.\n \n     * Submit patches in the format returned by the ``svn diff`` command.\n-      An exception is for code changes that are described more clearly in plain\n-      English than in code. Indentation is the most common example; it's hard to\n-      read patches when the only difference in code is that it's indented.\n+      An exception is for code changes that are described more clearly in\n+      plain English than in code. Indentation is the most common example; it's\n+      hard to read patches when the only difference in code is that it's\n+      indented.\n \n       Patches in ``git diff`` format are also acceptable.\n \n     * When creating patches, always run ``svn diff`` from the top-level\n       ``trunk`` directory -- i.e., the one that contains ``django``, ``docs``,\n-      ``tests``, ``AUTHORS``, etc. This makes it easy for other people to apply\n-      your patches.\n+      ``tests``, ``AUTHORS``, etc. This makes it easy for other people to\n+      apply your patches.\n \n-    * Attach patches to a ticket in the `ticket tracker`_, using the \"attach file\"\n-      button. Please *don't* put the patch in the ticket description or comment\n-      unless it's a single line patch.\n+    * Attach patches to a ticket in the `ticket tracker`_, using the \"attach\n+      file\" button. Please *don't* put the patch in the ticket description\n+      or comment unless it's a single line patch.\n \n     * Name the patch file with a ``.diff`` extension; this will let the ticket\n       tracker apply correct syntax highlighting, which is quite helpful.\n@@ -209,11 +223,12 @@ Patch style\n \n     * The code required to fix a problem or add a feature is an essential part\n       of a patch, but it is not the only part. A good patch should also include\n-      a regression test to validate the behavior that has been fixed (and prevent\n-      the problem from arising again).\n+      a regression test to validate the behavior that has been fixed\n+      (and prevent the problem from arising again).\n \n-    * If the code associated with a patch adds a new feature, or modifies behavior\n-      of an existing feature, the patch should also contain documentation.\n+    * If the code associated with a patch adds a new feature, or modifies\n+      behavior of an existing feature, the patch should also contain\n+      documentation.\n \n Non-trivial patches\n -------------------\n@@ -233,8 +248,8 @@ the `required details`_. A number of tickets have patches, but those patches\n don't meet all the requirements of a `good patch`_.\n \n One way to help out is to *triage* bugs that have been reported by other\n-users. A couple of dedicated volunteers work on this regularly, but more help\n-is always appreciated.\n+users. The core team--as well as many community members--work on this\n+regularly, but more help is always appreciated.\n \n Most of the workflow is based around the concept of a ticket's \"triage stage\".\n This stage describes where in its lifetime a given ticket is at any time.\n@@ -248,15 +263,18 @@ Since a picture is worth a thousand words, let's start there:\n    :width: 590\n    :alt: Django's ticket workflow\n \n-We've got two official roles here:\n+We've got two roles in this diagram:\n \n-    * Core developers: people with commit access who make the big decisions\n-      and write the bulk of the code.\n+    * Core developers: people with commit access who are responsible for\n+      making the big decisions, writing large portions of the code and\n+      integrating the contributions of the community.\n \n-    * Ticket triagers: trusted community members with a proven history of\n-      working with the Django community. As a result of this history, they\n-      have been entrusted by the core developers to make some of the smaller\n-      decisions about tickets.\n+    * Ticket triagers: anyone in the Django community who chooses to\n+      become involved in Django's development process. Our Trac installation\n+      is :ref:`intentionally left open to the public\n+      <the-spirit-of-contributing>`, and anyone can triage tickets.\n+      Django is a community project, and we encourage `triage by the\n+      community`_.\n \n Second, note the five triage stages:\n \n@@ -279,22 +297,22 @@ Second, note the five triage stages:\n        adding to the framework if an excellent patch is submitted. These\n        tickets are not a high priority.\n \n-    5. If a ticket has an associated patch (see below), a triager will review\n-       the patch. If the patch is complete, it'll be marked as \"ready for\n-       checkin\" so that a core developer knows to review and check in the\n-       patches.\n+    5. If a ticket has an associated patch (see below), it will be reviewed\n+       by the community. If the patch is complete, it'll be marked as \"ready\n+       for checkin\" so that a core developer knows to review and commit the\n+       patch.\n \n The second part of this workflow involves a set of flags the describe what the\n ticket has or needs in order to be \"ready for checkin\":\n \n     \"Has patch\"\n         This means the ticket has an associated patch_. These will be\n-        reviewed by the triage team to see if the patch is \"good\".\n+        reviewed to see if the patch is \"good\".\n \n     \"Needs documentation\"\n         This flag is used for tickets with patches that need associated\n         documentation. Complete documentation of features is a prerequisite\n-        before we can check a fix into the codebase.\n+        before we can check them into the codebase.\n \n     \"Needs tests\"\n         This flags the patch as needing associated unit tests. Again, this is a\n@@ -303,12 +321,13 @@ ticket has or needs in order to be \"ready for checkin\":\n     \"Patch needs improvement\"\n         This flag means that although the ticket *has* a patch, it's not quite\n         ready for checkin. This could mean the patch no longer applies\n-        cleanly, or that the code doesn't live up to our standards.\n+        cleanly, there is a flaw in the implementation, or that the code\n+        doesn't meet our standards.\n \n A ticket can be resolved in a number of ways:\n \n     \"fixed\"\n-        Used by one of the core developers once a patch has been rolled into\n+        Used by the core developers once a patch has been rolled into\n         Django and the issue is fixed.\n \n     \"invalid\"\n@@ -321,8 +340,10 @@ A ticket can be resolved in a number of ways:\n     \"wontfix\"\n         Used when a core developer decides that this request is not\n         appropriate for consideration in Django. This is usually chosen after\n-        discussion in the ``django-developers`` mailing list, and you should\n-        feel free to join in when it's something you care about.\n+        discussion in the ``django-developers`` mailing list. Feel free to\n+        start or join in discussions of \"wontfix\" tickets on the mailing list,\n+        but please do not reopen tickets closed as \"wontfix\" by core\n+        developers.\n \n     \"duplicate\"\n         Used when another ticket covers the same issue. By closing duplicate\n@@ -334,27 +355,29 @@ A ticket can be resolved in a number of ways:\n \n If you believe that the ticket was closed in error -- because you're\n still having the issue, or it's popped up somewhere else, or the triagers have\n--- made a mistake, please reopen the ticket and tell us why. Please do not\n-reopen tickets that have been marked as \"wontfix\" by core developers.\n+made a mistake -- please reopen the ticket and provide further information.\n+Please do not reopen tickets that have been marked as \"wontfix\" by core\n+developers.\n \n .. _required details: `Reporting bugs`_\n .. _good patch: `Patch style`_\n+.. _triage by the community: `Triage by the general community`_\n .. _patch: `Submitting patches`_\n \n Triage by the general community\n -------------------------------\n \n-Although the core developers and ticket triagers make the big decisions in\n-the ticket triage process, there's also a lot that general community\n-members can do to help the triage process. In particular, you can help out by:\n+Although the core developers make the big decisions in the ticket triage\n+process, there's a lot that general community members can do to help the\n+triage process. In particular, you can help out by:\n \n     * Closing \"Unreviewed\" tickets as \"invalid\", \"worksforme\" or \"duplicate.\"\n \n     * Promoting \"Unreviewed\" tickets to \"Design decision needed\" if a design\n       decision needs to be made, or \"Accepted\" in case of obvious bugs.\n \n-    * Correcting the \"Needs tests\", \"Needs documentation\", or \"Has patch\" flags\n-      for tickets where they are incorrectly set.\n+    * Correcting the \"Needs tests\", \"Needs documentation\", or \"Has patch\"\n+      flags for tickets where they are incorrectly set.\n \n     * Adding the `easy-pickings`_ keyword to tickets that are small and\n       relatively straightforward.\n@@ -363,15 +386,15 @@ members can do to help the triage process. In particular, you can help out by:\n       any activity in a long time, it's possible that the problem has been\n       fixed but the ticket hasn't yet been closed.\n \n-    * Contacting the owners of tickets that have been claimed but have not seen\n-      any recent activity. If the owner doesn't respond after a week or so,\n-      remove the owner's claim on the ticket.\n+    * Contacting the owners of tickets that have been claimed but have not\n+      seen any recent activity. If the owner doesn't respond after a week\n+      or so, remove the owner's claim on the ticket.\n \n-    * Identifying trends and themes in the tickets. If there a lot of bug reports\n-      about a particular part of Django, it may indicate we should consider\n-      refactoring that part of the code. If a trend is emerging, you should\n-      raise it for discussion (referencing the relevant tickets) on\n-      `django-developers`_.\n+    * Identifying trends and themes in the tickets. If there a lot of bug\n+      reports about a particular part of Django, it may indicate we should\n+      consider refactoring that part of the code. If a trend is emerging,\n+      you should raise it for discussion (referencing the relevant tickets)\n+      on `django-developers`_.\n \n However, we do ask the following of all general community members working in\n the ticket database:\n@@ -380,17 +403,19 @@ the ticket database:\n       make the final determination of the fate of a ticket, usually after\n       consultation with the community.\n \n-    * Please **don't** promote tickets to \"Ready for checkin\" unless they are\n-      *trivial* changes -- for example, spelling mistakes or broken links in\n-      documentation.\n+    * Please **don't** promote your own tickets to \"Ready for checkin\". You\n+      may mark other people's tickets which you've reviewed as \"Ready for\n+      checkin\", but you should get at minimum one other community member to\n+      review a patch that you submit.\n \n     * Please **don't** reverse a decision that has been made by a core\n-      developer. If you disagree with a discussion that has been made,\n+      developer. If you disagree with a decision that has been made,\n       please post a message to `django-developers`_.\n \n-    * Please be conservative in your actions. If you're unsure if you should\n-      be making a change, don't make the change -- leave a comment with your\n-      concerns on the ticket, or post a message to `django-developers`_.\n+    * If you're unsure if you should be making a change, don't make the change\n+      but instead leave a comment with your concerns on the ticket, or\n+      post a message to `django-developers`_. It's okay to be unsure, but\n+      your input is still valuable.\n \n .. _contributing-translations:\n \n@@ -429,7 +454,7 @@ to do:\n     * Once you are a member of a team choose the translation resource you\n       want update on the team page. For example the \"core\" resource refers\n       to the translation catalogue that contains all non-app translations.\n-      Each of the contrib apps also have a resource -- prefixed with \"contrib-\".\n+      Each of the contrib apps also have a resource (prefixed with \"contrib-\").\n \n       .. note::\n          For more information about how to use Transifex, see the\n@@ -500,9 +525,9 @@ Various Django-specific code issues are detailed in this section.\n Use of ``django.conf.settings``\n -------------------------------\n \n-Modules should not in general use settings stored in ``django.conf.settings`` at\n-the top level (i.e. evaluated when the module is imported). The explanation for\n-this is as follows:\n+Modules should not in general use settings stored in ``django.conf.settings``\n+at the top level (i.e. evaluated when the module is imported). The explanation\n+for this is as follows:\n \n Manual configuration of settings (i.e. not relying on the\n ``DJANGO_SETTINGS_MODULE`` environment variable) is allowed and possible as\n@@ -512,10 +537,10 @@ follows::\n \n     settings.configure({}, SOME_SETTING='foo')\n \n-However, if any setting is accessed before the ``settings.configure`` line, this\n-will not work. (Internally, ``settings`` is a ``LazyObject`` which configures\n-itself automatically when the settings are accessed if it has not already been\n-configured).\n+However, if any setting is accessed before the ``settings.configure`` line,\n+this will not work. (Internally, ``settings`` is a ``LazyObject`` which\n+configures itself automatically when the settings are accessed if it has not\n+already been configured).\n \n So, if there is a module containing some code as follows::\n \n@@ -529,9 +554,9 @@ That means that the ability for third parties to import the module at the top\n level is incompatible with the ability to configure the settings object\n manually, or makes it very difficult in some circumstances.\n \n-Instead of the above code, a level of laziness or indirection must be used, such\n-as :class:`django.utils.functional.LazyObject`, :func:`django.utils.functional.lazy` or\n-``lambda``.\n+Instead of the above code, a level of laziness or indirection must be used,\n+such as `django.utils.functional.LazyObject``, ``django.utils.functional.lazy``\n+or ``lambda``.\n \n Coding style\n ============\n@@ -1085,14 +1110,15 @@ for feature branches:\n        trunk you'll need to find a core developer familiar with your DVCS of\n        choice who'll actually perform the merge.\n \n-       If you do decided to start a distributed branch of Django and choose to make it\n-       public, please add the branch to the `Django branches`_ wiki page.\n+       If you do decided to start a distributed branch of Django and choose to\n+       make it public, please add the branch to the `Django branches`_ wiki\n+       page.\n \n-    2. Feature branches using SVN have a higher bar. If you want a branch in SVN\n-       itself, you'll need a \"mentor\" among the :doc:`core committers\n-       </internals/committers>`. This person is responsible for actually creating\n-       the branch, monitoring your process (see below), and ultimately merging\n-       the branch into trunk.\n+    2. Feature branches using SVN have a higher bar. If you want a branch\n+       in SVN itself, you'll need a \"mentor\" among the :doc:`core committers\n+       </internals/committers>`. This person is responsible for actually\n+       creating the branch, monitoring your process (see below), and\n+       ultimately merging the branch into trunk.\n \n        If you want a feature branch in SVN, you'll need to ask in\n        `django-developers`_ for a mentor.\n@@ -1110,8 +1136,8 @@ successful Django branch.\n \n DVCS branches are obviously not under central control, so we have no way of\n enforcing these rules. However, if you're using a DVCS, following these rules\n-will give you the best chance of having a successful branch (read: merged back to\n-trunk).\n+will give you the best chance of having a successful branch (read: merged back\n+to trunk).\n \n Developers with branches in SVN, however, **must** follow these rules. The\n branch mentor will keep on eye on the branch and **will delete it** if these\n@@ -1140,8 +1166,8 @@ Once the branch is stable and ready to be merged into the trunk, alert\n \n After a branch has been merged, it should be considered \"dead\"; write access to\n it will be disabled, and old branches will be periodically \"trimmed.\" To keep\n-our SVN wrangling to a minimum, we won't be merging from a given branch into the\n-trunk more than once.\n+our SVN wrangling to a minimum, we won't be merging from a given branch into\n+the trunk more than once.\n \n Using branches\n --------------\n@@ -1259,8 +1285,8 @@ if the discussion towards a consensus fizzles out without a concrete decision,\n we use a more formal process.\n \n Any core committer (see below) may call for a formal vote using the same\n-voting mechanism above. A proposition will be considered carried by the core team\n-if:\n+voting mechanism above. A proposition will be considered carried by the core\n+team if:\n \n     * There are three \"+1\" votes from members of the core team.\n \n@@ -1307,8 +1333,9 @@ Partial committers\n Decisions on new committers will follow the process explained above in `how\n we make decisions`_.\n \n-To request commit access, please contact an existing committer privately. Public\n-requests for commit access are potential flame-war starters, and will be ignored.\n+To request commit access, please contact an existing committer privately.\n+Public requests for commit access are potential flame-war starters, and\n+will be ignored.\n \n .. _community page: http://www.djangoproject.com/community/\n .. _ticket tracker: http://code.djangoproject.com/newticket"
        }
    ],
    "stats": {
        "total": 534,
        "additions": 424,
        "deletions": 110
    }
}