{
    "author": "freakboy3742",
    "message": "Converted the new contributions docs to unix line endings.\n\ngit-svn-id: http://code.djangoproject.com/svn/django/trunk@15667 bcc190cf-cafb-0310-a4f2-bffc1f526a37",
    "sha": "c5a6badbfc95d839f5952087ac59f7d1e76ac9a6",
    "files": [
        {
            "sha": "5d17ae69aa1f75f7f837e1891b3c436f125b9773",
            "filename": "docs/howto/contribute.txt",
            "status": "modified",
            "additions": 321,
            "deletions": 321,
            "changes": 642,
            "blob_url": "https://github.com/django/django/blob/c5a6badbfc95d839f5952087ac59f7d1e76ac9a6/docs%2Fhowto%2Fcontribute.txt",
            "raw_url": "https://github.com/django/django/raw/c5a6badbfc95d839f5952087ac59f7d1e76ac9a6/docs%2Fhowto%2Fcontribute.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Fhowto%2Fcontribute.txt?ref=c5a6badbfc95d839f5952087ac59f7d1e76ac9a6",
            "patch": "@@ -1,321 +1,321 @@\n-===========================\r\n-How to contribute to Django\r\n-===========================\r\n-\r\n-Django is developed 100% by the community, and the more people that are actively\r\n-involved in the code the better Django will be. We recognize that contributing\r\n-to Django can be daunting at first and sometimes confusing even to\r\n-veterans. While we have our official \"Contributing to Django\" documentation\r\n-which spells out the technical details of triaging tickets and submitting\r\n-patches, it leaves a lot of room for interpretation. This guide aims to offer\r\n-more general advice on issues such as how to interpret the various stages and\r\n-flags in Trac, and how new contributors can get started.\r\n-\r\n-.. seealso::\r\n-\r\n-    This guide is meant to answer the most common questions about\r\n-    contributing to Django, however it is no substitute for the\r\n-    :doc:`/internals/contributing` reference. Please make sure to\r\n-    read that document to understand the specific details\r\n-    involved in reporting issues and submitting patches.\r\n-\r\n-.. _the-spirit-of-contributing:\r\n-\r\n-\"The Spirit of Contributing\"\r\n-============================\r\n-\r\n-Django uses Trac_ for managing our progress, and Trac is a community-tended\r\n-garden of the bugs people have found and the features people would like to see\r\n-added. As in any garden, sometimes there are weeds to be pulled and sometimes\r\n-there are flowers and vegetables that need picking. We need your help to sort\r\n-out one from the other, and in the end we all benefit together.\r\n-\r\n-Like all gardens, we can aspire to perfection but in reality there's no such\r\n-thing. Even in the most pristine garden there are still snails and insects. In a\r\n-community garden there are also helpful people who--with the best of\r\n-intentions--fertilize the weeds and poison the roses. It's the job of the\r\n-community as a whole to self-manage, keep the problems to a minimum, and educate\r\n-those coming into the community so that they can become valuable contributing\r\n-members.\r\n-\r\n-Similarly, while we aim for Trac to be a perfect representation of the state of\r\n-Django's progress, we acknowledge that this simply will not happen. By\r\n-distributing the load of Trac maintenance to the community, we accept that there\r\n-will be mistakes. Trac is \"mostly accurate\", and we give allowances for the fact\r\n-that sometimes it will be wrong. That's okay. We're perfectionists with\r\n-deadlines.\r\n-\r\n-We rely on the community to keep participating, keep tickets as accurate as\r\n-possible, and raise issues for discussion on our mailing lists when there is\r\n-confusion or disagreement.\r\n-\r\n-Django is a community project, and every contribution helps. We can't do this\r\n-without YOU!\r\n-\r\n-.. _Trac: http://code.djangoproject.com/\r\n-\r\n-Understanding Trac\r\n-==================\r\n-\r\n-Trac is Django's sole official issue tracker. All known bugs, desired features\r\n-and ideas for changes are logged there.\r\n-\r\n-However, Trac can be quite confusing even to veteran contributors.  Having to\r\n-look at both flags and triage stages isn't immediately obvious, and the stages\r\n-themselves can be misinterpreted.\r\n-\r\n-.. _triage-stages-explained:\r\n-\r\n-What Django's triage stages \"really mean\"\r\n------------------------------------------\r\n-\r\n-Unreviewed\r\n-~~~~~~~~~~\r\n-\r\n-The ticket has not been reviewed by anyone who felt qualified to make a judgment\r\n-about whether the ticket contained a valid issue, a viable feature, or ought to\r\n-be closed for any of the various reasons.\r\n-\r\n-Accepted\r\n-~~~~~~~~\r\n-\r\n-The big grey area! The absolute meaning of \"accepted\" is that the issue\r\n-described in the ticket is valid and is in some stage of being worked on. Beyond\r\n-that there are several considerations\r\n-\r\n-\r\n-* **Accepted + No Flags**\r\n-\r\n-  The ticket is valid, but no one has submitted a patch for it yet. Often this\r\n-  means you could safely start writing a patch for it.\r\n-\r\n-* **Accepted + Has Patch**\r\n-\r\n-  The ticket is waiting for people to review the supplied patch. This means\r\n-  downloading the patch and trying it out, verifying that it contains tests and\r\n-  docs, running the test suite with the included patch, and leaving feedback on\r\n-  the ticket.\r\n-\r\n-\r\n-* **Accepted + Has Patch + (any other flag)**\r\n-\r\n-  This means the ticket has been reviewed, and has been found to need further\r\n-  work. \"Needs tests\" and \"Needs documentation\" are self-explanatory. \"Patch\r\n-  needs improvement\" will generally be accompanied by a comment on the ticket\r\n-  explaining what is needed to improve the code.\r\n-\r\n-Design Decision Needed\r\n-~~~~~~~~~~~~~~~~~~~~~~\r\n-\r\n-This stage is for issues which may be contentious, may be backwards\r\n-incompatible, or otherwise involve high-level design decisions. These decisions\r\n-are generally made by the core committers, however that is not a\r\n-requirement. See the FAQ below for \"My ticket has been in DDN forever!  What\r\n-should I do?\"\r\n-\r\n-Ready For Checkin\r\n-~~~~~~~~~~~~~~~~~\r\n-\r\n-The ticket was reviewed by any member of the community other than the person who\r\n-supplied the patch and found to meet all the requirements for a commit-ready\r\n-patch. A core committer now needs to give the patch a final review prior to\r\n-being committed. See the FAQ below for \"My ticket has been in RFC forever!  What\r\n-should I do?\"\r\n-\r\n-Someday/Maybe?\r\n-~~~~~~~~~~~~~~\r\n-\r\n-Generally only used for vague/high-level features or design ideas. These tickets\r\n-are uncommon and overall less useful since they don't describe concrete\r\n-actionable issues.\r\n-\r\n-Fixed on a branch\r\n-~~~~~~~~~~~~~~~~~\r\n-\r\n-Used to indicate that a ticket is resolved as part of a major body of work that\r\n-will eventually be merged to trunk.  Tickets in this stage generally don't need\r\n-further work. This may happen in the case of major features/refactors in each\r\n-release cycle, or as part of the annual Google Summer of Code efforts.\r\n-\r\n-.. _closing-tickets:\r\n-\r\n-Closing Tickets\r\n----------------\r\n-\r\n-When a ticket has completed its useful lifecycle, it's time for it to be closed.\r\n-Closing a ticket is a big responsibility, though. You have to be sure that\r\n-the issue is really resolved, and you need to keep in mind that the reporter\r\n-of the ticket may not be happy to have their ticket closed (unless it's fixed,\r\n-of course). If you're not certain about closing a ticket, just leave a comment\r\n-with your thoughts instead.\r\n-\r\n-If you do close a ticket, you should always make sure of the following:\r\n-\r\n-  * Be certain that the issue is resolved.\r\n-\r\n-  * Leave a comment explaining the decision to close the ticket.\r\n-\r\n-  * If there is a way they can improve the ticket to reopen it, let them know.\r\n-\r\n-  * If the ticket is a duplicate, reference the original ticket.\r\n-\r\n-  * **Be polite.** No one likes having their ticket closed. It can be\r\n-    frustrating or even discouraging. The best way to avoid turning people\r\n-    off from contributing to Django is to be polite and friendly and to offer\r\n-    suggestions for how they could improve this ticket and other tickets in the\r\n-    future.\r\n-\r\n-.. seealso::\r\n-\r\n-    The :ref:`contributing reference <ticket-resolutions>` contains a\r\n-    description of each of the available resolutions in Trac.\r\n-\r\n-Example Trac workflow\r\n----------------------\r\n-\r\n-Here we see the life-cycle of an average ticket:\r\n-\r\n-* Alice creates a ticket, and uploads an incomplete patch (no tests, incorrect\r\n-  implementation).\r\n-\r\n-* Bob reviews the patch, marks it \"Accepted\", \"needs tests\", and \"patch needs\r\n-  improvement\", and leaves a comment telling Alice how the patch could be\r\n-  improved.\r\n-\r\n-* Alice updates the patch, adding tests (but not changing the\r\n-  implementation). She removes the two flags.\r\n-\r\n-* Charlie reviews the patch and resets the \"patch needs improvement\" flag with\r\n-  another comment about improving the implementation.\r\n-\r\n-* Alice updates the patch, fixing the implementation. She removes the \"patch\r\n-  needs improvement\" flag.\r\n-\r\n-* Daisy reviews the patch, and marks it RFC.\r\n-\r\n-* Jacob reviews the RFC patch, applies it to his checkout, and commits it.\r\n-\r\n-Some tickets require much less feedback than this, but then again some tickets\r\n-require much much more.\r\n-\r\n-Advice for new contributors\r\n-===========================\r\n-\r\n-New contributor and not sure what to do? Want to help but just don't know how to\r\n-get started? This is the section for you.\r\n-\r\n-* **Pick a subject area that you care about, that you are familiar with, or that\r\n-  you want to learn about.**\r\n-\r\n-  You don't already have to be an expert on the area you want to work on; you\r\n-  become an expert through your ongoing contributions to the code.\r\n-\r\n-* **Triage tickets.**\r\n-\r\n-  If a ticket is unreviewed and reports a bug, try and duplicate it.  If you can\r\n-  duplicate it and it seems valid, make a note that you confirmed the bug and\r\n-  accept the ticket. Make sure the ticket is filed under the correct component\r\n-  area. Consider writing a patch that adds a test for the bug's behavior, even\r\n-  if you don't fix the bug itself.\r\n-\r\n-* **Look for tickets that are accepted and review patches to build familiarity\r\n-  with the codebase and the process.**\r\n-\r\n-  Mark the appropriate flags if a patch needs docs or tests. Look through the\r\n-  changes a patch makes, and keep an eye out for syntax that is incompatible\r\n-  with older but still supported versions of Python. Run the tests and make sure\r\n-  they pass on your system.  Where possible and relevant, try them out on a\r\n-  database other than SQLite. Leave comments and feedback!\r\n-\r\n-* **Keep old patches up to date.**\r\n-\r\n-  Oftentimes the codebase will change between a patch being submitted and the\r\n-  time it gets reviewed. Make sure it still applies cleanly and functions as\r\n-  expected. Simply updating a patch is both useful and important!\r\n-\r\n-* **Trac isn't an absolute; the context is just as important as the words.**\r\n-\r\n-  When reading Trac, you need to take into account who says things, and when\r\n-  they were said. Support for an idea two years ago doesn't necessarily mean\r\n-  that the idea will still have support. You also need to pay attention to who\r\n-  *hasn't* spoken -- for example, if a core team member hasn't been recently\r\n-  involved in a discussion, then a ticket may not have the support required to\r\n-  get into trunk.\r\n-\r\n-* **Start small.**\r\n-\r\n-  It's easier to get feedback on a little issue than on a big one.\r\n-\r\n-* **If you're going to engage in a big task, make sure that your idea has\r\n-  support first.**\r\n-\r\n-  This means getting someone else to confirm that a bug is real before you fix\r\n-  the issue, and ensuring that the core team supports a proposed feature before\r\n-  you go implementing it.\r\n-\r\n-* **Be bold! Leave feedback!**\r\n-\r\n-  Sometimes it can be scary to put your opinion out to the world and say \"this\r\n-  ticket is correct\" or \"this patch needs work\", but it's the only way the\r\n-  project moves forward. The contributions of the broad Django community\r\n-  ultimately have a much greater impact than that of the core developers. We\r\n-  can't do it without YOU!\r\n-\r\n-* **Err on the side of caution when marking things Ready For Check-in.**\r\n-\r\n-  If you're really not certain if a ticket is ready, don't mark it as\r\n-  such. Leave a comment instead, letting others know your thoughts.  If you're\r\n-  mostly certain, but not completely certain, you might also try asking on IRC\r\n-  to see if someone else can confirm your suspicions.\r\n-\r\n-* **Wait for feedback, and respond to feedback that you receive.**\r\n-\r\n-  Focus on one or two tickets, see them through from start to finish, and\r\n-  repeat. The shotgun approach of taking on lots of tickets and letting some\r\n-  fall by the wayside ends up doing more harm than good.\r\n-\r\n-* **Be rigorous.**\r\n-\r\n-  When we say \":pep:`8`, and must have docs and tests\", we mean it. If a patch\r\n-  doesn't have docs and tests, there had better be a good reason. Arguments like\r\n-  \"I couldn't find any existing tests of this feature\" don't carry much\r\n-  weight--while it may be true, that means you have the extra-important job of\r\n-  writing the very first tests for that feature, not that you get a pass from\r\n-  writing tests altogether.\r\n-\r\n-.. note::\r\n-\r\n-    The `Reports page`_ contains links to many useful Trac queries, including\r\n-    several that are useful for triaging tickets and reviewing patches as\r\n-    suggested above.\r\n-\r\n-    .. _Reports page: http://code.djangoproject.com/wiki/Reports\r\n-\r\n-\r\n-FAQs\r\n-====\r\n-\r\n-**This ticket I care about has been ignored for days/weeks/months! What can I do\r\n-to get it committed?**\r\n-\r\n-* First off, it's not personal. Django is entirely developed by volunteers (even\r\n-  the core devs), and sometimes folks just don't have time. The best thing to do\r\n-  is to send a gentle reminder to the Django Developers mailing list asking for\r\n-  review on the ticket, or to bring it up in the #django-dev IRC channel.\r\n-\r\n-\r\n-**I'm sure my ticket is absolutely 100% perfect, can I mark it as RFC myself?**\r\n-\r\n-* Short answer: No. It's always better to get another set of eyes on a\r\n-  ticket. If you're having trouble getting that second set of eyes, see question\r\n-  1, above.\r\n-\r\n-\r\n-**My ticket has been in DDN forever! What should I do?**\r\n-\r\n-* Design Decision Needed requires consensus about the right solution.  At the\r\n-  very least it needs consensus among the core developers, and ideally it has\r\n-  consensus from the community as well. The best way to accomplish this is to\r\n-  start a thread on the Django Developers mailing list, and for very complex\r\n-  issues to start a wiki page summarizing the problem and the possible\r\n-  solutions.\r\n+===========================\n+How to contribute to Django\n+===========================\n+\n+Django is developed 100% by the community, and the more people that are actively\n+involved in the code the better Django will be. We recognize that contributing\n+to Django can be daunting at first and sometimes confusing even to\n+veterans. While we have our official \"Contributing to Django\" documentation\n+which spells out the technical details of triaging tickets and submitting\n+patches, it leaves a lot of room for interpretation. This guide aims to offer\n+more general advice on issues such as how to interpret the various stages and\n+flags in Trac, and how new contributors can get started.\n+\n+.. seealso::\n+\n+    This guide is meant to answer the most common questions about\n+    contributing to Django, however it is no substitute for the\n+    :doc:`/internals/contributing` reference. Please make sure to\n+    read that document to understand the specific details\n+    involved in reporting issues and submitting patches.\n+\n+.. _the-spirit-of-contributing:\n+\n+\"The Spirit of Contributing\"\n+============================\n+\n+Django uses Trac_ for managing our progress, and Trac is a community-tended\n+garden of the bugs people have found and the features people would like to see\n+added. As in any garden, sometimes there are weeds to be pulled and sometimes\n+there are flowers and vegetables that need picking. We need your help to sort\n+out one from the other, and in the end we all benefit together.\n+\n+Like all gardens, we can aspire to perfection but in reality there's no such\n+thing. Even in the most pristine garden there are still snails and insects. In a\n+community garden there are also helpful people who--with the best of\n+intentions--fertilize the weeds and poison the roses. It's the job of the\n+community as a whole to self-manage, keep the problems to a minimum, and educate\n+those coming into the community so that they can become valuable contributing\n+members.\n+\n+Similarly, while we aim for Trac to be a perfect representation of the state of\n+Django's progress, we acknowledge that this simply will not happen. By\n+distributing the load of Trac maintenance to the community, we accept that there\n+will be mistakes. Trac is \"mostly accurate\", and we give allowances for the fact\n+that sometimes it will be wrong. That's okay. We're perfectionists with\n+deadlines.\n+\n+We rely on the community to keep participating, keep tickets as accurate as\n+possible, and raise issues for discussion on our mailing lists when there is\n+confusion or disagreement.\n+\n+Django is a community project, and every contribution helps. We can't do this\n+without YOU!\n+\n+.. _Trac: http://code.djangoproject.com/\n+\n+Understanding Trac\n+==================\n+\n+Trac is Django's sole official issue tracker. All known bugs, desired features\n+and ideas for changes are logged there.\n+\n+However, Trac can be quite confusing even to veteran contributors.  Having to\n+look at both flags and triage stages isn't immediately obvious, and the stages\n+themselves can be misinterpreted.\n+\n+.. _triage-stages-explained:\n+\n+What Django's triage stages \"really mean\"\n+-----------------------------------------\n+\n+Unreviewed\n+~~~~~~~~~~\n+\n+The ticket has not been reviewed by anyone who felt qualified to make a judgment\n+about whether the ticket contained a valid issue, a viable feature, or ought to\n+be closed for any of the various reasons.\n+\n+Accepted\n+~~~~~~~~\n+\n+The big grey area! The absolute meaning of \"accepted\" is that the issue\n+described in the ticket is valid and is in some stage of being worked on. Beyond\n+that there are several considerations\n+\n+\n+* **Accepted + No Flags**\n+\n+  The ticket is valid, but no one has submitted a patch for it yet. Often this\n+  means you could safely start writing a patch for it.\n+\n+* **Accepted + Has Patch**\n+\n+  The ticket is waiting for people to review the supplied patch. This means\n+  downloading the patch and trying it out, verifying that it contains tests and\n+  docs, running the test suite with the included patch, and leaving feedback on\n+  the ticket.\n+\n+\n+* **Accepted + Has Patch + (any other flag)**\n+\n+  This means the ticket has been reviewed, and has been found to need further\n+  work. \"Needs tests\" and \"Needs documentation\" are self-explanatory. \"Patch\n+  needs improvement\" will generally be accompanied by a comment on the ticket\n+  explaining what is needed to improve the code.\n+\n+Design Decision Needed\n+~~~~~~~~~~~~~~~~~~~~~~\n+\n+This stage is for issues which may be contentious, may be backwards\n+incompatible, or otherwise involve high-level design decisions. These decisions\n+are generally made by the core committers, however that is not a\n+requirement. See the FAQ below for \"My ticket has been in DDN forever!  What\n+should I do?\"\n+\n+Ready For Checkin\n+~~~~~~~~~~~~~~~~~\n+\n+The ticket was reviewed by any member of the community other than the person who\n+supplied the patch and found to meet all the requirements for a commit-ready\n+patch. A core committer now needs to give the patch a final review prior to\n+being committed. See the FAQ below for \"My ticket has been in RFC forever!  What\n+should I do?\"\n+\n+Someday/Maybe?\n+~~~~~~~~~~~~~~\n+\n+Generally only used for vague/high-level features or design ideas. These tickets\n+are uncommon and overall less useful since they don't describe concrete\n+actionable issues.\n+\n+Fixed on a branch\n+~~~~~~~~~~~~~~~~~\n+\n+Used to indicate that a ticket is resolved as part of a major body of work that\n+will eventually be merged to trunk.  Tickets in this stage generally don't need\n+further work. This may happen in the case of major features/refactors in each\n+release cycle, or as part of the annual Google Summer of Code efforts.\n+\n+.. _closing-tickets:\n+\n+Closing Tickets\n+---------------\n+\n+When a ticket has completed its useful lifecycle, it's time for it to be closed.\n+Closing a ticket is a big responsibility, though. You have to be sure that\n+the issue is really resolved, and you need to keep in mind that the reporter\n+of the ticket may not be happy to have their ticket closed (unless it's fixed,\n+of course). If you're not certain about closing a ticket, just leave a comment\n+with your thoughts instead.\n+\n+If you do close a ticket, you should always make sure of the following:\n+\n+  * Be certain that the issue is resolved.\n+\n+  * Leave a comment explaining the decision to close the ticket.\n+\n+  * If there is a way they can improve the ticket to reopen it, let them know.\n+\n+  * If the ticket is a duplicate, reference the original ticket.\n+\n+  * **Be polite.** No one likes having their ticket closed. It can be\n+    frustrating or even discouraging. The best way to avoid turning people\n+    off from contributing to Django is to be polite and friendly and to offer\n+    suggestions for how they could improve this ticket and other tickets in the\n+    future.\n+\n+.. seealso::\n+\n+    The :ref:`contributing reference <ticket-resolutions>` contains a\n+    description of each of the available resolutions in Trac.\n+\n+Example Trac workflow\n+---------------------\n+\n+Here we see the life-cycle of an average ticket:\n+\n+* Alice creates a ticket, and uploads an incomplete patch (no tests, incorrect\n+  implementation).\n+\n+* Bob reviews the patch, marks it \"Accepted\", \"needs tests\", and \"patch needs\n+  improvement\", and leaves a comment telling Alice how the patch could be\n+  improved.\n+\n+* Alice updates the patch, adding tests (but not changing the\n+  implementation). She removes the two flags.\n+\n+* Charlie reviews the patch and resets the \"patch needs improvement\" flag with\n+  another comment about improving the implementation.\n+\n+* Alice updates the patch, fixing the implementation. She removes the \"patch\n+  needs improvement\" flag.\n+\n+* Daisy reviews the patch, and marks it RFC.\n+\n+* Jacob reviews the RFC patch, applies it to his checkout, and commits it.\n+\n+Some tickets require much less feedback than this, but then again some tickets\n+require much much more.\n+\n+Advice for new contributors\n+===========================\n+\n+New contributor and not sure what to do? Want to help but just don't know how to\n+get started? This is the section for you.\n+\n+* **Pick a subject area that you care about, that you are familiar with, or that\n+  you want to learn about.**\n+\n+  You don't already have to be an expert on the area you want to work on; you\n+  become an expert through your ongoing contributions to the code.\n+\n+* **Triage tickets.**\n+\n+  If a ticket is unreviewed and reports a bug, try and duplicate it.  If you can\n+  duplicate it and it seems valid, make a note that you confirmed the bug and\n+  accept the ticket. Make sure the ticket is filed under the correct component\n+  area. Consider writing a patch that adds a test for the bug's behavior, even\n+  if you don't fix the bug itself.\n+\n+* **Look for tickets that are accepted and review patches to build familiarity\n+  with the codebase and the process.**\n+\n+  Mark the appropriate flags if a patch needs docs or tests. Look through the\n+  changes a patch makes, and keep an eye out for syntax that is incompatible\n+  with older but still supported versions of Python. Run the tests and make sure\n+  they pass on your system.  Where possible and relevant, try them out on a\n+  database other than SQLite. Leave comments and feedback!\n+\n+* **Keep old patches up to date.**\n+\n+  Oftentimes the codebase will change between a patch being submitted and the\n+  time it gets reviewed. Make sure it still applies cleanly and functions as\n+  expected. Simply updating a patch is both useful and important!\n+\n+* **Trac isn't an absolute; the context is just as important as the words.**\n+\n+  When reading Trac, you need to take into account who says things, and when\n+  they were said. Support for an idea two years ago doesn't necessarily mean\n+  that the idea will still have support. You also need to pay attention to who\n+  *hasn't* spoken -- for example, if a core team member hasn't been recently\n+  involved in a discussion, then a ticket may not have the support required to\n+  get into trunk.\n+\n+* **Start small.**\n+\n+  It's easier to get feedback on a little issue than on a big one.\n+\n+* **If you're going to engage in a big task, make sure that your idea has\n+  support first.**\n+\n+  This means getting someone else to confirm that a bug is real before you fix\n+  the issue, and ensuring that the core team supports a proposed feature before\n+  you go implementing it.\n+\n+* **Be bold! Leave feedback!**\n+\n+  Sometimes it can be scary to put your opinion out to the world and say \"this\n+  ticket is correct\" or \"this patch needs work\", but it's the only way the\n+  project moves forward. The contributions of the broad Django community\n+  ultimately have a much greater impact than that of the core developers. We\n+  can't do it without YOU!\n+\n+* **Err on the side of caution when marking things Ready For Check-in.**\n+\n+  If you're really not certain if a ticket is ready, don't mark it as\n+  such. Leave a comment instead, letting others know your thoughts.  If you're\n+  mostly certain, but not completely certain, you might also try asking on IRC\n+  to see if someone else can confirm your suspicions.\n+\n+* **Wait for feedback, and respond to feedback that you receive.**\n+\n+  Focus on one or two tickets, see them through from start to finish, and\n+  repeat. The shotgun approach of taking on lots of tickets and letting some\n+  fall by the wayside ends up doing more harm than good.\n+\n+* **Be rigorous.**\n+\n+  When we say \":pep:`8`, and must have docs and tests\", we mean it. If a patch\n+  doesn't have docs and tests, there had better be a good reason. Arguments like\n+  \"I couldn't find any existing tests of this feature\" don't carry much\n+  weight--while it may be true, that means you have the extra-important job of\n+  writing the very first tests for that feature, not that you get a pass from\n+  writing tests altogether.\n+\n+.. note::\n+\n+    The `Reports page`_ contains links to many useful Trac queries, including\n+    several that are useful for triaging tickets and reviewing patches as\n+    suggested above.\n+\n+    .. _Reports page: http://code.djangoproject.com/wiki/Reports\n+\n+\n+FAQs\n+====\n+\n+**This ticket I care about has been ignored for days/weeks/months! What can I do\n+to get it committed?**\n+\n+* First off, it's not personal. Django is entirely developed by volunteers (even\n+  the core devs), and sometimes folks just don't have time. The best thing to do\n+  is to send a gentle reminder to the Django Developers mailing list asking for\n+  review on the ticket, or to bring it up in the #django-dev IRC channel.\n+\n+\n+**I'm sure my ticket is absolutely 100% perfect, can I mark it as RFC myself?**\n+\n+* Short answer: No. It's always better to get another set of eyes on a\n+  ticket. If you're having trouble getting that second set of eyes, see question\n+  1, above.\n+\n+\n+**My ticket has been in DDN forever! What should I do?**\n+\n+* Design Decision Needed requires consensus about the right solution.  At the\n+  very least it needs consensus among the core developers, and ideally it has\n+  consensus from the community as well. The best way to accomplish this is to\n+  start a thread on the Django Developers mailing list, and for very complex\n+  issues to start a wiki page summarizing the problem and the possible\n+  solutions."
        }
    ],
    "stats": {
        "total": 642,
        "additions": 321,
        "deletions": 321
    }
}