{
    "author": "ptone",
    "message": "Fixed #19562 -- cleaned up password storage docs",
    "sha": "c8eff0dbcb0936aac2748a7a896d08f34b54c50f",
    "files": [
        {
            "sha": "3d95b4b387c56705e4906345bf241728337e8c27",
            "filename": "docs/topics/auth/passwords.txt",
            "status": "modified",
            "additions": 16,
            "deletions": 13,
            "changes": 29,
            "blob_url": "https://github.com/django/django/blob/c8eff0dbcb0936aac2748a7a896d08f34b54c50f/docs%2Ftopics%2Fauth%2Fpasswords.txt",
            "raw_url": "https://github.com/django/django/raw/c8eff0dbcb0936aac2748a7a896d08f34b54c50f/docs%2Ftopics%2Fauth%2Fpasswords.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Ftopics%2Fauth%2Fpasswords.txt?ref=c8eff0dbcb0936aac2748a7a896d08f34b54c50f",
            "patch": "@@ -14,17 +14,19 @@ How Django stores passwords\n ===========================\n \n Django provides a flexible password storage system and uses PBKDF2 by default.\n-Older versions of Django used SHA1, and other algorithms couldn't be chosen.\n \n The :attr:`~django.contrib.auth.models.User.password` attribute of a\n :class:`~django.contrib.auth.models.User` object is a string in this format::\n \n-    algorithm$hash\n+    <algorithm>$<iterations>$<salt>$<hash>\n \n-That's a storage algorithm, and hash, separated by the dollar-sign\n-character. The algorithm is one of a number of one way hashing or password\n-storage algorithms Django can use; see below. The hash is the result of the one-\n-way function.\n+Those are the components used for storing a User's password, separated by the\n+dollar-sign character and consist of: the hashing algorithm, the number of\n+algorithm iterations (work factor), the random salt, and the resulting password\n+hash.  The algorithm is one of a number of one-way hashing or password storage\n+algorithms Django can use; see below. Iterations describe the number of times\n+the algorithm is run over the hash. Salt is the random seed used and the hash\n+is the result of the one-way function.\n \n By default, Django uses the PBKDF2_ algorithm with a SHA256 hash, a\n password stretching mechanism recommended by NIST_. This should be\n@@ -36,13 +38,14 @@ algorithm, or even use a custom algorithm to match your specific\n security situation. Again, most users shouldn't need to do this -- if\n you're not sure, you probably don't.  If you do, please read on:\n \n-Django chooses the an algorithm by consulting the :setting:`PASSWORD_HASHERS`\n-setting. This is a list of hashing algorithm classes that this Django\n-installation supports. The first entry in this list (that is,\n-``settings.PASSWORD_HASHERS[0]``) will be used to store passwords, and all the\n-other entries are valid hashers that can be used to check existing passwords.\n-This means that if you want to use a different algorithm, you'll need to modify\n-:setting:`PASSWORD_HASHERS` to list your preferred algorithm first in the list.\n+Django chooses the algorithm to use by consulting the\n+:setting:`PASSWORD_HASHERS` setting. This is a list of hashing algorithm\n+classes that this Django installation supports. The first entry in this list\n+(that is, ``settings.PASSWORD_HASHERS[0]``) will be used to store passwords,\n+and all the other entries are valid hashers that can be used to check existing\n+passwords.  This means that if you want to use a different algorithm, you'll\n+need to modify :setting:`PASSWORD_HASHERS` to list your preferred algorithm\n+first in the list.\n \n The default for :setting:`PASSWORD_HASHERS` is::\n "
        }
    ],
    "stats": {
        "total": 29,
        "additions": 16,
        "deletions": 13
    }
}