{
    "author": "adrianholovaty",
    "message": "Quick edit of docs/topics/security.txt to catch some basic formatting problems and reword an awkward section\n\ngit-svn-id: http://code.djangoproject.com/svn/django/trunk@17222 bcc190cf-cafb-0310-a4f2-bffc1f526a37",
    "sha": "d3055b3382363163c3352347e69c47f58c3d49a1",
    "files": [
        {
            "sha": "4b393cd1b83863829e3639421a7067eef8cdb383",
            "filename": "docs/topics/security.txt",
            "status": "modified",
            "additions": 27,
            "deletions": 28,
            "changes": 55,
            "blob_url": "https://github.com/django/django/blob/d3055b3382363163c3352347e69c47f58c3d49a1/docs%2Ftopics%2Fsecurity.txt",
            "raw_url": "https://github.com/django/django/raw/d3055b3382363163c3352347e69c47f58c3d49a1/docs%2Ftopics%2Fsecurity.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Ftopics%2Fsecurity.txt?ref=d3055b3382363163c3352347e69c47f58c3d49a1",
            "patch": "@@ -1,9 +1,9 @@\n-====================\n- Security in Django\n-====================\n+==================\n+Security in Django\n+==================\n \n-This document will show you the security features of Django as well\n-as give some advice about securing a Django site.\n+This document is an overview of Django's security features. It includes advice\n+on securing a Django-powered site.\n \n .. _cross-site-scripting:\n \n@@ -15,9 +15,9 @@ Cross site scripting (XSS) protection\n XSS attacks allow a user to inject client side scripts into the browsers of\n other users. This is usually achieved by storing the malicious scripts in the\n database where it will be retrieved and displayed to other users, or by getting\n-users to click a link which will cause the attacker's javascript to be executed\n+users to click a link which will cause the attacker's JavaScript to be executed\n by the user's browser. However, XSS attacks can originate from any untrusted\n-source of data, such as cookies or web services, whenever the data is not\n+source of data, such as cookies or Web services, whenever the data is not\n sufficiently sanitized before including in a page.\n \n Using Django templates protects you against the majority of XSS attacks.\n@@ -34,7 +34,7 @@ protect the following:\n     <style class={{ var }}>...</style>\n \n If ``var`` is set to ``'class1 onmouseover=javascript:func()'``, this can result\n-in unauthorized javascript execution depending on how the browser renders\n+in unauthorized JavaScript execution, depending on how the browser renders\n imperfect HTML.\n \n It is also important to be particularly careful when using ``is_safe`` with\n@@ -64,7 +64,7 @@ control.\n \n :ref:`CSRF protection works <how-csrf-works>` by checking for a nonce in each\n POST request. This ensures that a malicious user cannot simply \"replay\" a form\n-POST to your website and have another logged in user unwittingly submit that\n+POST to your Web site and have another logged in user unwittingly submit that\n form. The malicious user would have to know the nonce, which is user specific\n (using a cookie).\n \n@@ -86,7 +86,6 @@ sparingly and you should always be careful to properly escape any parameters\n that the user can control. In addition, you should exercise caution when using\n :meth:`extra() <django.db.models.query.QuerySet.extra>`.\n \n-\n Clickjacking protection\n =======================\n \n@@ -111,8 +110,8 @@ SSL/HTTPS\n It is always better for security, though not always practical in all cases, to\n deploy your site behind HTTPS. Without this, it is possible for malicious\n network users to sniff authentication credentials or any other information\n-transferred between client and server, and in some cases - **active** network\n-attackers - to alter data that is sent in either direction.\n+transferred between client and server, and in some cases -- **active** network\n+attackers -- to alter data that is sent in either direction.\n \n If you want the protection that HTTPS provides, and have enabled it on your\n server, there are some additional steps to consider to ensure that sensitive\n@@ -128,7 +127,7 @@ information is not leaked:\n   this method usually cannot be relied on, as a client, or a malicious active\n   network attacker, could also set this header.\n \n-  So, for the case of a reverse proxy, it is recommended that the main web\n+  So, for the case of a reverse proxy, it is recommended that the main Web\n   server should be configured to do the redirect to HTTPS, or configured to send\n   HTTP requests to an app that unconditionally redirects to HTTPS.\n \n@@ -145,44 +144,44 @@ information is not leaked:\n \n .. _additional-security-topics:\n \n-Host Headers and Virtual Hosting\n+Host headers and virtual hosting\n ================================\n \n-Django uses the Host header provided by the client to construct URLs\n+Django uses the ``Host`` header provided by the client to construct URLs\n in certain cases. While these values are sanitized to prevent Cross\n Site Scripting attacks, they can be used for Cross-Site Request\n Forgery and cache poisoning attacks in some circumstances. We\n-recommend that users of Django ensure their web-server configuration\n-always validates incoming HTTP Host headers against the expected host\n-name, disallows requests with no Host header, and that the web server\n-not be configured with a catch-all virtual host which forwards\n-requests to a Django application.\n+recommend you ensure your Web server is configured such that:\n+\n+    * It always validates incoming HTTP ``Host`` headers against the expected\n+      host name.\n+    * Disallows requests with no ``Host`` header.\n+    * Is *not* configured with a catch-all virtual host that forwards requests\n+      to a Django application.\n \n-Additionally, as of 1.3.1, Django requires users to explicitly enable\n-support for the X-Forwarded-Host header if their configuration\n-requires it.\n+Additionally, as of 1.3.1, Django requires you to explicitly enable support for\n+the ``X-Forwarded-Host`` header if your configuration requires it.\n \n Additional security topics\n ==========================\n \n While Django provides good security protection out of the box, it is still\n important to properly deploy your application and take advantage of the\n-security protection of the web server, operating system and other components.\n+security protection of the Web server, operating system and other components.\n \n-* Make sure that your Python code is outside of the web server's root. This\n+* Make sure that your Python code is outside of the Web server's root. This\n   will ensure that your Python code is not accidentally served as plain text\n   (or accidentally executed).\n * Take care with any :ref:`user uploaded files <file-upload-security>`.\n * Django does not throttle requests to authenticate users. To protect against\n   brute-force attacks against the authentication system, you may consider\n-  deploying a Django plugin or web server module to throttle these requests.\n+  deploying a Django plugin or Web server module to throttle these requests.\n * If your site accepts file uploads, it is strongly advised that you limit\n-  these uploads in your web server configuration to a reasonable\n+  these uploads in your Web server configuration to a reasonable\n   size in order to prevent denial of service (DOS) attacks. In Apache, this\n   can be easily set using the LimitRequestBody_ directive.\n * Keep your :setting:`SECRET_KEY` a secret.\n * It is a good idea to limit the accessibility of your caching system and\n   database using a firewall.\n \n .. _LimitRequestBody: http://httpd.apache.org/docs/2.2/mod/core.html#limitrequestbody\n-"
        }
    ],
    "stats": {
        "total": 55,
        "additions": 27,
        "deletions": 28
    }
}