{
    "author": "spookylukey",
    "message": "Small corrections to committing-code docs",
    "sha": "f269f305444f3c972e74755e9adff5ef575401d5",
    "files": [
        {
            "sha": "f0f0cc09db7d0cb2b81536dee9ba6c30f90059c8",
            "filename": "docs/internals/contributing/committing-code.txt",
            "status": "modified",
            "additions": 8,
            "deletions": 8,
            "changes": 16,
            "blob_url": "https://github.com/django/django/blob/f269f305444f3c972e74755e9adff5ef575401d5/docs%2Finternals%2Fcontributing%2Fcommitting-code.txt",
            "raw_url": "https://github.com/django/django/raw/f269f305444f3c972e74755e9adff5ef575401d5/docs%2Finternals%2Fcontributing%2Fcommitting-code.txt",
            "contents_url": "https://api.github.com/repos/django/django/contents/docs%2Finternals%2Fcontributing%2Fcommitting-code.txt?ref=f269f305444f3c972e74755e9adff5ef575401d5",
            "patch": "@@ -79,19 +79,19 @@ At this point, you can work on the code and continue as above.\n GitHub provides a one-click merge functionality for pull requests. This should\n only be used if the pull request is 100% ready, and you have checked it for\n errors (or trust the request maker enough to skip checks). Currently, it isn't\n-possible to control that the tests pass and that the docs build without\n-downloading the changes to your developement environment.\n+possible to check that the tests pass and that the docs build without\n+downloading the changes to your development environment.\n \n When rewriting the commit history of a pull request, the goal is to make\n-Django's commit history is as usable as possible:\n+Django's commit history as usable as possible:\n \n * If a patch contains back-and-forth commits, then rewrite those into one.\n   Typically, a commit can add some code, and a second commit can fix\n   stylistic issues introduced in the first commit.\n \n * Separate changes to different commits by logical grouping: if you do a\n-  stylistic cleanup at the same time you do other changes to a file,\n-  separating the changes to two different commits will make reviewing\n+  stylistic cleanup at the same time as you do other changes to a file,\n+  separating the changes into two different commits will make reviewing\n   history easier.\n \n * Beware of merges of upstream branches in the pull requests.\n@@ -100,11 +100,11 @@ Django's commit history is as usable as possible:\n   tests nor the docs should emit warnings.\n \n * Trivial and small patches usually are best done in one commit. Medium to\n-  large work should be split in multiple commits if possible.\n+  large work should be split into multiple commits if possible.\n \n Practicality beats purity, so it is up to each committer to decide how much\n history mangling to do for a pull request. The main points are engaging the\n-community, getting work done, and having an usable commit history.\n+community, getting work done, and having a usable commit history.\n \n .. _committing-guidlines:\n \n@@ -194,7 +194,7 @@ Django's Git repository:\n \n     [1.3.x] Fixed #17028 - Changed diveintopython.org -> diveintopython.net.\n \n-    Backport of 80c0cbf1c97047daed2c5b41b296bbc56fe1d7e3 from trunk.\n+    Backport of 80c0cbf1c97047daed2c5b41b296bbc56fe1d7e3 from master.\n \n Reverting commits\n -----------------"
        }
    ],
    "stats": {
        "total": 16,
        "additions": 8,
        "deletions": 8
    }
}